MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_spi.c
  ### Callback registration:
  The compilation flag USE_HAL_SPI_REGISTER_CALLBACKS allows the user to configure dynamically
  the driver callbacks, via its own method:

  Callback name               | Default value                       | Callback registration function
  ----------------------------| ----------------------------------- | ---------------------------
  ErrorCallback               | HAL_SPI_ErrorCallback()             | HAL_SPI_RegisterErrorCallback()
  TxCpltCallback              | HAL_SPI_TxCpltCallback()            | HAL_SPI_RegisterTxCpltCallback()
  RxCpltCallback              | HAL_SPI_RxCpltCallback()            | HAL_SPI_RegisterRxCpltCallback()
  TxRxCpltCallback            | HAL_SPI_TxRxCpltCallback()          | HAL_SPI_RegisterTxRxCpltCallback()
  TxHalfCpltCallback          | HAL_SPI_TxHalfCpltCallback()        | HAL_SPI_RegisterTxHalfCpltCallback()
  RxHalfCpltCallback          | HAL_SPI_RxHalfCpltCallback()        | HAL_SPI_RegisterRxHalfCpltCallback()
  TxRxHalfCpltCallback        | HAL_SPI_TxRxHalfCpltCallback()      | HAL_SPI_RegisterTxRxHalfCpltCallback()
  AbortCpltCallback           | HAL_SPI_AbortCpltCallback()         | HAL_SPI_RegisterAbortCpltCallback()
  SuspendCallback             | HAL_SPI_SuspendCallback()           | HAL_SPI_RegisterSuspendCallback()

  If one needs to unregister a callback, register the default callback via the registration function.

  By default, after the HAL_SPI_Init() and when the state is HAL_SPI_STATE_INIT, all callbacks are set to the
  corresponding default weak functions.

  Callbacks can be registered in handle global_state HAL_SPI_STATE_INIT and HAL_SPI_STATE_IDLE.

  When the compilation define USE_HAL_SPI_REGISTER_CALLBACKS is set to 0U or not defined, the callback registration
  feature is not available and weak callbacks are used, represented by the default value in the table
  above.

    Note: HAL_SPI_RegisterTxHalfCpltCallback(), HAL_SPI_RegisterRxHalfCpltCallback() and
      HAL_SPI_RegisterTxRxHalfCpltCallback() apply only in DMA mode.

  SuspendCallback restriction:
  SuspendCallback is called only when MasterReceiverAutoSuspend is enabled and
  End Of Transfer (EOF) interrupt is activated. SuspendCallback is used in relation with functions
  HAL_SPI_Transmit_IT, HAL_SPI_Receive_IT and HAL_SPI_TransmitReceive_IT.
  */
/**
  * @}
  */

/** @defgroup SPI_Configuration_Table SPI Configuration Table
  * @{
  ## Configuration inside the SPI driver:

Software configuration defined in stm32c5xx_hal_conf.h:
Preprocessor flags             |   Default value   | Comment
------------------------------ | ----------------- | ------------------------------------------------
USE_HAL_SPI_MODULE             |         1         | Enable HAL SPI driver module
USE_HAL_SPI_REGISTER_CALLBACKS |         0         | Allow the user to define their own callback
USE_HAL_SPI_DMA                |         1         | Enable DMA code inside SPI
USE_HAL_CHECK_PARAM            |         0         | Enable runtime parameter check
USE_HAL_SPI_CLK_ENABLE_MODEL   | HAL_CLK_ENABLE_NO | Enable the gating of the peripheral clock
USE_HAL_CHECK_PROCESS_STATE    |         0         | Enable atomicity of process state check
USE_HAL_MUTEX                  |         0         | Enable semaphore creation for OS
USE_HAL_SPI_USER_DATA          |         0         | Add a user data inside HAL SPI handle
USE_HAL_SPI_GET_LAST_ERRORS    |         0         | Enable retrieval of last processes error codes
USE_HAL_SPI_CRC                |         1         | Enable the use of CRC feature inside driver

Software configuration defined in preprocessor environment:
Preprocessor flags             |   Default value   | Comment
------------------------------ | ----------------- | ------------------------------------------------
USE_ASSERT_DBG_PARAM           |    Not defined    | Enable check param for HAL and LL
USE_ASSERT_DBG_STATE           |    Not defined    | Enable check state for HAL

  */
/**
  * @}
  */
#if defined(SPI1) || defined(SPI2) || defined(SPI3)
#if defined(USE_HAL_SPI_MODULE) && (USE_HAL_SPI_MODULE == 1)

/* Private defines -----------------------------------------------------------*/
/** @defgroup SPI_Private_Constants SPI Private Constants
  * @{
  */
#define SPI_DEFAULT_TIMEOUT             100UL  /*!< Timeout default value     */

#define SPI_FIFO_SIZE                   16UL   /*!< Standard size 16-Bytes */


/**
  * @}
  */

/* Private macros ------------------------------------------------------------*/

/** @defgroup SPI_Private_Macros SPI Private Macros
  * @{
  */

/**
  * @brief Convert bits to Bytes.
  */
#define CONVERT_TO_BYTES(value)        (((value)>>3UL)+1UL)

/**
  * @brief Get PacketSize from Datasize and Fifo Threshold.
  */
#define GET_PACKET_SIZE(data_width, fifo_threshold)   ((((fifo_threshold)>>SPI_CFG1_FTHLV_Pos)+1UL) *         \
                                                       (CONVERT_TO_BYTES((data_width) >> SPI_CFG1_DSIZE_Pos)))

/**
  * @brief Check if the packet length is supported by FIFO capacity.
  */
#define IS_SPI_PACKET_SIZE(packet_length) ((packet_length) <= SPI_FIFO_SIZE)

/**
  * @brief Check if the mode is type of hal_spi_mode_t.
  */
#define IS_SPI_MODE(mode)    (((mode) == HAL_SPI_MODE_SLAVE)                   \
                              || ((mode) == HAL_SPI_MODE_MASTER))

/**
  * @brief Check if the direction is type of hal_spi_direction_t.
  */
#define IS_SPI_DIRECTION(dir)    (((dir) == HAL_SPI_DIRECTION_FULL_DUPLEX)              \
                                  || ((dir) == HAL_SPI_DIRECTION_SIMPLEX_TX)            \
                                  || ((dir) == HAL_SPI_DIRECTION_SIMPLEX_RX)            \
                                  || ((dir) == HAL_SPI_DIRECTION_HALF_DUPLEX))

/**
  * @brief Check if the data width is type of hal_spi_data_width_t.
  */
#define IS_SPI_DATA_WIDTH(width)    (((width) == HAL_SPI_DATA_WIDTH_4_BIT)                    \
                                     || ((width) == HAL_SPI_DATA_WIDTH_5_BIT)                 \
                                     || ((width) == HAL_SPI_DATA_WIDTH_6_BIT)                 \
                                     || ((width) == HAL_SPI_DATA_WIDTH_7_BIT)                 \
                                     || ((width) == HAL_SPI_DATA_WIDTH_8_BIT)                 \
                                     || ((width) == HAL_SPI_DATA_WIDTH_9_BIT)                 \
                                     || ((width) == HAL_SPI_DATA_WIDTH_10_BIT)                \
                                     || ((width) == HAL_SPI_DATA_WIDTH_11_BIT)                \
                                     || ((width) == HAL_SPI_DATA_WIDTH_12_BIT)                \
                                     || ((width) == HAL_SPI_DATA_WIDTH_13_BIT)                \
                                     || ((width) == HAL_SPI_DATA_WIDTH_14_BIT)                \
                                     || ((width) == HAL_SPI_DATA_WIDTH_15_BIT)                \
                                     || ((width) == HAL_SPI_DATA_WIDTH_16_BIT)                \
                                     || ((width) == HAL_SPI_DATA_WIDTH_17_BIT)                \
                                     || ((width) == HAL_SPI_DATA_WIDTH_18_BIT)                \
                                     || ((width) == HAL_SPI_DATA_WIDTH_19_BIT)                \
                                     || ((width) == HAL_SPI_DATA_WIDTH_20_BIT)                \
                                     || ((width) == HAL_SPI_DATA_WIDTH_21_BIT)                \
                                     || ((width) == HAL_SPI_DATA_WIDTH_22_BIT)                \
                                     || ((width) == HAL_SPI_DATA_WIDTH_23_BIT)                \
                                     || ((width) == HAL_SPI_DATA_WIDTH_24_BIT)                \
                                     || ((width) == HAL_SPI_DATA_WIDTH_25_BIT)                \
                                     || ((width) == HAL_SPI_DATA_WIDTH_26_BIT)                \
                                     || ((width) == HAL_SPI_DATA_WIDTH_27_BIT)                \
                                     || ((width) == HAL_SPI_DATA_WIDTH_28_BIT)                \
                                     || ((width) == HAL_SPI_DATA_WIDTH_29_BIT)                \
                                     || ((width) == HAL_SPI_DATA_WIDTH_30_BIT)                \
                                     || ((width) == HAL_SPI_DATA_WIDTH_31_BIT)                \
                                     || ((width) == HAL_SPI_DATA_WIDTH_32_BIT))

/**
  * @brief Check if the clock polarity is type of hal_spi_clock_polarity_t.
  */
#define IS_SPI_POLARITY(polarity)    (((polarity) == HAL_SPI_CLOCK_POLARITY_LOW)             \
                                      || ((polarity) == HAL_SPI_CLOCK_POLARITY_HIGH))

/**
  * @brief Check if the clock phase is type of hal_spi_clock_phase_t.
  */
#define IS_SPI_PHASE(phase)    (((phase) == HAL_SPI_CLOCK_PHASE_1_EDGE)                      \
                                || ((phase) == HAL_SPI_CLOCK_PHASE_2_EDGE))

/**
  * @brief Check if the prescaler is type of hal_spi_baud_rate_prescaler_t.
  */
#define IS_SPI_PRESCALER(prescaler)    (((prescaler) == HAL_SPI_BAUD_RATE_PRESCALER_2)        \
                                        || ((prescaler) == HAL_SPI_BAUD_RATE_PRESCALER_4)     \
                                        || ((prescaler) == HAL_SPI_BAUD_RATE_PRESCALER_8)     \
                                        || ((prescaler) == HAL_SPI_BAUD_RATE_PRESCALER_16)    \
                                        || ((prescaler) == HAL_SPI_BAUD_RATE_PRESCALER_32)    \
                                        || ((prescaler) == HAL_SPI_BAUD_RATE_PRESCALER_64)    \
                                        || ((prescaler) == HAL_SPI_BAUD_RATE_PRESCALER_128)   \
                                        || ((prescaler) == HAL_SPI_BAUD_RATE_PRESCALER_256)   \
                                        || ((prescaler) == HAL_SPI_BAUD_RATE_PRESCALER_BYPASS))

/**
  * @brief Check if the first bit is type of hal_spi_first_bit_t.
  */
#define IS_SPI_FIRST_BIT(first_bit)    (((first_bit) == HAL_SPI_MSB_FIRST)                \
                                        || ((first_bit) == HAL_SPI_LSB_FIRST))
#if defined(USE_HAL_SPI_CRC) && (USE_HAL_SPI_CRC == 1)

/**
  * @brief Check if the crc length is type of hal_spi_crc_length_t.
  */
#define IS_SPI_CRC_LENGTH(length)    (((length) == HAL_SPI_CRC_LENGTH_DATASIZE)               \
                                      || ((length) == HAL_SPI_CRC_LENGTH_4_BIT)               \
                                      || ((length) == HAL_SPI_CRC_LENGTH_5_BIT)               \
                                      || ((length) == HAL_SPI_CRC_LENGTH_6_BIT)               \
                                      || ((length) == HAL_SPI_CRC_LENGTH_7_BIT)               \
                                      || ((length) == HAL_SPI_CRC_LENGTH_8_BIT)               \
                                      || ((length) == HAL_SPI_CRC_LENGTH_9_BIT)               \
                                      || ((length) == HAL_SPI_CRC_LENGTH_10_BIT)              \
                                      || ((length) == HAL_SPI_CRC_LENGTH_11_BIT)              \
                                      || ((length) == HAL_SPI_CRC_LENGTH_12_BIT)              \
                                      || ((length) == HAL_SPI_CRC_LENGTH_13_BIT)              \
                                      || ((length) == HAL_SPI_CRC_LENGTH_14_BIT)              \
                                      || ((length) == HAL_SPI_CRC_LENGTH_15_BIT)              \
                                      || ((length) == HAL_SPI_CRC_LENGTH_16_BIT)              \
                                      || ((length) == HAL_SPI_CRC_LENGTH_17_BIT)              \
                                      || ((length) == HAL_SPI_CRC_LENGTH_18_BIT)              \
                                      || ((length) == HAL_SPI_CRC_LENGTH_19_BIT)              \
                                      || ((length) == HAL_SPI_CRC_LENGTH_20_BIT)              \
                                      || ((length) == HAL_SPI_CRC_LENGTH_21_BIT)              \
                                      || ((length) == HAL_SPI_CRC_LENGTH_22_BIT)              \
                                      || ((length) == HAL_SPI_CRC_LENGTH_23_BIT)              \
                                      || ((length) == HAL_SPI_CRC_LENGTH_24_BIT)              \
                                      || ((length) == HAL_SPI_CRC_LENGTH_25_BIT)              \
                                      || ((length) == HAL_SPI_CRC_LENGTH_26_BIT)              \
                                      || ((length) == HAL_SPI_CRC_LENGTH_27_BIT)              \
                                      || ((length) == HAL_SPI_CRC_LENGTH_28_BIT)              \
                                      || ((length) == HAL_SPI_CRC_LENGTH_29_BIT)              \
                                      || ((length) == HAL_SPI_CRC_LENGTH_30_BIT)              \
                                      || ((length) == HAL_SPI_CRC_LENGTH_31_BIT)              \
                                      || ((length) == HAL_SPI_CRC_LENGTH_32_BIT))

/**
  * @brief Check if the crc init pattern is type of hal_spi_crc_tx_init_pattern_t.
  */
#define IS_SPI_CRC_TX_INIT_PATTERN(pattern)    (((pattern) == HAL_SPI_CRC_TX_INIT_PATTERN_ALL_ZERO)    \
                                                || ((pattern) == HAL_SPI_CRC_TX_INIT_PATTERN_ALL_ONE))

/**
  * @brief Check if the crc init pattern is type of hal_spi_crc_rx_init_pattern_t.
  */
#define IS_SPI_CRC_RX_INIT_PATTERN(pattern)    (((pattern) == HAL_SPI_CRC_RX_INIT_PATTERN_ALL_ZERO)    \
                                                || ((pattern) == HAL_SPI_CRC_RX_INIT_PATTERN_ALL_ONE))

#endif /* USE_HAL_SPI_CRC */
/**
  * @brief Check if the nss management is type of hal_spi_nss_pin_management_t.
  */
#define IS_SPI_NSS_PIN_MANAGEMENT(management)  (((management) == HAL_SPI_NSS_PIN_MGMT_INTERNAL)        \
                                                || ((management) == HAL_SPI_NSS_PIN_MGMT_INPUT)        \
                                                || ((management) == HAL_SPI_NSS_PIN_MGMT_OUTPUT))

/**
  * @brief Check if the nss pulse state is type of hal_spi_nss_pulse_t.
  */
#define IS_SPI_NSS_PULSE(state)    (((state) == HAL_SPI_NSS_PULSE_DISABLE)                            \
                                    || ((state) == HAL_SPI_NSS_PULSE_ENABLE))


/**
  * @brief Check if the nss polarity is type of hal_spi_nss_polarity_t.
  */
#define IS_SPI_NSS_POLARITY(polarity)    (((polarity) == HAL_SPI_NSS_POLARITY_LOW)                    \
                                          || ((polarity) == HAL_SPI_NSS_POLARITY_HIGH))

/**
  * @brief Check if the mssi cycle is type of hal_spi_nss_master_slave_signal_idleness_delay_t.
  */
#define IS_SPI_NSS_MSSI_DELAY(cycle)  (((cycle) == HAL_SPI_NSS_MSSI_DELAY_0_CYCLE)                        \
                                       || ((cycle) == HAL_SPI_NSS_MSSI_DELAY_1_CYCLE)                     \
                                       || ((cycle) == HAL_SPI_NSS_MSSI_DELAY_2_CYCLE)                     \
                                       || ((cycle) == HAL_SPI_NSS_MSSI_DELAY_3_CYCLE)                     \
                                       || ((cycle) == HAL_SPI_NSS_MSSI_DELAY_4_CYCLE)                     \
                                       || ((cycle) == HAL_SPI_NSS_MSSI_DELAY_5_CYCLE)                     \
                                       || ((cycle) == HAL_SPI_NSS_MSSI_DELAY_6_CYCLE)                     \
                                       || ((cycle) == HAL_SPI_NSS_MSSI_DELAY_7_CYCLE)                     \
                                       || ((cycle) == HAL_SPI_NSS_MSSI_DELAY_8_CYCLE)                     \
                                       || ((cycle) == HAL_SPI_NSS_MSSI_DELAY_9_CYCLE)                     \
                                       || ((cycle) == HAL_SPI_NSS_MSSI_DELAY_10_CYCLE)                    \
                                       || ((cycle) == HAL_SPI_NSS_MSSI_DELAY_11_CYCLE)                    \
                                       || ((cycle) == HAL_SPI_NSS_MSSI_DELAY_12_CYCLE)                    \
                                       || ((cycle) == HAL_SPI_NSS_MSSI_DELAY_13_CYCLE)                    \
                                       || ((cycle) == HAL_SPI_NSS_MSSI_DELAY_14_CYCLE)                    \
                                       || ((cycle) == HAL_SPI_NSS_MSSI_DELAY_15_CYCLE))

/**
  * @brief Check if the midi delay is type of hal_spi_master_inter_data_idleness_delay_t.
  */
#define IS_SPI_MIDI_DELAY(delay)    (((delay) == HAL_SPI_MIDI_DELAY_0_CYCLE)                              \
                                     || ((delay) == HAL_SPI_MIDI_DELAY_1_CYCLE)                           \
                                     || ((delay) == HAL_SPI_MIDI_DELAY_2_CYCLE)                           \
                                     || ((delay) == HAL_SPI_MIDI_DELAY_3_CYCLE)                           \
                                     || ((delay) == HAL_SPI_MIDI_DELAY_4_CYCLE)                           \
                                     || ((delay) == HAL_SPI_MIDI_DELAY_5_CYCLE)                           \
                                     || ((delay) == HAL_SPI_MIDI_DELAY_6_CYCLE)                           \
                                     || ((delay) == HAL_SPI_MIDI_DELAY_7_CYCLE)                           \
                                     || ((delay) == HAL_SPI_MIDI_DELAY_8_CYCLE)                           \
                                     || ((delay) == HAL_SPI_MIDI_DELAY_9_CYCLE)                           \
                                     || ((delay) == HAL_SPI_MIDI_DELAY_10_CYCLE)                          \
                                     || ((delay) == HAL_SPI_MIDI_DELAY_11_CYCLE)                          \
                                     || ((delay) == HAL_SPI_MIDI_DELAY_12_CYCLE)                          \
                                     || ((delay) == HAL_SPI_MIDI_DELAY_13_CYCLE)                          \
                                     || ((delay) == HAL_SPI_MIDI_DELAY_14_CYCLE)                          \
                                     || ((delay) == HAL_SPI_MIDI_DELAY_15_CYCLE))

/**
  * @brief Check if the threshold is type of hal_spi_underrun_behavior_t.
  */
#define IS_SPI_UNDERRUN_BEHAV(behavior)    (((behavior) == HAL_SPI_UNDERRUN_BEHAV_REGISTER_PATTERN)        \
                                            || ((behavior) == HAL_SPI_UNDERRUN_BEHAV_LAST_RECEIVED))


/**
  * @brief Check if the ready pin polarity is type of hal_spi_ready_pin_polarity_t.
  */
#define IS_SPI_RDY_PIN_POLARITY(polarity)    (((polarity) == HAL_SPI_READY_PIN_POLARITY_HIGH)               \
                                              || ((polarity) == HAL_SPI_READY_PIN_POLARITY_LOW))

/**
  * @brief Check if the transfer size is valid when crc is disabled.
  */
#define IS_SPI_TRANSFER_SIZE(size)        (((size) < 0xFFFF) && (size) != 0)

/**
  * @brief Check if the threshold is type of hal_spi_fifo threshold_t.
  */
#define IS_SPI_FIFO_THRESHOLD(threshold)    (((threshold) == HAL_SPI_FIFO_THRESHOLD_1_DATA)                   \
                                             || ((threshold) == HAL_SPI_FIFO_THRESHOLD_2_DATA)                \
                                             || ((threshold) == HAL_SPI_FIFO_THRESHOLD_3_DATA)                \
                                             || ((threshold) == HAL_SPI_FIFO_THRESHOLD_4_DATA)                \
                                             || ((threshold) == HAL_SPI_FIFO_THRESHOLD_5_DATA)                \
                                             || ((threshold) == HAL_SPI_FIFO_THRESHOLD_6_DATA)                \
                                             || ((threshold) == HAL_SPI_FIFO_THRESHOLD_7_DATA)                \
                                             || ((threshold) == HAL_SPI_FIFO_THRESHOLD_8_DATA)                \
                                             || ((threshold) == HAL_SPI_FIFO_THRESHOLD_9_DATA)                \
                                             || ((threshold) == HAL_SPI_FIFO_THRESHOLD_10_DATA)               \
                                             || ((threshold) == HAL_SPI_FIFO_THRESHOLD_11_DATA)               \
                                             || ((threshold) == HAL_SPI_FIFO_THRESHOLD_12_DATA)               \
                                             || ((threshold) == HAL_SPI_FIFO_THRESHOLD_13_DATA)               \
                                             || ((threshold) == HAL_SPI_FIFO_THRESHOLD_14_DATA)               \
                                             || ((threshold) == HAL_SPI_FIFO_THRESHOLD_15_DATA)               \
                                             || ((threshold) == HAL_SPI_FIFO_THRESHOLD_16_DATA))

/**
  * @brief Check if the direction is Full-duplex.
  */
#define IS_SPI_DIRECTION_FULL_DUPLEX(mode) ((mode) == HAL_SPI_DIRECTION_FULL_DUPLEX)

/**
  * @brief Check if the direction is possible for TX transfer.
  */
#define IS_SPI_DIRECTION_TX_AVAILABLE(mode) (((mode) == HAL_SPI_DIRECTION_FULL_DUPLEX)                      \
                                             || ((mode) == HAL_SPI_DIRECTION_HALF_DUPLEX)                   \
                                             || ((mode) == HAL_SPI_DIRECTION_SIMPLEX_TX))

/**
  * @brief Check if the direction is possible for RX transfer.
  */
#define IS_SPI_DIRECTION_RX_AVAILABLE(mode) (((mode) == HAL_SPI_DIRECTION_FULL_DUPLEX)                     \
                                             || ((mode) == HAL_SPI_DIRECTION_HALF_DUPLEX)                  \
                                             || ((mode) == HAL_SPI_DIRECTION_SIMPLEX_RX))


/**
  * @brief Check if the CRC polynomial exists.
  */
#define IS_SPI_CRC_POLYNOMIAL(polynomial)                ((polynomial) > 0x0UL)
/**
  * @brief Check the consistency between polynomial and its size.
  */
#define IS_SPI_CRC_POLYNOMIAL_SIZE(polynomial, length)\
  (((polynomial) >> (((length) >> SPI_CFG1_CRCSIZE_Pos) + 1UL)) == 0UL)

/**
  * @}
  */

