MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_spi.c
/* Private function prototypes -----------------------------------------------*/
/** @defgroup SPI_Private_Functions SPI Private Functions
  * @{
  */
#if defined (USE_HAL_SPI_DMA) && (USE_HAL_SPI_DMA == 1)
static void SPI_DMATransmitCplt(hal_dma_handle_t *hdma);
static void SPI_DMAReceiveCplt(hal_dma_handle_t *hdma);
static void SPI_DMATransmitReceiveCplt(hal_dma_handle_t *hdma);
static void SPI_DMAHalfTransmitCplt(hal_dma_handle_t *hdma);
static void SPI_DMAHalfReceiveCplt(hal_dma_handle_t *hdma);
static void SPI_DMAHalfTransmitReceiveCplt(hal_dma_handle_t *hdma);
static void SPI_DMAError(hal_dma_handle_t *hdma);
static void SPI_DMAAbortOnError(hal_dma_handle_t *hdma);
static void SPI_DMATxAbortCallback(hal_dma_handle_t *hdma);
static void SPI_DMARxAbortCallback(hal_dma_handle_t *hdma);
static void SPI_DMAEmptyCallback(hal_dma_handle_t *hdma);
#endif /* USE_HAL_SPI_DMA  */
static hal_status_t SPI_WaitEndOfTransfer(hal_spi_handle_t *hspi,
                                          uint32_t timeout_ms, uint32_t tick_start);
static void SPI_TxISR_8BIT(hal_spi_handle_t *hspi);
static void SPI_TxISR_16BIT(hal_spi_handle_t *hspi);
static void SPI_TxISR_32BIT(hal_spi_handle_t *hspi);
static void SPI_RxISR_8BIT(hal_spi_handle_t *hspi);
static void SPI_RxISR_16BIT(hal_spi_handle_t *hspi);
static void SPI_RxISR_32BIT(hal_spi_handle_t *hspi);
static void SPI_AbortTransfer(hal_spi_handle_t *hspi);
static hal_status_t SPI_CloseTransfer(hal_spi_handle_t *hspi);

/**
  * @}
  */

/* Exported functions --------------------------------------------------------*/
/** @addtogroup SPI_Exported_Functions SPI Exported Functions
  * @{
  */

/** @addtogroup SPI_Exported_Functions_Group1 Initialization / De-Initialization functions
  * @{

  This subsection provides a set of functions allowing to initialize and de-initialize the SPIx peripheral:
    - Call the function HAL_SPI_Init() to initialize the selected SPI handle and associate an instance.
    - Call the function HAL_SPI_DeInit() to restore the default initialization of the selected SPIx peripheral.

  */

/**
  * @brief Initialize the SPI according to the associated handle.
  * @param hspi Pointer to a \ref hal_spi_handle_t structure which contains
  *             the SPI instance.
  * @param instance SPI instance.
  * @retval HAL_INVALID_PARAM When the handle is NULL.
  * @retval HAL_ERROR When the MUTEX cannot be created.
  * @retval HAL_OK HAL SPI driver correctly Initialized for the given SPI instance.
  */
hal_status_t HAL_SPI_Init(hal_spi_handle_t *hspi, hal_spi_t instance)
{
  ASSERT_DBG_PARAM(hspi != NULL);
  ASSERT_DBG_PARAM(IS_SPI_ALL_INSTANCE((SPI_TypeDef *)((uint32_t)instance)));

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if (hspi == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  hspi->instance = instance;

#if defined(USE_HAL_SPI_REGISTER_CALLBACKS) && (USE_HAL_SPI_REGISTER_CALLBACKS == 1)

  /* Init the SPI Callback settings */
  hspi->p_error_cb           = HAL_SPI_ErrorCallback;        /* Legacy weak ErrorCallback        */
  hspi->p_tx_cplt_cb         = HAL_SPI_TxCpltCallback;       /* Legacy weak TxCpltCallback       */
  hspi->p_rx_cplt_cb         = HAL_SPI_RxCpltCallback;       /* Legacy weak RxCpltCallback       */
  hspi->p_tx_rx_cplt_cb      = HAL_SPI_TxRxCpltCallback;     /* Legacy weak TxRxCpltCallback     */
  hspi->p_tx_half_cplt_cb    = HAL_SPI_TxHalfCpltCallback;   /* Legacy weak TxHalfCpltCallback   */
  hspi->p_rx_half_cplt_cb    = HAL_SPI_RxHalfCpltCallback;   /* Legacy weak RxHalfCpltCallback   */
  hspi->p_tx_rx_half_cplt_cb = HAL_SPI_TxRxHalfCpltCallback; /* Legacy weak TxRxHalfCpltCallback */
  hspi->p_abort_cplt_cb      = HAL_SPI_AbortCpltCallback;    /* Legacy weak AbortCpltCallback    */
  hspi->p_suspend_cb         = HAL_SPI_SuspendCallback;      /* Legacy weak SuspendCallback      */
#endif /* USE_HAL_SPI_REGISTER_CALLBACKS */

  /* Other internal fields */
  hspi->p_tx_buff            = (uint8_t *)  NULL;
  hspi->tx_xfer_size         = (uint16_t)   0UL;
  hspi->tx_xfer_count        = (uint16_t)   0UL;
  hspi->p_rx_buff            = (uint8_t *)  NULL;
  hspi->rx_xfer_size         = (uint16_t)   0UL;
  hspi->rx_xfer_count        = (uint16_t)   0UL;

#if defined (USE_HAL_SPI_DMA) && (USE_HAL_SPI_DMA == 1)
  hspi->hdma_tx              = (hal_dma_handle_t *) NULL;
  hspi->hdma_rx              = (hal_dma_handle_t *) NULL;
#endif /* USE_HAL_SPI_DMA  */

#if defined(USE_HAL_SPI_USER_DATA) && (USE_HAL_SPI_USER_DATA == 1)
  hspi->p_user_data          = NULL;
#endif /* USE_HAL_SPI_USER_DATA */

#if defined (USE_HAL_SPI_GET_LAST_ERRORS) && (USE_HAL_SPI_GET_LAST_ERRORS == 1)
  /* Reset the last_error_codes variable storing the last errors */
  hspi->last_error_codes    = HAL_SPI_ERROR_NONE;
#endif /* USE_HAL_SPI_GET_LAST_ERRORS */

#if defined(USE_HAL_SPI_CLK_ENABLE_MODEL) && (USE_HAL_SPI_CLK_ENABLE_MODEL > HAL_CLK_ENABLE_NO)
  /* Enable the SPI peripheral clock */
  switch (hspi->instance)
  {
#if defined(SPI1)
    case HAL_SPI1:
      HAL_RCC_SPI1_EnableClock();
      break;
#endif /* SPI1 */
#if defined(SPI2)
    case HAL_SPI2:
      HAL_RCC_SPI2_EnableClock();
      break;
#endif /* SPI2 */
#if defined(SPI3)
    case HAL_SPI3:
      HAL_RCC_SPI3_EnableClock();
      break;
#endif /* SPI3 */
    default:
      break;
  }

#endif /* USE_HAL_SPI_CLK_ENABLE_MODEL */

#if defined(USE_HAL_MUTEX) && (USE_HAL_MUTEX == 1)
  /* Create the SPI semaphore */
  if (HAL_OS_SemaphoreCreate(&hspi->semaphore) != HAL_OS_OK)
  {
    return HAL_ERROR;
  }
#endif /* USE_SPI_MUTEX  */

  hspi->global_state         = HAL_SPI_STATE_INIT;

  return HAL_OK;
}

/**
  * @brief De-Initialize the HAL SPI driver for the given handle.
  * @param hspi Pointer to a \ref hal_spi_handle_t structure which contains
  *             the SPI instance.
  */
void HAL_SPI_DeInit(hal_spi_handle_t *hspi)
{
  hal_spi_state_t temp_state;

  ASSERT_DBG_PARAM(hspi != NULL);
  ASSERT_DBG_PARAM(IS_SPI_ALL_INSTANCE((SPI_TypeDef *)((uint32_t)hspi->instance)));

  temp_state = hspi->global_state;
  /* Check if any transfer ongoing */
  if ((temp_state == HAL_SPI_STATE_TX_ACTIVE) || (temp_state == HAL_SPI_STATE_RX_ACTIVE)
      || (temp_state == HAL_SPI_STATE_TX_RX_ACTIVE))
  {
#if defined (USE_HAL_SPI_DMA) && (USE_HAL_SPI_DMA == 1)
    /* Disable the SPI DMA Tx request if enabled */
    if (LL_SPI_IsEnabledDMAReq_TX((SPI_TypeDef *)((uint32_t)hspi->instance)) != 0U)
    {
      if (hspi->hdma_tx != NULL)
      {
        /* Abort DMA Tx Handle linked to SPI peripheral */
        (void)HAL_DMA_Abort(hspi->hdma_tx);
      }
    }

    /* Disable the SPI DMA Rx request if enabled */
    if (LL_SPI_IsEnabledDMAReq_RX((SPI_TypeDef *)((uint32_t)hspi->instance)) != 0U)
    {
      if (hspi->hdma_rx != NULL)
      {
        /* Abort DMA Rx Handle linked to SPI peripheral */
        (void)HAL_DMA_Abort(hspi->hdma_rx);
      }
    }
#endif /* USE_HAL_SPI_DMA */

    SPI_AbortTransfer(hspi);
  }

