MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_spi.c
  LL_SPI_Disable((SPI_TypeDef *)((uint32_t)hspi->instance));

#if defined (USE_HAL_SPI_GET_LAST_ERRORS) && (USE_HAL_SPI_GET_LAST_ERRORS == 1)
  /* Reset the last_error_codes variable storing the last errors */
  hspi->last_error_codes    = HAL_SPI_ERROR_NONE;
#endif /* USE_HAL_SPI_GET_LAST_ERRORS */

#if defined(USE_HAL_MUTEX) && (USE_HAL_MUTEX == 1)
  (void)HAL_OS_SemaphoreDelete(&hspi->semaphore);
#endif /* USE_SPI_MUTEX  */

  hspi->global_state         = HAL_SPI_STATE_RESET;
}

/**
  * @}
  */

/** @addtogroup SPI_Exported_Functions_Group2 General Config functions
  * @{
  This subsection provides a set of functions allowing to configure the SPIx peripheral:
    - Call the function HAL_SPI_SetConfig() to configure the selected device with the selected configuration:
      - Mode
      - Direction
      - Data Width
      - Clock Polarity and Phase
      - Baud Rate Prescaler
      - FirstBit
      - Chip select management
    - Call the function HAL_SPI_GetConfig() to retrieve the current global configuration set by the user.
  */

/**
  * @brief Set the configuration to the SPI peripheral.
  * @param hspi Pointer to a \ref hal_spi_handle_t structure which contains
  *             the SPI instance.
  * @param p_config Pointer to hal_spi_config_t configuration structure.
  * @retval HAL_INVALID_PARAM Invalid parameters.
  * @retval HAL_ERROR When io locked.
  * @retval HAL_OK SPI instance has been correctly configured.
  */
hal_status_t HAL_SPI_SetConfig(hal_spi_handle_t *hspi, const hal_spi_config_t *p_config)
{
  ASSERT_DBG_PARAM(hspi != NULL);
  ASSERT_DBG_PARAM(p_config != NULL);

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if (p_config == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  ASSERT_DBG_PARAM(IS_SPI_MODE(p_config->mode));
  ASSERT_DBG_PARAM(IS_SPI_DIRECTION(p_config->direction));
  ASSERT_DBG_PARAM(IS_SPI_DATA_WIDTH(p_config->data_width));
  ASSERT_DBG_PARAM(IS_SPI_POLARITY(p_config->clock_polarity));
  ASSERT_DBG_PARAM(IS_SPI_PHASE(p_config->clock_phase));
  ASSERT_DBG_PARAM(IS_SPI_PRESCALER(p_config->baud_rate_prescaler));
  ASSERT_DBG_PARAM(IS_SPI_FIRST_BIT(p_config->first_bit));
  ASSERT_DBG_PARAM(IS_SPI_NSS_PIN_MANAGEMENT(p_config->nss_pin_management));


  ASSERT_DBG_STATE(hspi->global_state, HAL_SPI_STATE_IDLE | HAL_SPI_STATE_INIT);

  /* Check for IOLock */
  if ((LL_SPI_IsEnabledIOLock((SPI_TypeDef *)((uint32_t)hspi->instance))) != 0UL)
  {
    return HAL_ERROR;
  }

  /* Set SPI generic configuration */
  LL_SPI_SetConfig((SPI_TypeDef *)((uint32_t)hspi->instance),
                   (uint32_t)p_config->data_width | (uint32_t)p_config->baud_rate_prescaler,
                   (uint32_t)p_config->mode | (uint32_t)p_config->direction |
                   (uint32_t)p_config->clock_polarity | (uint32_t)p_config->clock_phase |
                   (uint32_t)p_config->first_bit | (uint32_t)p_config->nss_pin_management);


  /* Store SPI direction into the handle */
  hspi->direction = p_config->direction;

  hspi->global_state = HAL_SPI_STATE_IDLE;

  return HAL_OK;
}

/**
  * @brief Retrieve the configuration from the SPI peripheral.
  * @param hspi Pointer to a \ref hal_spi_handle_t structure which contains
  *             the SPI instance.
  * @param p_config Pointer to hal_spi_config_t configuration structure.
  */
void HAL_SPI_GetConfig(const hal_spi_handle_t *hspi, hal_spi_config_t *p_config)
{
  ASSERT_DBG_PARAM(hspi != NULL);
  ASSERT_DBG_PARAM(p_config != NULL);

  ASSERT_DBG_STATE(hspi->global_state, HAL_SPI_STATE_IDLE | HAL_SPI_STATE_TX_ACTIVE | HAL_SPI_STATE_RX_ACTIVE
                   | HAL_SPI_STATE_TX_RX_ACTIVE | HAL_SPI_STATE_FAULT | HAL_SPI_STATE_ABORT);

  /* Get SPI basic configuration */
  uint32_t cfg1_reg_value = LL_SPI_READ_REG(((SPI_TypeDef *)((uint32_t)hspi->instance)), CFG1);
  uint32_t cfg2_reg_value = LL_SPI_READ_REG(((SPI_TypeDef *)((uint32_t)hspi->instance)), CFG2);

  p_config->mode  = ((hal_spi_mode_t)((uint32_t)(cfg2_reg_value & SPI_CFG2_MASTER)));
  p_config->direction = hspi->direction;
  p_config->data_width = (hal_spi_data_width_t)((uint32_t)(cfg1_reg_value & SPI_CFG1_DSIZE));
  p_config->clock_polarity = (hal_spi_clock_polarity_t)((uint32_t)(cfg2_reg_value & SPI_CFG2_CPOL));
  p_config->clock_phase = (hal_spi_clock_phase_t)((uint32_t)(cfg2_reg_value & SPI_CFG2_CPHA));
  p_config->baud_rate_prescaler = (hal_spi_baud_rate_prescaler_t)
                                  ((uint32_t)(cfg1_reg_value & (SPI_CFG1_MBR | SPI_CFG1_BPASS)));
  p_config->first_bit = (hal_spi_first_bit_t)((uint32_t)(cfg2_reg_value & SPI_CFG2_LSBFRST));
  p_config->nss_pin_management = (hal_spi_nss_pin_management_t)
                                 ((uint32_t)(cfg2_reg_value & (SPI_CFG2_SSM | SPI_CFG2_SSOE)));
}

/**
  * @}
  */

/** @addtogroup SPI_Exported_Functions_Group3 Features functions
  * @{
  This subsection provides a set of functions allowing to configure some additional
  features for the selected SPIx peripheral.

  There are two types of features, features with configuration parameters and features without
  configuration parameters.

  For each feature that has a configuration structure,
  there are those dedicated APIs:
    - HAL_SPI_SetConfigCRC() : Configure the CRC feature.
    - HAL_SPI_GetConfigCRC() : Retrieve the current CRC feature configuration.
    - HAL_SPI_EnableCRC() : Enable the CRC feature with user defined configuration.
    - HAL_SPI_DisableCRC() : Disable the CRC feature for the dedicated SPIx instance.
    - HAL_SPI_IsEnabledCRC() : Retrieve CRC feature status for the dedicated SPIx instance.

  There is a specific case for always-on features which cannot be disabled (NSS and Underrun detection),
  there are those dedicated APIs:
    - HAL_SPI_SetConfigNSS() : Configure the NSS feature.
    - HAL_SPI_GetConfigNSS() : Retrieve the current NSS feature configuration.
    - HAL_SPI_SLAVE_SetConfigUnderrun() : Configure the Underrun detection feature.
    - HAL_SPI_SLAVE_GetConfigUnderrun() : Retrieve the current underrun detection feature configuration.

  For each feature without parameters (TI Mode, Master Receiver Auto Suspend, Master Keep IO State, IO Swap,
  Delay Read Data Sampling and Ready Pin management), there are those dedicated APIs:
    - HAL_SPI_EnableTIMode()    : Enable the TI Mode feature for the dedicated SPIx instance.
    - HAL_SPI_DisableTIMode()   : Disable the TI Mode feature for the dedicated SPIx instance.
    - HAL_SPI_IsEnabledTIMode() : Retrieve the TI Mode feature status for the dedicated SPIx instance.
    - HAL_SPI_MASTER_EnableReceiverAutoSuspend()    : Enable the Master Receiver Automatic Suspension feature
                                                  for the dedicated SPIx instance.
    - HAL_SPI_MASTER_DisableReceiverAutoSuspend()   : Disable the Master Receiver Automatic Suspension feature
                                                  for the dedicated SPIx instance.
    - HAL_SPI_MASTER_IsEnabledReceiverAutoSuspend() : Retrieve the Master Receiver Automatic Suspension feature
                                                  status for the dedicated SPIx instance.
    - HAL_SPI_MASTER_EnableKeepIOState()    : Enable the Master Keep IO State feature for the dedicated SPIx instance.
    - HAL_SPI_MASTER_DisableKeepIOState()   : Disable the Master Keep IO State feature for the dedicated SPIx instance.
    - HAL_SPI_MASTER_IsEnabledKeepIOState() : Retrieve the Master Keep IO State feature status for the dedicated
                                             SPIx instance.
    - HAL_SPI_EnableMosiMisoSwap()    : Enable the IO Swap feature for the dedicated SPIx instance.
    - HAL_SPI_DisableMosiMisoSwap()   : Disable the IO Swap feature for the dedicated SPIx instance.
    - HAL_SPI_IsEnabledMosiMisoSwap() : Retrieve the IO Swap feature status for the dedicated SPIx instance.
    - HAL_SPI_EnableDelayReadDataSampling()    : Enable the Delay Read Data Sampling feature for the dedicated
                                                 SPIx instance.
    - HAL_SPI_DisableDelayReadDataSampling()   : Disable the Delay Read Data Sampling feature for the dedicated
                                                 SPIx instance.
    - HAL_SPI_IsEnabledDelayReadDataSampling() : Retrieve the Delay Read Data Sampling feature status for the
                                                 dedicated SPIx instance.
    - HAL_SPI_EnableReadyPin()    : Enable the Ready Pin management feature for the dedicated SPIx instance.
    - HAL_SPI_DisableReadyPin()   : Disable the Ready Pin management feature for the dedicated SPIx instance.
    - HAL_SPI_IsEnabledReadyPin() : Retrieve the Ready Pin management feature status for the dedicated SPIx instance.
  There are two other specific functions for the IO config feature which are:
    - HAL_SPI_LockIOConfig() : Lock the IO configuration for the dedicated SPIx instance.
    - HAL_SPI_IsLockedIOConfig() : Retrieve the IO configuration status for the dedicated SPIx instance.
    When this bit is set, the configuration register linked to IO configuration (SPI_CFG2) cannot be modified.
    This lock can be enabled only when SPI is disabled, otherwise it is write protected.
    It is cleared and cannot be set when a Mode Fault is detected (SPI_SR/MODF bit is set).

  */

#if defined(USE_HAL_SPI_CRC) && (USE_HAL_SPI_CRC == 1)

/**
  * @brief Configure the CRC feature.
  * @param hspi Pointer to a \ref hal_spi_handle_t structure which contains
  *             the SPI instance.
  * @param p_config Pointer to hal_spi_crc_config_t configuration structure.
  * @retval HAL_INVALID_PARAM in case of invalid parameter allocation such as a null config pointer.
  * @retval HAL_OK in case of valid configuration.
  */
hal_status_t HAL_SPI_SetConfigCRC(hal_spi_handle_t *hspi, const hal_spi_crc_config_t *p_config)
{
  /* Local variables*/
  uint32_t length_crc;
  uint32_t crc_poly_msb_mask;
  uint32_t crc_polynomial;
  uint32_t data_width;

  ASSERT_DBG_PARAM(hspi != NULL);
  ASSERT_DBG_PARAM(p_config != NULL);

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if (p_config == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  ASSERT_DBG_PARAM(IS_SPI_CRC_POLYNOMIAL(p_config->crc_polynomial));
  ASSERT_DBG_PARAM(IS_SPI_CRC_POLYNOMIAL_SIZE(p_config->crc_polynomial, p_config->crc_length));
  ASSERT_DBG_PARAM(IS_SPI_CRC_LENGTH(p_config->crc_length));
  ASSERT_DBG_PARAM(IS_SPI_CRC_TX_INIT_PATTERN(p_config->crc_tx_init_pattern));
  ASSERT_DBG_PARAM(IS_SPI_CRC_RX_INIT_PATTERN(p_config->crc_rx_init_pattern));

  ASSERT_DBG_STATE(hspi->global_state, HAL_SPI_STATE_IDLE);

  /* Local variables*/
  length_crc = (uint32_t)p_config->crc_length;
  crc_polynomial = (uint32_t)p_config->crc_polynomial;
  data_width = LL_SPI_GetDataWidth((SPI_TypeDef *)((uint32_t)hspi->instance));

  /* Align the CRC length on the data size if HAL_SPI_CRC_LENGTH_DATASIZE */
  if (length_crc == ((uint32_t)HAL_SPI_CRC_LENGTH_DATASIZE))
  {
    length_crc = (((data_width) >> SPI_CFG1_DSIZE_Pos) << SPI_CFG1_CRCSIZE_Pos);
  }

  /* Enable 33/17 bits CRC computation in case maximum CRC size is used.
   * Maximum CRC size depends on SPIx capabilities (refer into the reference
   * manual on CRC computation feature)
   */
  if (length_crc == ((uint32_t)HAL_SPI_CRC_LENGTH_32_BIT))
  {
    LL_SPI_EnableFullSizeCRC((SPI_TypeDef *)((uint32_t)hspi->instance));
  }
  else
  {
    LL_SPI_DisableFullSizeCRC((SPI_TypeDef *)((uint32_t)hspi->instance));

    /* Set MSB of CRC polynomial at 1 in SPI Register      */
    /* Set MSB is mandatory for a correct CRC computation  */
    crc_poly_msb_mask = (0x1UL << ((length_crc >> SPI_CFG1_CRCSIZE_Pos) + 0x1U));
    crc_polynomial |= crc_poly_msb_mask;
  }

  LL_SPI_SetCRCPolynomial((SPI_TypeDef *)((uint32_t)hspi->instance), crc_polynomial);

