MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_spi.c
  LL_SPI_SetCRCWidth((SPI_TypeDef *)((uint32_t)hspi->instance), length_crc);

  LL_SPI_SetCRCInitPattern((SPI_TypeDef *)((uint32_t)hspi->instance), (uint32_t)p_config->crc_tx_init_pattern,
                           (uint32_t)p_config->crc_rx_init_pattern);
  return HAL_OK;
}

/**
  * @brief Retrieve the current CRC configuration.
  * @param hspi Pointer to a \ref hal_spi_handle_t structure which contains
  *             the SPI instance.
  * @param p_config Pointer to the hal_spi_crc_config_t configuration structure.
  */
void HAL_SPI_GetConfigCRC(const hal_spi_handle_t *hspi, hal_spi_crc_config_t *p_config)
{
  ASSERT_DBG_PARAM(hspi != NULL);
  ASSERT_DBG_PARAM(p_config != NULL);

  ASSERT_DBG_STATE(hspi->global_state, HAL_SPI_STATE_IDLE | HAL_SPI_STATE_TX_ACTIVE | HAL_SPI_STATE_RX_ACTIVE
                   | HAL_SPI_STATE_TX_RX_ACTIVE | HAL_SPI_STATE_FAULT | HAL_SPI_STATE_ABORT);

  uint32_t init_pattern = LL_SPI_GetCRCInitPattern((SPI_TypeDef *)((uint32_t)hspi->instance));

  /* Get SPI CRC configuration */
  p_config->crc_polynomial       = LL_SPI_GetCRCPolynomial((SPI_TypeDef *)((uint32_t)hspi->instance));
  p_config->crc_length           = (hal_spi_crc_length_t)
                                   ((uint32_t)LL_SPI_GetCRCWidth((SPI_TypeDef *)((uint32_t)hspi->instance)));
  p_config->crc_tx_init_pattern  = (hal_spi_crc_tx_init_pattern_t)((uint32_t)(init_pattern & SPI_CR1_TCRCINI));
  p_config->crc_rx_init_pattern  = (hal_spi_crc_rx_init_pattern_t)((uint32_t)(init_pattern & SPI_CR1_RCRCINI));
}

/**
  * @brief Enable the CRC feature for the dedicated SPIx.
  * @param hspi Pointer to a \ref hal_spi_handle_t structure which contains
  *             the SPI instance.
  * @retval HAL_OK CRC feature enabled successfully.
  */
hal_status_t HAL_SPI_EnableCRC(const hal_spi_handle_t *hspi)
{
  ASSERT_DBG_PARAM(hspi != NULL);

  ASSERT_DBG_STATE(hspi->global_state, (uint32_t)HAL_SPI_STATE_IDLE);

  LL_SPI_EnableCRC((SPI_TypeDef *)((uint32_t)hspi->instance));

  return HAL_OK;
}

/**
  * @brief Disable the CRC feature for the dedicated SPIx.
  * @param hspi Pointer to a \ref hal_spi_handle_t structure which contains
  *             the SPI instance.
  * @retval HAL_OK CRC feature disabled successfully.
  */
hal_status_t HAL_SPI_DisableCRC(const hal_spi_handle_t *hspi)
{
  ASSERT_DBG_PARAM(hspi != NULL);

  ASSERT_DBG_STATE(hspi->global_state, HAL_SPI_STATE_IDLE);

  LL_SPI_DisableCRC((SPI_TypeDef *)((uint32_t)hspi->instance));

  return HAL_OK;
}

/**
  * @brief Retrieve CRC status for the dedicated SPIx.
  * @param hspi Pointer to a \ref hal_spi_handle_t structure which contains
  *             the SPI instance.
  * @retval hal_spi_crc_status_t SPI CRC feature status.
  */
hal_spi_crc_status_t HAL_SPI_IsEnabledCRC(const hal_spi_handle_t *hspi)
{
  ASSERT_DBG_PARAM(hspi != NULL);

  ASSERT_DBG_STATE(hspi->global_state, HAL_SPI_STATE_IDLE | HAL_SPI_STATE_TX_ACTIVE | HAL_SPI_STATE_RX_ACTIVE
                   | HAL_SPI_STATE_TX_RX_ACTIVE | HAL_SPI_STATE_FAULT | HAL_SPI_STATE_ABORT);

  return (hal_spi_crc_status_t) LL_SPI_IsEnabledCRC((SPI_TypeDef *)((uint32_t)hspi->instance));
}
#endif /* USE_HAL_SPI_CRC */

/**
  * @brief Configure the NSS feature.
  * @param hspi Pointer to a \ref hal_spi_handle_t structure which contains
  *             the SPI instance.
  * @param p_config Pointer to hal_spi_nss_config_t configuration structure.
  * @retval HAL_INVALID_PARAM in case of invalid parameter allocation.
  * @retval HAL_ERROR when the IO configuration register (SPI_CFG2) is locked.
  * @retval HAL_OK in case of valid configuration.
  */
hal_status_t HAL_SPI_SetConfigNSS(hal_spi_handle_t *hspi, const hal_spi_nss_config_t *p_config)
{
  ASSERT_DBG_PARAM(hspi != NULL);
  ASSERT_DBG_PARAM(p_config != NULL);

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if (p_config == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  ASSERT_DBG_PARAM(IS_SPI_NSS_PULSE(p_config->nss_pulse));
  ASSERT_DBG_PARAM(IS_SPI_NSS_POLARITY(p_config->nss_polarity));
  ASSERT_DBG_PARAM(IS_SPI_NSS_MSSI_DELAY(p_config->nss_mssi_delay));

  ASSERT_DBG_STATE(hspi->global_state, HAL_SPI_STATE_IDLE);

  /* Check for IOLock */
  if (LL_SPI_IsEnabledIOLock((SPI_TypeDef *)((uint32_t)hspi->instance)) != 0UL)
  {
    return HAL_ERROR;
  }

  LL_SPI_SetNSSConfig(((SPI_TypeDef *)((uint32_t)hspi->instance)),
                      ((uint32_t)p_config->nss_pulse) | ((uint32_t)p_config->nss_polarity) |
                      ((uint32_t)p_config->nss_mssi_delay));

  return HAL_OK;
}

/**
  * @brief Retrieve the current NSS configuration.
  * @param hspi Pointer to a \ref hal_spi_handle_t structure which contains
  *             the SPI instance.
  * @param p_config Pointer to the hal_spi_nss_config_t configuration structure.
  */
void HAL_SPI_GetConfigNSS(const hal_spi_handle_t *hspi, hal_spi_nss_config_t *p_config)
{
  ASSERT_DBG_PARAM(hspi != NULL);
  ASSERT_DBG_PARAM(p_config != NULL);

  ASSERT_DBG_STATE(hspi->global_state, HAL_SPI_STATE_IDLE | HAL_SPI_STATE_TX_ACTIVE | HAL_SPI_STATE_RX_ACTIVE
                   | HAL_SPI_STATE_TX_RX_ACTIVE | HAL_SPI_STATE_FAULT | HAL_SPI_STATE_ABORT);

  uint32_t cfg2_reg_value = LL_SPI_READ_REG(((SPI_TypeDef *)((uint32_t)hspi->instance)), CFG2);

  /* Get SPI NSS configuration */
  p_config->nss_pulse       = (hal_spi_nss_pulse_t)((uint32_t)(cfg2_reg_value & SPI_CFG2_SSOM));
  p_config->nss_polarity    = (hal_spi_nss_polarity_t)((uint32_t)(cfg2_reg_value & SPI_CFG2_SSIOP));
  p_config->nss_mssi_delay  = (hal_spi_nss_master_slave_signal_idleness_delay_t)
                              ((uint32_t)(cfg2_reg_value & SPI_CFG2_MSSI));
}

/**
  * @brief Configure the Underrun detection mode feature.
  * @param hspi Pointer to a \ref hal_spi_handle_t structure which contains
  *             the SPI instance.
  * @param p_config Pointer to the hal_spi_underrun_config_t data structure.
  * @retval HAL_INVALID_PARAM in case of invalid parameter allocation.
  * @retval HAL_OK in case of valid configuration.
  */
hal_status_t HAL_SPI_SLAVE_SetConfigUnderrun(const hal_spi_handle_t *hspi, const hal_spi_underrun_config_t *p_config)
{
  ASSERT_DBG_PARAM(hspi != NULL);
  ASSERT_DBG_PARAM(p_config != NULL);

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if (p_config == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  ASSERT_DBG_PARAM(IS_SPI_UNDERRUN_BEHAV(p_config->underrun_behavior));
  /* Ensure that Underrun configuration is managed only by Slave */
  ASSERT_DBG_PARAM(LL_SPI_GetMode((SPI_TypeDef *)((uint32_t)hspi->instance)) == HAL_SPI_MODE_SLAVE);

  ASSERT_DBG_STATE(hspi->global_state, HAL_SPI_STATE_IDLE);

  /* Configure Underrun fields */
  LL_SPI_SetUDRConfiguration((SPI_TypeDef *)((uint32_t)hspi->instance), (uint32_t)p_config->underrun_behavior);

  return HAL_OK;
}

/**
  * @brief Retrieve the current underrun detection configuration.
  * @param hspi Pointer to a \ref hal_spi_handle_t structure which contains
  *             the SPI instance.
  * @param p_config Pointer to the hal_spi_underrun_config_t data structure.
  */
void HAL_SPI_SLAVE_GetConfigUnderrun(const hal_spi_handle_t *hspi, hal_spi_underrun_config_t *p_config)
{
  ASSERT_DBG_PARAM(hspi != NULL);
  ASSERT_DBG_PARAM(p_config != NULL);

