MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_spi.c
  ASSERT_DBG_STATE(hspi->global_state, HAL_SPI_STATE_IDLE | HAL_SPI_STATE_TX_ACTIVE | HAL_SPI_STATE_RX_ACTIVE
                   | HAL_SPI_STATE_TX_RX_ACTIVE | HAL_SPI_STATE_FAULT | HAL_SPI_STATE_ABORT);

  /* Retrieve the current Autonomous mode configuration */
  uint32_t cfg1_reg_value = LL_SPI_READ_REG(((SPI_TypeDef *)((uint32_t)hspi->instance)), CFG1);
  uint32_t underrun_behavior = cfg1_reg_value & SPI_CFG1_UDRCFG;
  p_config->underrun_behavior  = (hal_spi_underrun_behavior_t)underrun_behavior;
}

/**
  * @brief Enable the TI mode feature for the dedicated SPIx.
  * @param hspi Pointer to a \ref hal_spi_handle_t structure which contains
  *             the SPI instance.
  * @retval HAL_ERROR when the IO configuration register (SPI_CFG2) is locked.
  * @retval HAL_OK TI mode feature enabled successfully.
  */
hal_status_t HAL_SPI_EnableTIMode(hal_spi_handle_t *hspi)
{
  ASSERT_DBG_PARAM(hspi != NULL);

  ASSERT_DBG_STATE(hspi->global_state, (uint32_t)HAL_SPI_STATE_IDLE);

  /* Check for IOLock */
  if (LL_SPI_IsEnabledIOLock((SPI_TypeDef *)((uint32_t)hspi->instance)) != 0UL)
  {
    return HAL_ERROR;
  }

  /* Enable the TI mode */
  LL_SPI_SetStandard((SPI_TypeDef *)((uint32_t)hspi->instance), LL_SPI_PROTOCOL_TI);

  return HAL_OK;
}

/**
  * @brief Disable the TI mode feature for the dedicated SPIx.
  * @param hspi Pointer to a \ref hal_spi_handle_t structure which contains
  *             the SPI instance.
  * @retval HAL_ERROR when the IO configuration register (SPI_CFG2) is locked.
  * @retval HAL_OK TI mode feature disabled successfully.
  */
hal_status_t HAL_SPI_DisableTIMode(hal_spi_handle_t *hspi)
{
  ASSERT_DBG_PARAM(hspi != NULL);

  ASSERT_DBG_STATE(hspi->global_state, (uint32_t)HAL_SPI_STATE_IDLE);

  /* Check for IOLock */
  if (LL_SPI_IsEnabledIOLock((SPI_TypeDef *)((uint32_t)hspi->instance)) != 0UL)
  {
    return HAL_ERROR;
  }

  /* Disable the TI mode */
  LL_SPI_SetStandard((SPI_TypeDef *)((uint32_t)hspi->instance), LL_SPI_PROTOCOL_MOTOROLA);

  return HAL_OK;
}

/**
  * @brief Retrieve the TI mode status for the dedicated SPI.
  * @param hspi Pointer to a \ref hal_spi_handle_t structure which contains
  *             the SPI instance.
  * @retval hal_spi_ti_mode_status_t SPI TI mode feature status.
  */
hal_spi_ti_mode_status_t HAL_SPI_IsEnabledTIMode(const hal_spi_handle_t *hspi)
{
  ASSERT_DBG_PARAM(hspi != NULL);

  ASSERT_DBG_STATE(hspi->global_state, HAL_SPI_STATE_IDLE | HAL_SPI_STATE_TX_ACTIVE | HAL_SPI_STATE_RX_ACTIVE
                   | HAL_SPI_STATE_TX_RX_ACTIVE | HAL_SPI_STATE_FAULT | HAL_SPI_STATE_ABORT);

  return ((LL_SPI_GetStandard((SPI_TypeDef *)((uint32_t)hspi->instance)) == LL_SPI_PROTOCOL_TI)
          ? HAL_SPI_TI_MODE_ENABLED : HAL_SPI_TI_MODE_DISABLED);
}

/**
  * @brief Enable the master automatic suspension in Receive mode feature for the dedicated SPIx.
  * The automatic suspension is not quite reliable when size of data drops below 8
  * bits. In this case, a safe suspension can be achieved by combination with delay inserted
  * between data frames applied when MIDI parameter keeps a non zero value; sum of data size
  * and the interleaved SPI cycles must always produce interval at length of 8 SPI clock
  * periods at minimum.
  * @param hspi Pointer to a \ref hal_spi_handle_t structure which contains
  *             the SPI instance.
  * @retval HAL_OK Master Receiver Automatic Suspension feature enabled successfully.
  */
hal_status_t HAL_SPI_MASTER_EnableReceiverAutoSuspend(const hal_spi_handle_t *hspi)
{
  ASSERT_DBG_PARAM(hspi != NULL);

  ASSERT_DBG_PARAM(LL_SPI_GetMode((SPI_TypeDef *)((uint32_t)hspi->instance)) == HAL_SPI_MODE_MASTER);

  ASSERT_DBG_STATE(hspi->global_state, HAL_SPI_STATE_IDLE);

  /* Enable MasterRxAutoSuspend */
  LL_SPI_EnableMasterRxAutoSuspend((SPI_TypeDef *)((uint32_t)hspi->instance));
  return HAL_OK;
}

/**
  * @brief Disable the master automatic suspension in Receive mode feature for the dedicated SPIx.
  * @param hspi Pointer to a \ref hal_spi_handle_t structure which contains
  *             the SPI instance.
  * @retval HAL_OK Master Receiver Automatic Suspension feature disabled successfully.
  */
hal_status_t HAL_SPI_MASTER_DisableReceiverAutoSuspend(const hal_spi_handle_t *hspi)
{
  ASSERT_DBG_PARAM(hspi != NULL);

  ASSERT_DBG_STATE(hspi->global_state, (uint32_t)HAL_SPI_STATE_IDLE);

  LL_SPI_DisableMasterRxAutoSuspend((SPI_TypeDef *)((uint32_t)hspi->instance));

  return HAL_OK;
}

/**
  * @brief Retrieve the master automatic suspension in Receive mode feature status for the dedicated SPIx.
  * @param hspi Pointer to a \ref hal_spi_handle_t structure which contains
  *             the SPI instance.
  * @retval hal_spi_master_rx_auto_suspend_status_t SPI master receiver automatic suspension feature status.
  */
hal_spi_master_rx_auto_suspend_status_t HAL_SPI_MASTER_IsEnabledReceiverAutoSuspend(const hal_spi_handle_t *hspi)
{
  ASSERT_DBG_PARAM(hspi != NULL);

  ASSERT_DBG_STATE(hspi->global_state, HAL_SPI_STATE_IDLE | HAL_SPI_STATE_TX_ACTIVE | HAL_SPI_STATE_RX_ACTIVE
                   | HAL_SPI_STATE_TX_RX_ACTIVE | HAL_SPI_STATE_FAULT | HAL_SPI_STATE_ABORT);

  return (hal_spi_master_rx_auto_suspend_status_t)
         LL_SPI_IsEnabledMasterRxAutoSuspend((SPI_TypeDef *)((uint32_t)hspi->instance));
}

/**
  * @brief Enable the alternate function GPIOs control feature for the dedicated SPIx.
  * @param hspi Pointer to a \ref hal_spi_handle_t structure which contains
  *             the SPI instance.
  * @note Enabling the "Master Keep IO State" prevents any glitches on the associated outputs configured at
  *       alternate function mode by keeping them forced at state corresponding the current SPI configuration.
  * @retval HAL_ERROR when the IO configuration register (SPI_CFG2) is locked.
  * @retval HAL_OK Master Keep IO State feature enabled successfully.
  */
hal_status_t HAL_SPI_MASTER_EnableKeepIOState(hal_spi_handle_t *hspi)
{
  ASSERT_DBG_PARAM(hspi != NULL);

  ASSERT_DBG_STATE(hspi->global_state, (uint32_t)HAL_SPI_STATE_IDLE);

  /* Check for IOLock */
  if (LL_SPI_IsEnabledIOLock((SPI_TypeDef *)((uint32_t)hspi->instance)) != 0UL)
  {
    return HAL_ERROR;
  }

