MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_spi.c
  LL_SPI_EnableGPIOControl((SPI_TypeDef *)((uint32_t)hspi->instance));

  return HAL_OK;
}

/**
  * @brief Disable the alternate function GPIOs control feature for the dedicated SPIx.
  * @param hspi Pointer to a \ref hal_spi_handle_t structure which contains
  *             the SPI instance.
  * @retval HAL_ERROR when the IO configuration register (SPI_CFG2) is locked.
  * @retval HAL_OK Master Keep IO State feature disabled successfully.
  */
hal_status_t HAL_SPI_MASTER_DisableKeepIOState(hal_spi_handle_t *hspi)
{
  ASSERT_DBG_PARAM(hspi != NULL);

  ASSERT_DBG_STATE(hspi->global_state, (uint32_t)HAL_SPI_STATE_IDLE);

  /* Check for IOLock */
  if (LL_SPI_IsEnabledIOLock((SPI_TypeDef *)((uint32_t)hspi->instance)) != 0UL)
  {
    return HAL_ERROR;
  }

  LL_SPI_DisableGPIOControl((SPI_TypeDef *)((uint32_t)hspi->instance));

  return HAL_OK;
}

/**
  * @brief Retrieve the alternate function GPIOs control feature status for the dedicated SPIx.
  * @param hspi Pointer to a \ref hal_spi_handle_t structure which contains
  *             the SPI instance.
  * @retval hal_spi_master_keep_io_state_status_t SPI master keep IO state feature status.
  */
hal_spi_master_keep_io_state_status_t HAL_SPI_MASTER_IsEnabledKeepIOState(const hal_spi_handle_t *hspi)
{
  ASSERT_DBG_PARAM(hspi != NULL);

  ASSERT_DBG_STATE(hspi->global_state, HAL_SPI_STATE_IDLE | HAL_SPI_STATE_TX_ACTIVE | HAL_SPI_STATE_RX_ACTIVE
                   | HAL_SPI_STATE_TX_RX_ACTIVE | HAL_SPI_STATE_FAULT | HAL_SPI_STATE_ABORT);

  return (hal_spi_master_keep_io_state_status_t)LL_SPI_IsEnabledGPIOControl((SPI_TypeDef *)((uint32_t)hspi->instance));
}


/**
  * @brief Enable the MISO/MOSI alternate functions inversion feature for the dedicated SPIx.
  * @param hspi Pointer to a \ref hal_spi_handle_t structure which contains
  *             the SPI instance.
  * @retval HAL_ERROR when the IO configuration register (SPI_CFG2) is locked.
  * @retval HAL_OK IO Swap feature enabled successfully.
  */
hal_status_t HAL_SPI_EnableMosiMisoSwap(hal_spi_handle_t *hspi)
{
  ASSERT_DBG_PARAM(hspi != NULL);

  ASSERT_DBG_STATE(hspi->global_state, (uint32_t)HAL_SPI_STATE_IDLE);

  /* Check for IOLock */
  if (LL_SPI_IsEnabledIOLock((SPI_TypeDef *)((uint32_t)hspi->instance)) != 0UL)
  {
    return HAL_ERROR;
  }

  LL_SPI_EnableMosiMisoSwap((SPI_TypeDef *)((uint32_t)hspi->instance));

  return HAL_OK;
}

/**
  * @brief Disable the MISO/MOSI alternate functions inversion feature for the dedicated SPIx.
  * @param hspi Pointer to a \ref hal_spi_handle_t structure which contains
  *             the SPI instance.
  * @retval HAL_ERROR when the IO configuration register (SPI_CFG2) is locked.
  * @retval HAL_OK IO Swap feature disabled successfully.
  */
hal_status_t HAL_SPI_DisableMosiMisoSwap(hal_spi_handle_t *hspi)
{
  ASSERT_DBG_PARAM(hspi != NULL);

  ASSERT_DBG_STATE(hspi->global_state, (uint32_t)HAL_SPI_STATE_IDLE);

  /* Check for IOLock */
  if (LL_SPI_IsEnabledIOLock((SPI_TypeDef *)((uint32_t)hspi->instance)) != 0UL)
  {
    return HAL_ERROR;
  }

  LL_SPI_DisableMosiMisoSwap((SPI_TypeDef *)((uint32_t)hspi->instance));

  return HAL_OK;
}

/**
  * @brief Retrieve the MISO/MOSI alternate functions inversion feature status for the dedicated SPIx.
  * @param hspi Pointer to a \ref hal_spi_handle_t structure which contains
  *             the SPI instance.
  * @retval hal_spi_mosi_miso_swap_status_t SPI IO swap feature status.
   */
hal_spi_mosi_miso_swap_status_t HAL_SPI_IsEnabledMosiMisoSwap(const hal_spi_handle_t *hspi)
{
  ASSERT_DBG_PARAM(hspi != NULL);

  ASSERT_DBG_STATE(hspi->global_state, HAL_SPI_STATE_IDLE | HAL_SPI_STATE_TX_ACTIVE | HAL_SPI_STATE_RX_ACTIVE
                   | HAL_SPI_STATE_TX_RX_ACTIVE | HAL_SPI_STATE_FAULT | HAL_SPI_STATE_ABORT);

  return (hal_spi_mosi_miso_swap_status_t)LL_SPI_IsEnabledMosiMisoSwap((SPI_TypeDef *)((uint32_t)hspi->instance));
}

/**
  * @brief Enable the ready pin feature for the dedicated SPIx.
  * @param hspi Pointer to a \ref hal_spi_handle_t structure which contains
  *             the SPI instance.
  * @retval HAL_ERROR when the IO configuration register (SPI_CFG2) is locked.
  * @retval HAL_OK Ready Pin feature enabled successfully.
  */
hal_status_t HAL_SPI_EnableReadyPin(hal_spi_handle_t *hspi)
{
  ASSERT_DBG_PARAM(hspi != NULL);

  ASSERT_DBG_STATE(hspi->global_state, (uint32_t)HAL_SPI_STATE_IDLE);

  /* Check for IOLock */
  if (LL_SPI_IsEnabledIOLock((SPI_TypeDef *)((uint32_t)hspi->instance)) != 0UL)
  {
    return HAL_ERROR;
  }

  LL_SPI_EnableReadyPin((SPI_TypeDef *)((uint32_t)hspi->instance));

  return HAL_OK;
}

/**
  * @brief Disable the ready pin feature for the dedicated SPIx.
  * @param hspi Pointer to a \ref hal_spi_handle_t structure which contains
  *             the SPI instance.
  * @retval HAL_ERROR when the IO configuration register (SPI_CFG2) is locked.
  * @retval HAL_OK Ready Pin feature disabled successfully.
  */
hal_status_t HAL_SPI_DisableReadyPin(hal_spi_handle_t *hspi)
{
  ASSERT_DBG_PARAM(hspi != NULL);

  ASSERT_DBG_STATE(hspi->global_state, (uint32_t)HAL_SPI_STATE_IDLE);

  /* Check for IOLock */
  if (LL_SPI_IsEnabledIOLock((SPI_TypeDef *)((uint32_t)hspi->instance)) != 0UL)
  {
    return HAL_ERROR;
  }

  LL_SPI_DisableReadyPin((SPI_TypeDef *)((uint32_t)hspi->instance));

  return HAL_OK;
}

/**
  * @brief Retrieve the ready pin feature status for the dedicated SPIx.
  * @param hspi Pointer to a \ref hal_spi_handle_t structure which contains
  *             the SPI instance.
  * @retval hal_spi_ready_pin_status_t SPI ready pin management feature status.
   */
hal_spi_ready_pin_status_t HAL_SPI_IsEnabledReadyPin(const hal_spi_handle_t *hspi)
{
  ASSERT_DBG_PARAM(hspi != NULL);

  ASSERT_DBG_STATE(hspi->global_state, HAL_SPI_STATE_IDLE | HAL_SPI_STATE_TX_ACTIVE | HAL_SPI_STATE_RX_ACTIVE
                   | HAL_SPI_STATE_TX_RX_ACTIVE | HAL_SPI_STATE_FAULT | HAL_SPI_STATE_ABORT);

  return (hal_spi_ready_pin_status_t)LL_SPI_IsEnabledReadyPin((SPI_TypeDef *)((uint32_t)hspi->instance));
}

/**
  * @brief Set the ready pin polarity for the dedicated SPIx.
  * @param hspi Pointer to a \ref hal_spi_handle_t structure which contains
  *             the SPI instance.
  * @param polarity This parameter must be a value of hal_spi_ready_pin_polarity_t.
  * @retval HAL_ERROR when the IO configuration register (SPI_CFG2) is locked.
  * @retval HAL_OK Ready Pin polarity set successfully.
  */
hal_status_t HAL_SPI_SetReadyPinPolarity(hal_spi_handle_t *hspi, hal_spi_ready_pin_polarity_t polarity)
{
  ASSERT_DBG_PARAM(hspi != NULL);
  ASSERT_DBG_PARAM(IS_SPI_RDY_PIN_POLARITY(polarity));

  ASSERT_DBG_STATE(hspi->global_state, (uint32_t)HAL_SPI_STATE_IDLE);

  /* Check for IOLock */
  if (LL_SPI_IsEnabledIOLock((SPI_TypeDef *)((uint32_t)hspi->instance)) != 0UL)
  {
    return HAL_ERROR;
  }

  LL_SPI_SetReadyPinPolarity((SPI_TypeDef *)((uint32_t)hspi->instance), (uint32_t) polarity);

  return HAL_OK;
}

/**
  * @brief Retrieve the ready pin polarity of the SPI peripheral.
  * @param hspi Pointer to a \ref hal_spi_handle_t structure which contains
  *             the SPI instance.
  * @retval hal_spi_ready_pin_polarity_t Current ready pin polarity.
  */
hal_spi_ready_pin_polarity_t HAL_SPI_GetReadyPinPolarity(const hal_spi_handle_t *hspi)
{
  ASSERT_DBG_PARAM(hspi != NULL);

