MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_spi.c
  ASSERT_DBG_STATE(hspi->global_state, HAL_SPI_STATE_IDLE | HAL_SPI_STATE_TX_ACTIVE | HAL_SPI_STATE_RX_ACTIVE
                   | HAL_SPI_STATE_TX_RX_ACTIVE | HAL_SPI_STATE_FAULT | HAL_SPI_STATE_ABORT);

  return (hal_spi_ready_pin_polarity_t)LL_SPI_GetReadyPinPolarity((SPI_TypeDef *)((uint32_t)hspi->instance));
}

/**
  * @brief Enable the Delay Read Data Sampling on Master Input IO.
  *        DRDS setting has no impact on the other SCK management.
  *        When CRC is enabled, CRC computation and evaluation is delayed too.
  * @param hspi Pointer to a \ref hal_spi_handle_t structure which contains
  *             the SPI instance.
  * @retval HAL_ERROR when the IO configuration register (SPI_CFG2) is locked.
  * @retval HAL_OK Delay Read Data Sampling enabled successfully.
  */
hal_status_t HAL_SPI_EnableDelayReadDataSampling(hal_spi_handle_t *hspi)
{
  ASSERT_DBG_PARAM(hspi != NULL);

  ASSERT_DBG_STATE(hspi->global_state, (uint32_t)HAL_SPI_STATE_IDLE);

  /* Check for IOLock */
  if (LL_SPI_IsEnabledIOLock((SPI_TypeDef *)((uint32_t)hspi->instance)) != 0UL)
  {
    return HAL_ERROR;
  }

  /* Enable Delay Read Data Sampling feature */
  LL_SPI_EnableDelayReadDataSampling((SPI_TypeDef *)((uint32_t)hspi->instance));

  return HAL_OK;
}

/**
  * @brief Disable the Delay Read Data Sampling on Master Input IO.
  *        DRDS setting has no impact on the other SCK management.
  *        When CRC is enabled, CRC computation and evaluation is delayed too.
  * @param hspi Pointer to a \ref hal_spi_handle_t structure which contains
  *             the SPI instance.
  * @retval HAL_ERROR when the IO configuration register (SPI_CFG2) is locked.
  * @retval HAL_OK Delay Read Data Sampling enabled successfully.
  */
hal_status_t HAL_SPI_DisableDelayReadDataSampling(hal_spi_handle_t *hspi)
{
  ASSERT_DBG_PARAM(hspi != NULL);

  ASSERT_DBG_STATE(hspi->global_state, (uint32_t)HAL_SPI_STATE_IDLE);

  /* Check for IOLock */
  if (LL_SPI_IsEnabledIOLock((SPI_TypeDef *)((uint32_t)hspi->instance)) != 0UL)
  {
    return HAL_ERROR;
  }

  LL_SPI_DisableDelayReadDataSampling((SPI_TypeDef *)((uint32_t)hspi->instance));

  return HAL_OK;
}

/**
  * @brief Retrieve the Delay Read Data Sampling feature status for the dedicated SPIx.
  * @param hspi Pointer to a \ref hal_spi_handle_t structure which contains
  *             the SPI instance.
  * @retval hal_spi_drds_status_t Delay Read Data Sampling feature status.
   */
hal_spi_drds_status_t HAL_SPI_IsEnabledDelayReadDataSampling(const hal_spi_handle_t *hspi)
{
  ASSERT_DBG_PARAM(hspi != NULL);

  ASSERT_DBG_STATE(hspi->global_state, HAL_SPI_STATE_IDLE | HAL_SPI_STATE_TX_ACTIVE | HAL_SPI_STATE_RX_ACTIVE
                   | HAL_SPI_STATE_TX_RX_ACTIVE | HAL_SPI_STATE_FAULT | HAL_SPI_STATE_ABORT);

  return (hal_spi_drds_status_t)LL_SPI_IsEnabledDelayReadDataSampling((SPI_TypeDef *)((uint32_t)hspi->instance));
}

/**
  * @brief Lock the IO configuration for the dedicated SPI.
  * @param hspi Pointer to a \ref hal_spi_handle_t structure which contains
  *             the SPI instance.
  * @note The reset of the IOLock bit is done by hardware.
  * @retval HAL_OK Operation completed successfully.
  */
hal_status_t HAL_SPI_LockIOConfig(const hal_spi_handle_t *hspi)
{
  ASSERT_DBG_PARAM(hspi != NULL);

  ASSERT_DBG_STATE(hspi->global_state, HAL_SPI_STATE_IDLE);

  LL_SPI_EnableIOLock((SPI_TypeDef *)((uint32_t)hspi->instance));

  return HAL_OK;
}

/**
  * @brief Retrieve the IO configuration lock status for the dedicated SPI.
  * @param hspi Pointer to a \ref hal_spi_handle_t structure which contains
  *             the SPI instance.
  * @retval hal_spi_io_cfg_status_t.
  */
hal_spi_io_cfg_status_t HAL_SPI_IsLockedIOConfig(const hal_spi_handle_t *hspi)
{
  ASSERT_DBG_PARAM(hspi != NULL);

  ASSERT_DBG_STATE(hspi->global_state, HAL_SPI_STATE_IDLE | HAL_SPI_STATE_TX_ACTIVE | HAL_SPI_STATE_RX_ACTIVE
                   | HAL_SPI_STATE_TX_RX_ACTIVE | HAL_SPI_STATE_FAULT | HAL_SPI_STATE_ABORT);

  return (hal_spi_io_cfg_status_t)LL_SPI_IsEnabledIOLock((SPI_TypeDef *)((uint32_t)hspi->instance));
}

/**
  * @}
  */


/** @addtogroup SPI_Exported_Functions_Group5 Items functions
  * @{
  This subsection provides a set of functions allowing to change and retrieve a single configuration item
  in the IDLE state.
    - HAL_SPI_SetMode() : Set the mode of the SPI peripheral.
    - HAL_SPI_GetMode() : Retrieve the mode of the SPI peripheral.
    - HAL_SPI_SetDirection() : Set the direction of the SPI peripheral.
    - HAL_SPI_GetDirection() : Retrieve the direction of the SPI peripheral.
    - HAL_SPI_SetDataWidth() : Set the data width for the SPI peripheral.
    - HAL_SPI_GetDataWidth() : Retrieve the data width of the SPI peripheral.
    - HAL_SPI_SetClockPolarity() : Set the clock polarity of the SPI peripheral.
    - HAL_SPI_GetClockPolarity() : Retrieve the clock polarity of the SPI peripheral.
    - HAL_SPI_SetClockPhase() : Set the active clock edge for the bit capture of the SPI peripheral.
    - HAL_SPI_GetClockPhase() : Retrieve the active clock edge for the bit capture of the SPI peripheral.
    - HAL_SPI_SetBaudRatePrescaler() : Set the Baud Rate prescaler value which is used to configure the transmit
                                       and receive SCK clock of the SPI peripheral.
    - HAL_SPI_GetBaudRatePrescaler() : Retrieve the baud rate prescaler of the SPI peripheral.
    - HAL_SPI_SetFirstBit() : Set whether data transfers start from MSB or LSB bit.
    - HAL_SPI_GetFirstBit() : Retrieve the first bit (MSB or LSB bit) of the SPI peripheral.
    - HAL_SPI_SetNSSPinManagement() : Set the NSS pin management mode of the SPI peripheral.
    - HAL_SPI_GetNSSPinManagement() : Retrieve the NSS pin management mode of the SPI peripheral.
    - HAL_SPI_SetFifoThreshold() : Set the FIFO threshold level of the SPI peripheral.
    - HAL_SPI_GetFifoThreshold() : Retrieve the FIFO threshold level of the SPI peripheral.
    - HAL_SPI_MASTER_SetInterDataIdlenessDelay() : Set an extra delay, expressed in number of SPI clock cycle periods,
                                                   inserted additionally between active edge of Slave Select signal
                                                   and first data transaction start in master mode.
    - HAL_SPI_MASTER_GetInterDataIdlenessDelay() : Retrieve the extra delay, expressed in number of SPI clock cycle
                                                   periods, inserted additionally between active edge of Slave
                                                   Select signal and first data transaction start in master mode.
  */

/**
  * @brief Set the mode of the SPI peripheral.
  * @param hspi Pointer to a \ref hal_spi_handle_t structure which contains
  *             the SPI instance.
  * @param mode This parameter must be a value of hal_spi_mode_t.
  * @retval HAL_ERROR when the IO configuration register (SPI_CFG2) is locked.
  * @retval HAL_OK Operation completed successfully.
  */
hal_status_t HAL_SPI_SetMode(hal_spi_handle_t *hspi, const hal_spi_mode_t mode)
{
  ASSERT_DBG_PARAM(hspi != NULL);
  ASSERT_DBG_PARAM(IS_SPI_MODE(mode));

  ASSERT_DBG_STATE(hspi->global_state, HAL_SPI_STATE_IDLE);

  /* Check for IOLock */
  if (LL_SPI_IsEnabledIOLock((SPI_TypeDef *)((uint32_t)hspi->instance)) != 0UL)
  {
    return HAL_ERROR;
  }

  /* Get SPI basic configuration */
  uint32_t cfg2_reg_value = LL_SPI_READ_REG(((SPI_TypeDef *)((uint32_t)hspi->instance)), CFG2);

  /* SPIx NSS Internal Management Configuration */
  if ((STM32_IS_BIT_SET(cfg2_reg_value, SPI_CFG2_SSM))
      && (((mode == HAL_SPI_MODE_MASTER) && (STM32_IS_BIT_CLR(cfg2_reg_value, SPI_CFG2_SSIOP)))
          || ((mode == HAL_SPI_MODE_SLAVE)  && (STM32_IS_BIT_SET(cfg2_reg_value, SPI_CFG2_SSIOP)))))
  {
    LL_SPI_SetInternalSSLevel((SPI_TypeDef *)((uint32_t)hspi->instance), LL_SPI_SS_LEVEL_HIGH);
  }
  else
  {
    LL_SPI_SetInternalSSLevel((SPI_TypeDef *)((uint32_t)hspi->instance), LL_SPI_SS_LEVEL_LOW);
  }

  LL_SPI_SetMode((SPI_TypeDef *)((uint32_t)hspi->instance), (uint32_t)mode);

  return HAL_OK;
}

/**
  * @brief Retrieve the mode of the SPI peripheral.
  * @param hspi Pointer to a \ref hal_spi_handle_t structure which contains
  *             the SPI instance.
  * @retval hal_spi_mode_t Current SPI mode configuration.
  */
hal_spi_mode_t HAL_SPI_GetMode(const hal_spi_handle_t *hspi)
{
  ASSERT_DBG_PARAM(hspi != NULL);

