MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_spi.c
  ASSERT_DBG_STATE(hspi->global_state, HAL_SPI_STATE_IDLE | HAL_SPI_STATE_TX_ACTIVE | HAL_SPI_STATE_RX_ACTIVE
                   | HAL_SPI_STATE_TX_RX_ACTIVE | HAL_SPI_STATE_FAULT | HAL_SPI_STATE_ABORT);

  return (hal_spi_mode_t)LL_SPI_GetMode((SPI_TypeDef *)((uint32_t)hspi->instance));
}

/**
  * @brief Set the direction of the SPI peripheral.
  * @param hspi Pointer to a \ref hal_spi_handle_t structure which contains
  *             the SPI instance.
  * @param direction This parameter must be a value of hal_spi_direction_t.
  * @retval HAL_ERROR when the IO configuration register (SPI_CFG2) is locked.
  * @retval HAL_OK Operation completed successfully.
  */
hal_status_t HAL_SPI_SetDirection(hal_spi_handle_t *hspi, const hal_spi_direction_t direction)
{
  ASSERT_DBG_PARAM(hspi != NULL);
  ASSERT_DBG_PARAM(IS_SPI_DIRECTION(direction));

  ASSERT_DBG_STATE(hspi->global_state, HAL_SPI_STATE_IDLE);

  /* Check for IOLock */
  if (LL_SPI_IsEnabledIOLock((SPI_TypeDef *)((uint32_t)hspi->instance)) != 0UL)
  {
    return HAL_ERROR;
  }

  /* Store the transfer direction in the handle, to check it later in operational functions */
  hspi->direction = direction;
  LL_SPI_SetTransferDirection((SPI_TypeDef *)((uint32_t)hspi->instance), (uint32_t)direction);

  return HAL_OK;
}

/**
  * @brief Retrieve the direction of the SPI peripheral.
  * @param hspi Pointer to a \ref hal_spi_handle_t structure which contains
  *             the SPI instance.
  * @retval hal_spi_direction_t Current SPI direction configuration.
  */
hal_spi_direction_t HAL_SPI_GetDirection(const hal_spi_handle_t *hspi)
{
  ASSERT_DBG_PARAM(hspi != NULL);

  ASSERT_DBG_STATE(hspi->global_state, HAL_SPI_STATE_IDLE | HAL_SPI_STATE_TX_ACTIVE | HAL_SPI_STATE_RX_ACTIVE
                   | HAL_SPI_STATE_TX_RX_ACTIVE | HAL_SPI_STATE_FAULT | HAL_SPI_STATE_ABORT);

  return (hal_spi_direction_t)LL_SPI_GetTransferDirection((SPI_TypeDef *)((uint32_t)hspi->instance));
}

/**
  * @brief Set the data width for the SPI peripheral.
  * @param hspi Pointer to a \ref hal_spi_handle_t structure which contains
  *             the SPI instance.
  * @param data_width This parameter must be a value of hal_spi_data_width_t.
  * @retval HAL_OK Operation completed successfully.
  */
hal_status_t HAL_SPI_SetDataWidth(const hal_spi_handle_t *hspi, const hal_spi_data_width_t data_width)
{
  ASSERT_DBG_PARAM(hspi != NULL);

  ASSERT_DBG_PARAM(IS_SPI_DATA_WIDTH(data_width));
#if defined(USE_ASSERT_DBG_PARAM)
  /* Get PacketSize */
  uint32_t packet_length = GET_PACKET_SIZE(data_width,
                                           LL_SPI_GetFIFOThreshold((SPI_TypeDef *)((uint32_t)hspi->instance)));
  ASSERT_DBG_PARAM(IS_SPI_PACKET_SIZE(packet_length));
#endif /* USE_ASSERT_DBG_PARAM */

  ASSERT_DBG_STATE(hspi->global_state, HAL_SPI_STATE_IDLE);

  LL_SPI_SetDataWidth((SPI_TypeDef *)((uint32_t)hspi->instance), (uint32_t)data_width);

  return HAL_OK;
}

/**
  * @brief Retrieve the data width of the SPI peripheral.
  * @param hspi Pointer to a \ref hal_spi_handle_t structure which contains
  *             the SPI instance.
  * @retval hal_spi_data_width_t Current SPI data width configuration.
  */
hal_spi_data_width_t HAL_SPI_GetDataWidth(const hal_spi_handle_t *hspi)
{
  ASSERT_DBG_PARAM(hspi != NULL);

  ASSERT_DBG_STATE(hspi->global_state, HAL_SPI_STATE_IDLE | HAL_SPI_STATE_TX_ACTIVE | HAL_SPI_STATE_RX_ACTIVE
                   | HAL_SPI_STATE_TX_RX_ACTIVE | HAL_SPI_STATE_FAULT | HAL_SPI_STATE_ABORT);

  return (hal_spi_data_width_t)LL_SPI_GetDataWidth((SPI_TypeDef *)((uint32_t)hspi->instance));
}

/**
  * @brief Set the clock polarity of the SPI peripheral.
  * @param hspi Pointer to a \ref hal_spi_handle_t structure which contains
  *             the SPI instance.
  * @param clock_polarity This parameter must be a value of hal_spi_clock_polarity_t.
  * @retval HAL_ERROR when the IO configuration register (SPI_CFG2) is locked.
  * @retval HAL_OK Operation completed successfully.
  */
hal_status_t HAL_SPI_SetClockPolarity(hal_spi_handle_t *hspi, const hal_spi_clock_polarity_t clock_polarity)
{
  ASSERT_DBG_PARAM(hspi != NULL);
  ASSERT_DBG_PARAM(IS_SPI_POLARITY(clock_polarity));

  ASSERT_DBG_STATE(hspi->global_state, HAL_SPI_STATE_IDLE);

  /* Check for IOLock */
  if (LL_SPI_IsEnabledIOLock((SPI_TypeDef *)((uint32_t)hspi->instance)) != 0UL)
  {
    return HAL_ERROR;
  }

  LL_SPI_SetClockPolarity((SPI_TypeDef *)((uint32_t)hspi->instance), (uint32_t)clock_polarity);

  return HAL_OK;
}

/**
  * @brief Retrieve the clock polarity of the SPI peripheral.
  * @param hspi Pointer to a \ref hal_spi_handle_t structure which contains
  *             the SPI instance.
  * @retval hal_spi_clock_polarity_t Current SPI clock polarity configuration.
  */
hal_spi_clock_polarity_t HAL_SPI_GetClockPolarity(const hal_spi_handle_t *hspi)
{
  ASSERT_DBG_PARAM(hspi != NULL);

  ASSERT_DBG_STATE(hspi->global_state, HAL_SPI_STATE_IDLE | HAL_SPI_STATE_TX_ACTIVE | HAL_SPI_STATE_RX_ACTIVE
                   | HAL_SPI_STATE_TX_RX_ACTIVE | HAL_SPI_STATE_FAULT | HAL_SPI_STATE_ABORT);

  return (hal_spi_clock_polarity_t)LL_SPI_GetClockPolarity((SPI_TypeDef *)((uint32_t)hspi->instance));
}

/**
  * @brief Set the active clock edge for the bit capture.
  * @param hspi Pointer to a \ref hal_spi_handle_t structure which contains
  *             the SPI instance.
  * @param clock_phase This parameter must be a value of hal_spi_clock_phase_t.
  * @retval HAL_ERROR when the IO configuration register (SPI_CFG2) is locked.
  * @retval HAL_OK Operation completed successfully.
  */
hal_status_t HAL_SPI_SetClockPhase(hal_spi_handle_t *hspi, const hal_spi_clock_phase_t clock_phase)
{
  ASSERT_DBG_PARAM(hspi != NULL);
  ASSERT_DBG_PARAM(IS_SPI_PHASE(clock_phase));

  ASSERT_DBG_STATE(hspi->global_state, HAL_SPI_STATE_IDLE);

  /* Check for IOLock */
  if (LL_SPI_IsEnabledIOLock((SPI_TypeDef *)((uint32_t)hspi->instance)) != 0UL)
  {
    return HAL_ERROR;
  }

  LL_SPI_SetClockPhase((SPI_TypeDef *)((uint32_t)hspi->instance), (uint32_t)clock_phase);

  return HAL_OK;
}

/**
  * @brief Retrieve the active clock edge for the bit capture of the SPI peripheral.
  * @param hspi Pointer to a \ref hal_spi_handle_t structure which contains
  *             the SPI instance.
  * @retval hal_spi_clock_phase_t Current SPI clock phase configuration.
  */
hal_spi_clock_phase_t HAL_SPI_GetClockPhase(const hal_spi_handle_t *hspi)
{
  ASSERT_DBG_PARAM(hspi != NULL);

