MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_spi.c
  ASSERT_DBG_STATE(hspi->global_state, HAL_SPI_STATE_IDLE | HAL_SPI_STATE_TX_ACTIVE | HAL_SPI_STATE_RX_ACTIVE
                   | HAL_SPI_STATE_TX_RX_ACTIVE | HAL_SPI_STATE_FAULT | HAL_SPI_STATE_ABORT);

  return (hal_spi_clock_phase_t)LL_SPI_GetClockPhase((SPI_TypeDef *)((uint32_t)hspi->instance));
}

/**
  * @brief Set the Baud Rate prescaler value which is used to configure the transmit and receive SCK clock.
  * @param hspi Pointer to a \ref hal_spi_handle_t structure which contains
  *             the SPI instance.
  * @param baud_rate_prescaler This parameter must be a value of hal_spi_baud_rate_prescaler_t.
  * @retval HAL_OK Operation completed successfully.
  */
hal_status_t HAL_SPI_SetBaudRatePrescaler(const hal_spi_handle_t *hspi,
                                          const hal_spi_baud_rate_prescaler_t baud_rate_prescaler)
{
  ASSERT_DBG_PARAM(hspi != NULL);
  ASSERT_DBG_PARAM(IS_SPI_PRESCALER(baud_rate_prescaler));

  ASSERT_DBG_STATE(hspi->global_state, HAL_SPI_STATE_IDLE);

  LL_SPI_SetBaudRatePrescaler((SPI_TypeDef *)((uint32_t)hspi->instance), (uint32_t)baud_rate_prescaler);

  return HAL_OK;
}

/**
  * @brief Retrieve the baud rate prescaler of the SPI peripheral.
  * @param hspi Pointer to a \ref hal_spi_handle_t structure which contains
  *             the SPI instance.
  * @retval hal_spi_baud_rate_prescaler_t Current SPI clock baud rate prescaler configuration.
  */
hal_spi_baud_rate_prescaler_t HAL_SPI_GetBaudRatePrescaler(const hal_spi_handle_t *hspi)
{
  ASSERT_DBG_PARAM(hspi != NULL);

  ASSERT_DBG_STATE(hspi->global_state, HAL_SPI_STATE_IDLE | HAL_SPI_STATE_TX_ACTIVE | HAL_SPI_STATE_RX_ACTIVE
                   | HAL_SPI_STATE_TX_RX_ACTIVE | HAL_SPI_STATE_FAULT | HAL_SPI_STATE_ABORT);

  return (hal_spi_baud_rate_prescaler_t)LL_SPI_GetBaudRatePrescaler((SPI_TypeDef *)((uint32_t)hspi->instance));
}

/**
  * @brief Set whether data transfers start from MSB or LSB bit.
  * @param hspi Pointer to a \ref hal_spi_handle_t structure which contains
  *             the SPI instance.
  * @param first_bit This parameter must be a value of hal_spi_first_bit_t.
  * @retval HAL_ERROR when the IO configuration register (SPI_CFG2) is locked.
  * @retval HAL_OK Operation completed successfully.
  */
hal_status_t HAL_SPI_SetFirstBit(hal_spi_handle_t *hspi, const hal_spi_first_bit_t first_bit)
{
  ASSERT_DBG_PARAM(hspi != NULL);
  ASSERT_DBG_PARAM(IS_SPI_FIRST_BIT(first_bit));

  ASSERT_DBG_STATE(hspi->global_state, HAL_SPI_STATE_IDLE);

  /* Check for IOLock */
  if (LL_SPI_IsEnabledIOLock((SPI_TypeDef *)((uint32_t)hspi->instance)) != 0UL)
  {
    return HAL_ERROR;
  }

  LL_SPI_SetTransferBitOrder((SPI_TypeDef *)((uint32_t)hspi->instance), (uint32_t)first_bit);

  return HAL_OK;
}

/**
  * @brief Retrieve the first bit (MSB or LSB bit) of the SPI peripheral.
  * @param hspi Pointer to a \ref hal_spi_handle_t structure which contains
  *             the SPI instance.
  * @retval hal_spi_first_bit_t Current SPI first bit configuration.
  */
hal_spi_first_bit_t HAL_SPI_GetFirstBit(const hal_spi_handle_t *hspi)
{
  ASSERT_DBG_PARAM(hspi != NULL);

  ASSERT_DBG_STATE(hspi->global_state, HAL_SPI_STATE_IDLE | HAL_SPI_STATE_TX_ACTIVE | HAL_SPI_STATE_RX_ACTIVE
                   | HAL_SPI_STATE_TX_RX_ACTIVE | HAL_SPI_STATE_FAULT | HAL_SPI_STATE_ABORT);

  return (hal_spi_first_bit_t)LL_SPI_GetTransferBitOrder((SPI_TypeDef *)((uint32_t)hspi->instance));
}
/**
  * @brief Set the management configuration of the NSS Pin.
  * @param hspi Pointer to a \ref hal_spi_handle_t structure which contains
  *             the SPI instance.
  * @param nss_pin_management This parameter must be a value of hal_spi_nss_pin_management_t.
  * @retval HAL_ERROR when the IO configuration register (SPI_CFG2) is locked.
  * @retval HAL_OK Operation completed successfully.
  */
hal_status_t HAL_SPI_SetNSSPinManagement(hal_spi_handle_t *hspi, hal_spi_nss_pin_management_t nss_pin_management)
{
  ASSERT_DBG_PARAM(hspi != NULL);
  ASSERT_DBG_PARAM(IS_SPI_NSS_PIN_MANAGEMENT(nss_pin_management));

  ASSERT_DBG_STATE(hspi->global_state, HAL_SPI_STATE_IDLE);

  /* Check for IOLock */
  if (LL_SPI_IsEnabledIOLock((SPI_TypeDef *)((uint32_t)hspi->instance)) != 0UL)
  {
    return HAL_ERROR;
  }

  LL_SPI_SetNSSMode((SPI_TypeDef *)((uint32_t)hspi->instance), (uint32_t)nss_pin_management);

  return HAL_OK;
}

/**
  * @brief Retrieve the NSS Pin management of the SPI peripheral.
  * @param hspi Pointer to a \ref hal_spi_handle_t structure which contains
  *             the SPI instance.
  * @retval hal_spi_nss_pin_management_t Current SPI NSS Pin management configuration.
  */
hal_spi_nss_pin_management_t HAL_SPI_GetNSSPinManagement(const hal_spi_handle_t *hspi)
{
  ASSERT_DBG_PARAM(hspi != NULL);

  ASSERT_DBG_STATE(hspi->global_state, HAL_SPI_STATE_IDLE | HAL_SPI_STATE_TX_ACTIVE | HAL_SPI_STATE_RX_ACTIVE
                   | HAL_SPI_STATE_TX_RX_ACTIVE | HAL_SPI_STATE_FAULT | HAL_SPI_STATE_ABORT);

  return (hal_spi_nss_pin_management_t)LL_SPI_GetNSSMode((SPI_TypeDef *)((uint32_t)hspi->instance));
}

/**
  * @brief Set the FIFO threshold level.
  * @param hspi Pointer to a \ref hal_spi_handle_t structure which contains
  *             the SPI instance.
  * @param fifo_threshold This parameter can be a value of hal_spi_fifo_threshold_t.
  * @retval HAL_OK Operation completed successfully.
  */
hal_status_t HAL_SPI_SetFifoThreshold(const hal_spi_handle_t *hspi, const hal_spi_fifo_threshold_t fifo_threshold)
{
  ASSERT_DBG_PARAM(hspi != NULL);

  ASSERT_DBG_PARAM(IS_SPI_FIFO_THRESHOLD(fifo_threshold));
#if defined(USE_ASSERT_DBG_PARAM)
  /* Get PacketSize */
  uint32_t packet_length = GET_PACKET_SIZE(LL_SPI_GetDataWidth((SPI_TypeDef *)((uint32_t)hspi->instance)),
                                           (uint32_t)fifo_threshold);
  ASSERT_DBG_PARAM(IS_SPI_PACKET_SIZE(packet_length));
#endif /* USE_ASSERT_DBG_PARAM */

  ASSERT_DBG_STATE(hspi->global_state, HAL_SPI_STATE_IDLE);

  LL_SPI_SetFIFOThreshold((SPI_TypeDef *)((uint32_t)hspi->instance), (uint32_t)fifo_threshold);

  return HAL_OK;
}

/**
  * @brief Retrieve the FIFO threshold level of the SPI peripheral.
  * @param hspi Pointer to a \ref hal_spi_handle_t structure which contains
  *             the SPI instance.
  * @retval hal_spi_fifo_threshold_t Current FIFO threshold configuration.
  */
hal_spi_fifo_threshold_t HAL_SPI_GetFifoThreshold(const hal_spi_handle_t *hspi)
{
  ASSERT_DBG_PARAM(hspi != NULL);

