MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_spi.c
  ASSERT_DBG_STATE(hspi->global_state, HAL_SPI_STATE_IDLE | HAL_SPI_STATE_TX_ACTIVE | HAL_SPI_STATE_RX_ACTIVE
                   | HAL_SPI_STATE_TX_RX_ACTIVE | HAL_SPI_STATE_FAULT | HAL_SPI_STATE_ABORT);

  return (hal_spi_fifo_threshold_t)LL_SPI_GetFIFOThreshold((SPI_TypeDef *)((uint32_t)hspi->instance));
}

/**
  * @brief Set an extra delay, expressed in number of SPI clock cycle periods, inserted additionally.
  *        between active edge of SS and first data transaction start in master mode.
  * @param hspi Pointer to a \ref hal_spi_handle_t structure which contains
  *             the SPI instance.
  * @param nb_cycles This parameter can be a value of hal_spi_master_inter_data_idleness_delay_t.
  * @retval HAL_ERROR when the IO configuration register (SPI_CFG2) is locked.
  * @retval HAL_OK Operation completed successfully.
  */
hal_status_t HAL_SPI_MASTER_SetInterDataIdlenessDelay(hal_spi_handle_t *hspi,
                                                      const hal_spi_master_inter_data_idleness_delay_t nb_cycles)
{
  ASSERT_DBG_PARAM(hspi != NULL);
  ASSERT_DBG_PARAM(IS_SPI_MIDI_DELAY(nb_cycles));

  ASSERT_DBG_STATE(hspi->global_state, HAL_SPI_STATE_IDLE);

  /* Check for IOLock */
  if (LL_SPI_IsEnabledIOLock((SPI_TypeDef *)((uint32_t)hspi->instance)) != 0UL)
  {
    return HAL_ERROR;
  }

  LL_SPI_SetInterDataIdleness((SPI_TypeDef *)((uint32_t)hspi->instance), (uint32_t)nb_cycles);

  return HAL_OK;
}

/**
  * @brief Retrieve the extra delay, expressed in number of SPI clock cycle periods, inserted additionally between.
  *        active edge of SS and first data transaction start in master mode.
  * @param hspi Pointer to a \ref hal_spi_handle_t structure which contains
  *             the SPI instance.
  * @retval hal_spi_master_inter_data_idleness_delay_t Current inter data idleness delay.
  */
hal_spi_master_inter_data_idleness_delay_t HAL_SPI_MASTER_GetInterDataIdlenessDelay(const hal_spi_handle_t *hspi)
{
  ASSERT_DBG_PARAM(hspi != NULL);

  ASSERT_DBG_STATE(hspi->global_state, HAL_SPI_STATE_IDLE | HAL_SPI_STATE_TX_ACTIVE | HAL_SPI_STATE_RX_ACTIVE
                   | HAL_SPI_STATE_TX_RX_ACTIVE | HAL_SPI_STATE_FAULT | HAL_SPI_STATE_ABORT);

  return (hal_spi_master_inter_data_idleness_delay_t)LL_SPI_GetInterDataIdleness((SPI_TypeDef *)((
      uint32_t)hspi->instance));
}

#if defined(USE_HAL_SPI_USER_DATA) && (USE_HAL_SPI_USER_DATA == 1)

/**
  * @brief Store User Data pointer into the handle.
  * @param hspi Pointer to a \ref hal_spi_handle_t structure which contains
  *             the SPI instance.
  * @param p_user_data Pointer to the user data.
  */
void HAL_SPI_SetUserData(hal_spi_handle_t *hspi, const void *p_user_data)
{
  ASSERT_DBG_PARAM(hspi != NULL);

  hspi->p_user_data = p_user_data;
}

/**
  * @brief Retrieve User Data pointer from the handle.
  * @param hspi Pointer to a \ref hal_spi_handle_t structure which contains
  *             the SPI instance.
  * @retval Pointer to the user data.
  */
const void *HAL_SPI_GetUserData(const hal_spi_handle_t *hspi)
{
  ASSERT_DBG_PARAM(hspi != NULL);

  return (hspi->p_user_data);
}

#endif /* USE_HAL_SPI_USER_DATA */

#if defined (USE_HAL_SPI_DMA) && (USE_HAL_SPI_DMA == 1)
/**
  * @brief Link the Transmit DMA handle to the SPI handle.
  * @param hspi Pointer to a \ref hal_spi_handle_t structure.
  * @param hdma Pointer to a hal_dma_handle_t structure.
  * @retval HAL_INVALID_PARAM Invalid parameter.
  */
hal_status_t HAL_SPI_SetTxDMA(hal_spi_handle_t *hspi, hal_dma_handle_t *hdma)
{
  ASSERT_DBG_PARAM((hspi != NULL));
  ASSERT_DBG_PARAM((hdma != NULL));

  ASSERT_DBG_STATE(hspi->global_state, (uint32_t)HAL_SPI_STATE_INIT | (uint32_t)HAL_SPI_STATE_IDLE);

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if (hdma == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  /* Link the DMA handle to the SPI handle */
  hspi->hdma_tx = hdma;
  hdma->p_parent = hspi;

  return HAL_OK;
}

/**
  * @brief Link the Receive DMA handle to the SPI handle.
  * @param hspi Pointer to a \ref hal_spi_handle_t structure.
  * @param hdma Pointer to a hal_dma_handle_t structure.
  * @retval HAL_INVALID_PARAM Invalid parameter.
  */
hal_status_t HAL_SPI_SetRxDMA(hal_spi_handle_t *hspi, hal_dma_handle_t *hdma)
{
  ASSERT_DBG_PARAM((hspi != NULL));
  ASSERT_DBG_PARAM((hdma != NULL));

  ASSERT_DBG_STATE(hspi->global_state, (uint32_t)HAL_SPI_STATE_INIT | (uint32_t)HAL_SPI_STATE_IDLE);

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if (hdma == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  /* Link the DMA handle to the SPI handle */
  hspi->hdma_rx = hdma;
  hdma->p_parent = hspi;

  return HAL_OK;
}
#endif /* USE_HAL_SPI_DMA  */
/**
  * @}
  */

/** @addtogroup SPI_Exported_Functions_Group6 IO operation functions
  * @{
    This subsection provides a set of functions allowing to manage the SPI
    data transfers.

  The SPI supports master and slave mode :

  - There are two modes of transfer:
    - Blocking mode: The communication is performed in polling mode.
            The HAL status of all data processing is returned by the same function
            after finishing transfer.
    - Non-blocking mode: The communication is performed using Interrupts
            or DMA, these APIs return the HAL status.
            The end of the data processing will be indicated through the
            dedicated SPI IRQ when using Interrupt mode or the DMA IRQ when
            using DMA mode.
            The HAL_SPI_TxCpltCallback(), HAL_SPI_RxCpltCallback() and HAL_SPI_TxRxCpltCallback() user callbacks
      will be executed respectively at the end of the Transmit or Receive process.
      The HAL_SPI_ErrorCallback() user callback will be executed when a communication error is detected.

  - APIs provided for these 2 transfer modes (Blocking mode or Non-blocking mode using either Interrupt or DMA)
     exist for simplex, half-duplex and full-duplex modes.
  */

/**
  * @brief Transmit an amount of data in blocking mode.
  * @param hspi Pointer to a \ref hal_spi_handle_t structure which contains
  *             the SPI instance.
  * @param p_data Pointer to data buffer.
  * @param count_packet Amount of data to be sent.
  * @param timeout_ms Timeout duration.
  * @retval HAL_OK Operation completed successfully.
  * @retval HAL_BUSY Concurrent process ongoing.
  * @retval HAL_ERROR Operation completed with error.
  * @retval HAL_TIMEOUT Operation exceeds user timeout.
  */
hal_status_t HAL_SPI_Transmit(hal_spi_handle_t *hspi, const void *p_data, uint32_t count_packet, uint32_t timeout_ms)
{
  uint32_t tickstart;
  uint32_t mode;
  uint32_t fifo_threshold;
  uint32_t data_width;
  hal_status_t status;

  ASSERT_DBG_PARAM(hspi != NULL);
  ASSERT_DBG_PARAM(p_data != NULL);
#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if ((p_data == NULL) || (count_packet == 0U))
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */
  ASSERT_DBG_PARAM(IS_SPI_TRANSFER_SIZE(count_packet));
  ASSERT_DBG_PARAM(IS_SPI_DIRECTION_TX_AVAILABLE(hspi->direction));

  ASSERT_DBG_STATE(hspi->global_state, HAL_SPI_STATE_IDLE);

