MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_spi.c
  /* Critical section */
  HAL_CHECK_UPDATE_STATE(hspi, global_state, HAL_SPI_STATE_IDLE, HAL_SPI_STATE_TX_ACTIVE);

  mode           = LL_SPI_GetMode((SPI_TypeDef *)((uint32_t)hspi->instance));
  fifo_threshold = LL_SPI_GetFIFOThreshold((SPI_TypeDef *)((uint32_t)hspi->instance));
  data_width     = LL_SPI_GetDataWidth((SPI_TypeDef *)((uint32_t)hspi->instance));

  tickstart = HAL_GetTick();

  /* Set the transaction information */
  hspi->p_tx_buff         = (const uint8_t *)p_data;
  hspi->tx_xfer_size      = (uint16_t)count_packet;
  hspi->tx_xfer_count     = (uint16_t)count_packet;
#if defined(USE_HAL_SPI_GET_LAST_ERRORS) && (USE_HAL_SPI_GET_LAST_ERRORS == 1)
  hspi->last_error_codes  = HAL_SPI_ERROR_NONE;
#endif /* USE_HAL_SPI_GET_LAST_ERRORS */

  /* Init field not used in handle to zero */
  hspi->p_rx_buff         = NULL;
  hspi->rx_xfer_size      = (uint16_t)0UL;
  hspi->rx_xfer_count     = (uint16_t)0UL;
  hspi->p_tx_isr          = NULL;
  hspi->p_rx_isr          = NULL;

  /* Configure communication direction : 1Line */
  if (LL_SPI_IsHalfDuplexDirection((SPI_TypeDef *)((uint32_t)hspi->instance)) != 0UL)
  {
    LL_SPI_SetHalfDuplexDirection((SPI_TypeDef *)((uint32_t)hspi->instance), LL_SPI_HALF_DUPLEX_TX);
  }
  else
  {
    LL_SPI_SetTransferDirection((SPI_TypeDef *)((uint32_t)hspi->instance), LL_SPI_SIMPLEX_TX);
  }

  /* Set the number of data at current transfer */
  LL_SPI_SetTransferSize((SPI_TypeDef *)((uint32_t)hspi->instance), count_packet);

  LL_SPI_Enable((SPI_TypeDef *)((uint32_t)hspi->instance));

  if (mode == LL_SPI_MODE_MASTER)
  {
    LL_SPI_StartMasterTransfer((SPI_TypeDef *)((uint32_t)hspi->instance));
  }

  /* Transmit data in 32 Bit mode */
  if (data_width > LL_SPI_DATA_WIDTH_16_BIT)
  {
    /* Transmit data in 32 Bit mode */
    while (hspi->tx_xfer_count > 0UL)
    {
      /* Wait until TXP flag is set to send data */
      if (LL_SPI_IsActiveFlag_TXP((SPI_TypeDef *)((uint32_t)hspi->instance)) != 0UL)
      {
        LL_SPI_TransmitData32(((SPI_TypeDef *)((uint32_t)hspi->instance)), *((const uint32_t *)hspi->p_tx_buff));
        hspi->p_tx_buff += sizeof(uint32_t);
        hspi->tx_xfer_count--;
      }
      else
      {
        /* Timeout management */
        if ((((HAL_GetTick() - tickstart) >=  timeout_ms) && (timeout_ms != HAL_MAX_DELAY)) || (timeout_ms == 0U))
        {
          /* Call standard close procedure with error check */
          (void)SPI_CloseTransfer(hspi);
          return HAL_TIMEOUT;
        }
      }
    }
  }
  /* Transmit data in 16 Bit mode */
  else if (data_width > LL_SPI_DATA_WIDTH_8_BIT)
  {
    /* Transmit data in 16 Bit mode */
    while (hspi->tx_xfer_count > 0UL)
    {
      /* Wait until TXP flag is set to send data */
      if (LL_SPI_IsActiveFlag_TXP((SPI_TypeDef *)((uint32_t)hspi->instance)) != 0UL)
      {
        if ((hspi->tx_xfer_count > 1UL) && (fifo_threshold > LL_SPI_FIFO_THRESHOLD_1_DATA))
        {
          LL_SPI_TransmitData32(((SPI_TypeDef *)((uint32_t)hspi->instance)), *((const uint32_t *)hspi->p_tx_buff));
          hspi->p_tx_buff += sizeof(uint32_t);
          hspi->tx_xfer_count -= (uint16_t)2UL;
        }
        else
        {
          LL_SPI_TransmitData16(((SPI_TypeDef *)((uint32_t)hspi->instance)), *((const uint16_t *)hspi->p_tx_buff));
          hspi->p_tx_buff += sizeof(uint16_t);
          hspi->tx_xfer_count--;
        }
      }
      else
      {
        /* Timeout management */
        if ((((HAL_GetTick() - tickstart) >=  timeout_ms) && (timeout_ms != HAL_MAX_DELAY)) || (timeout_ms == 0U))
        {
          /* Call standard close procedure with error check */
          (void)SPI_CloseTransfer(hspi);
          return HAL_TIMEOUT;
        }
      }
    }
  }
  /* Transmit data in 8 Bit mode */
  else
  {
    while (hspi->tx_xfer_count > 0UL)
    {
      /* Wait until TXP flag is set to send data */
      if (LL_SPI_IsActiveFlag_TXP((SPI_TypeDef *)((uint32_t)hspi->instance)) != 0UL)
      {
        if ((hspi->tx_xfer_count > 3UL) && (fifo_threshold > LL_SPI_FIFO_THRESHOLD_3_DATA))
        {
          LL_SPI_TransmitData32(((SPI_TypeDef *)((uint32_t)hspi->instance)), *((const uint32_t *)hspi->p_tx_buff));
          hspi->p_tx_buff += sizeof(uint32_t);
          hspi->tx_xfer_count -= (uint16_t)4UL;
        }
        else if ((hspi->tx_xfer_count > 1UL) && (fifo_threshold > LL_SPI_FIFO_THRESHOLD_1_DATA))
        {
          LL_SPI_TransmitData16(((SPI_TypeDef *)((uint32_t)hspi->instance)), *((const uint16_t *)hspi->p_tx_buff));
          hspi->p_tx_buff += sizeof(uint16_t);
          hspi->tx_xfer_count -= (uint16_t)2UL;
        }
        else
        {
          LL_SPI_TransmitData8(((SPI_TypeDef *)((uint32_t)hspi->instance)), *hspi->p_tx_buff);
          hspi->p_tx_buff += sizeof(uint8_t);
          hspi->tx_xfer_count--;
        }
      }
      else
      {
        /* Timeout management */
        if ((((HAL_GetTick() - tickstart) >=  timeout_ms) && (timeout_ms != HAL_MAX_DELAY)) || (timeout_ms == 0U))
        {
          /* Call standard close procedure with error check */
          (void)SPI_CloseTransfer(hspi);
          return HAL_TIMEOUT;
        }
      }
    }
  }

  /* Wait End Of Transfer flag */
  if (SPI_WaitEndOfTransfer(hspi, timeout_ms, tickstart) != HAL_OK)
  {
    status = HAL_TIMEOUT;
    return status;
  }
  /* Call standard close procedure with error check */
  status = SPI_CloseTransfer(hspi);
  return status;
}

/**
  * @brief Receive an amount of data in blocking mode.
  * @param hspi Pointer to a \ref hal_spi_handle_t structure which contains
  *             the SPI instance.
  * @param p_data Pointer to data buffer.
  * @param count_packet Amount of data to be received.
  * @param timeout_ms Timeout duration in milliseconds.
  * @retval HAL_OK Operation completed successfully.
  * @retval HAL_BUSY Concurrent process ongoing.
  * @retval HAL_ERROR Operation completed with error.
  * @retval HAL_TIMEOUT Operation exceeds user timeout.
  */
hal_status_t HAL_SPI_Receive(hal_spi_handle_t *hspi, void *p_data, uint32_t count_packet, uint32_t timeout_ms)
{
  uint32_t tickstart;
  uint32_t mode;
  uint32_t data_width;
  hal_status_t status;

  ASSERT_DBG_PARAM(hspi != NULL);
  ASSERT_DBG_PARAM(p_data != NULL);
#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if ((p_data == NULL) || (count_packet == 0U))
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */
  ASSERT_DBG_PARAM(IS_SPI_TRANSFER_SIZE(count_packet));
  ASSERT_DBG_PARAM(IS_SPI_DIRECTION_RX_AVAILABLE(hspi->direction));

  ASSERT_DBG_STATE(hspi->global_state, HAL_SPI_STATE_IDLE);

