MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_spi.c
  /* Critical section */
  HAL_CHECK_UPDATE_STATE(hspi, global_state, HAL_SPI_STATE_IDLE, HAL_SPI_STATE_RX_ACTIVE);

  mode       = LL_SPI_GetMode((SPI_TypeDef *)((uint32_t)hspi->instance));
  data_width = LL_SPI_GetDataWidth((SPI_TypeDef *)((uint32_t)hspi->instance));

  tickstart = HAL_GetTick();

  /* Set the transaction information */
  hspi->p_rx_buff         = (uint8_t *)p_data;
  hspi->rx_xfer_size      = (uint16_t)count_packet;
  hspi->rx_xfer_count     = (uint16_t)count_packet;
#if defined(USE_HAL_SPI_GET_LAST_ERRORS) && (USE_HAL_SPI_GET_LAST_ERRORS == 1)
  hspi->last_error_codes  = HAL_SPI_ERROR_NONE;
#endif /* USE_HAL_SPI_GET_LAST_ERRORS */

  /* Init field not used in handle to zero */
  hspi->p_tx_buff         = NULL;
  hspi->tx_xfer_size      = (uint16_t)0UL;
  hspi->tx_xfer_count     = (uint16_t)0UL;
  hspi->p_tx_isr          = NULL;
  hspi->p_rx_isr          = NULL;

  /* Configure communication direction: 1Line */
  if (LL_SPI_IsHalfDuplexDirection((SPI_TypeDef *)((uint32_t)hspi->instance)) != 0UL)
  {
    LL_SPI_SetHalfDuplexDirection((SPI_TypeDef *)((uint32_t)hspi->instance), LL_SPI_HALF_DUPLEX_RX);
  }
  else
  {
    LL_SPI_SetTransferDirection((SPI_TypeDef *)((uint32_t)hspi->instance), LL_SPI_SIMPLEX_RX);
  }

  /* Set the number of data at current transfer */
  LL_SPI_SetTransferSize((SPI_TypeDef *)((uint32_t)hspi->instance), count_packet);

  LL_SPI_Enable((SPI_TypeDef *)((uint32_t)hspi->instance));

  if (mode == LL_SPI_MODE_MASTER)
  {
    LL_SPI_StartMasterTransfer((SPI_TypeDef *)((uint32_t)hspi->instance));
  }

  /* Receive data in 32 Bit mode */
  if (data_width > LL_SPI_DATA_WIDTH_16_BIT)
  {
    /* Transfer loop */
    while (hspi->rx_xfer_count > 0UL)
    {
      /* Check the RXWNE/EOT flag */
      if ((((SPI_TypeDef *)((uint32_t)hspi->instance))->SR & (SPI_SR_RXWNE | SPI_SR_EOT))  != 0UL)
      {
        *((uint32_t *)hspi->p_rx_buff) = LL_SPI_ReceiveData32((SPI_TypeDef *)((uint32_t)hspi->instance));
        hspi->p_rx_buff += sizeof(uint32_t);
        hspi->rx_xfer_count--;
      }
      else
      {
        /* Timeout management */
        if ((((HAL_GetTick() - tickstart) >=  timeout_ms) && (timeout_ms != HAL_MAX_DELAY)) || (timeout_ms == 0U))
        {
          /* Call standard close procedure with error check */
          (void)SPI_CloseTransfer(hspi);
          return HAL_TIMEOUT;
        }
      }
    }
  }
  /* Receive data in 16 Bit mode */
  else if (data_width > LL_SPI_DATA_WIDTH_8_BIT)
  {
    /* Transfer loop */
    while (hspi->rx_xfer_count > 0UL)
    {
      /* Check the RXP flag */
      if (LL_SPI_IsActiveFlag_RXP((SPI_TypeDef *)((uint32_t)hspi->instance)) != 0UL)
      {
        *((uint16_t *)hspi->p_rx_buff) = LL_SPI_ReceiveData16((SPI_TypeDef *)((uint32_t)hspi->instance));
        hspi->p_rx_buff += sizeof(uint16_t);
        hspi->rx_xfer_count--;
      }
      /* At the end of transfer, remove last packets from RX FIFO */
      else if ((hspi->rx_xfer_count > 0UL)
               && (LL_SPI_GetRxFIFOPackingLevel((SPI_TypeDef *)((uint32_t)hspi->instance)) != LL_SPI_RX_FIFO_0PACKET))
      {
        *((uint16_t *)hspi->p_rx_buff) = LL_SPI_ReceiveData16((SPI_TypeDef *)((uint32_t)hspi->instance));
        hspi->p_rx_buff += sizeof(uint16_t);
        hspi->rx_xfer_count--;
      }
      else
      {
        /* Timeout management */
        if ((((HAL_GetTick() - tickstart) >=  timeout_ms) && (timeout_ms != HAL_MAX_DELAY)) || (timeout_ms == 0U))
        {
          /* Call standard close procedure with error check */
          (void)SPI_CloseTransfer(hspi);
          return HAL_TIMEOUT;
        }
      }
    }
  }
  /* Receive data in 8 Bit mode */
  else
  {
    /* Transfer loop */
    while (hspi->rx_xfer_count > 0UL)
    {
      /* Check the RXP flag */
      if (LL_SPI_IsActiveFlag_RXP((SPI_TypeDef *)((uint32_t)hspi->instance)) != 0UL)
      {
        *((uint8_t *)hspi->p_rx_buff) = LL_SPI_ReceiveData8((SPI_TypeDef *)((uint32_t)hspi->instance));
        hspi->p_rx_buff += sizeof(uint8_t);
        hspi->rx_xfer_count--;
      }
      /* At the end of transfer, remove last packets from RX FIFO */
      else if ((hspi->rx_xfer_count > 0UL)
               && (LL_SPI_GetRxFIFOPackingLevel((SPI_TypeDef *)((uint32_t)hspi->instance)) != LL_SPI_RX_FIFO_0PACKET))
      {
        *((uint8_t *)hspi->p_rx_buff) = LL_SPI_ReceiveData8((SPI_TypeDef *)((uint32_t)hspi->instance));
        hspi->p_rx_buff += sizeof(uint8_t);
        hspi->rx_xfer_count--;
      }
      else
      {
        /* Timeout management */
        if ((((HAL_GetTick() - tickstart) >=  timeout_ms) && (timeout_ms != HAL_MAX_DELAY)) || (timeout_ms == 0U))
        {
          /* Call standard close procedure with error check */
          (void)SPI_CloseTransfer(hspi);
          return HAL_TIMEOUT;
        }
      }
    }
  }

#if (USE_HAL_SPI_CRC != 0UL)
  if (LL_SPI_IsEnabledCRC((SPI_TypeDef *)((uint32_t)hspi->instance)) != 0UL)
  {
    /* Wait for crc data to be received */
    if (SPI_WaitEndOfTransfer(hspi, timeout_ms, tickstart)  != HAL_OK)
    {
      status = HAL_TIMEOUT;
      return status;
    }
  }
#endif /* USE_HAL_SPI_CRC */

  /* Call standard close procedure with error check */
  status = SPI_CloseTransfer(hspi);
  return status;
}

/**
  * @brief Transmit and Receive an amount of data in blocking mode.
  * @param hspi Pointer to a \ref hal_spi_handle_t structure which contains
  *             the SPI instance.
  * @param p_tx_data Pointer to transmission data buffer.
  * @param p_rx_data Pointer to reception data buffer.
  * @param count_packet Amount of data to be exchanged in full-duplex. The process
  *                      manages the same number of data for rx and tx transfer.
  * @param timeout_ms Timeout duration.
  * @retval HAL_OK      Operation started successfully.
  * @retval HAL_BUSY    Concurrent process ongoing.
  * @retval HAL_TIMEOUT Operation exceeds user timeout.
  */
hal_status_t HAL_SPI_TransmitReceive(hal_spi_handle_t *hspi, const void *p_tx_data, void *p_rx_data,
                                     uint32_t count_packet, uint32_t timeout_ms)
{
  uint32_t tickstart;
  uint16_t initial_tx_xfer_count;
  uint16_t initial_rx_xfer_count;
  uint32_t mode;
  uint32_t data_width;
  hal_status_t status;

  ASSERT_DBG_PARAM(hspi != NULL);
  ASSERT_DBG_PARAM(p_tx_data != NULL);
  ASSERT_DBG_PARAM(p_rx_data != NULL);
#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if ((p_tx_data == NULL) || (p_rx_data == NULL) || (count_packet == 0U))
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */
  ASSERT_DBG_PARAM(IS_SPI_TRANSFER_SIZE(count_packet));

  ASSERT_DBG_PARAM(IS_SPI_DIRECTION_FULL_DUPLEX(hspi->direction));

  ASSERT_DBG_STATE(hspi->global_state, HAL_SPI_STATE_IDLE);

