MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_spi.c
  /* Critical section */
  HAL_CHECK_UPDATE_STATE(hspi, global_state, HAL_SPI_STATE_IDLE, HAL_SPI_STATE_TX_RX_ACTIVE);

  mode        = LL_SPI_GetMode((SPI_TypeDef *)((uint32_t)hspi->instance));
  data_width  = LL_SPI_GetDataWidth((SPI_TypeDef *)((uint32_t)hspi->instance));

  tickstart = HAL_GetTick();

  /* Set the transaction information */
  initial_tx_xfer_count   = (uint16_t) count_packet;
  initial_rx_xfer_count   = (uint16_t) count_packet;
  hspi->p_rx_buff         = (uint8_t *)p_rx_data;
  hspi->rx_xfer_count     = (uint16_t) count_packet;
  hspi->rx_xfer_size      = (uint16_t) count_packet;
  hspi->p_tx_buff         = (const uint8_t *)p_tx_data;
  hspi->tx_xfer_count     = (uint16_t) count_packet;
  hspi->tx_xfer_size      = (uint16_t) count_packet;
#if defined(USE_HAL_SPI_GET_LAST_ERRORS) && (USE_HAL_SPI_GET_LAST_ERRORS == 1)
  hspi->last_error_codes  = HAL_SPI_ERROR_NONE;
#endif /* USE_HAL_SPI_GET_LAST_ERRORS */

  /* Init field not used in handle to zero */
  hspi->p_rx_isr          = NULL;
  hspi->p_tx_isr          = NULL;

  LL_SPI_SetTransferDirection((SPI_TypeDef *)((uint32_t)hspi->instance), LL_SPI_FULL_DUPLEX);

  /* Set the number of data at current transfer */
  LL_SPI_SetTransferSize((SPI_TypeDef *)((uint32_t)hspi->instance), count_packet);

  LL_SPI_Enable((SPI_TypeDef *)((uint32_t)hspi->instance));

  if (mode == LL_SPI_MODE_MASTER)
  {
    LL_SPI_StartMasterTransfer((SPI_TypeDef *)((uint32_t)hspi->instance));
  }

  /* Transmit and Receive data in 32 Bit mode */
  if (data_width > LL_SPI_DATA_WIDTH_16_BIT)
  {
    while ((initial_tx_xfer_count > 0UL) || (initial_rx_xfer_count > 0UL))
    {
      /* Check TXP flag */
      if ((LL_SPI_IsActiveFlag_TXP((SPI_TypeDef *)((uint32_t)hspi->instance)) != 0UL) && (initial_tx_xfer_count > 0UL))
      {
        LL_SPI_TransmitData32(((SPI_TypeDef *)((uint32_t)hspi->instance)), *((const uint32_t *)hspi->p_tx_buff));
        hspi->p_tx_buff += sizeof(uint32_t);
        hspi->tx_xfer_count --;
        initial_tx_xfer_count = hspi->tx_xfer_count;
      }
      /* Check RXWNE/EOT flag */
      if (((((SPI_TypeDef *)((uint32_t)hspi->instance))->SR & (SPI_SR_RXWNE | SPI_SR_EOT))  != 0UL)
          && (initial_rx_xfer_count > 0UL))
      {
        *((uint32_t *)hspi->p_rx_buff) = LL_SPI_ReceiveData32((SPI_TypeDef *)((uint32_t)hspi->instance));
        hspi->p_rx_buff += sizeof(uint32_t);
        hspi->rx_xfer_count --;
        initial_rx_xfer_count = hspi->rx_xfer_count;
      }
      /* Timeout management */
      if ((((HAL_GetTick() - tickstart) >=  timeout_ms) && (timeout_ms != HAL_MAX_DELAY)) || (timeout_ms == 0U))
      {
        /* Call standard close procedure with error check */
        (void)SPI_CloseTransfer(hspi);
        return HAL_TIMEOUT;
      }
    }
  }
  /* Transmit and Receive data in 16 Bit mode */
  else if (data_width > LL_SPI_DATA_WIDTH_8_BIT)
  {
    while ((initial_tx_xfer_count > 0UL) || (initial_rx_xfer_count > 0UL))
    {
      /* Check the TXP flag */
      if ((LL_SPI_IsActiveFlag_TXP((SPI_TypeDef *)((uint32_t)hspi->instance)) != 0UL) && (initial_tx_xfer_count > 0UL))
      {
        LL_SPI_TransmitData16(((SPI_TypeDef *)((uint32_t)hspi->instance)), *((const uint16_t *)hspi->p_tx_buff));
        hspi->p_tx_buff += sizeof(uint16_t);
        hspi->tx_xfer_count--;
        initial_tx_xfer_count = hspi->tx_xfer_count;
      }

      /* Check the RXP flag */
      if ((LL_SPI_IsActiveFlag_RXP((SPI_TypeDef *)((uint32_t)hspi->instance)) != 0UL) && (initial_rx_xfer_count > 0UL))
      {
        *((uint16_t *)hspi->p_rx_buff) = LL_SPI_ReceiveData16((SPI_TypeDef *)((uint32_t)hspi->instance));
        hspi->p_rx_buff += sizeof(uint16_t);
        hspi->rx_xfer_count--;
        initial_rx_xfer_count = hspi->rx_xfer_count;
      }
      /* At the end of transfer, remove last packets from RX FIFO */
      else if ((hspi->rx_xfer_count > 0UL)
               && (LL_SPI_GetRxFIFOPackingLevel((SPI_TypeDef *)((uint32_t)hspi->instance)) != LL_SPI_RX_FIFO_0PACKET))
      {
        *((uint16_t *)hspi->p_rx_buff) = LL_SPI_ReceiveData16((SPI_TypeDef *)((uint32_t)hspi->instance));
        hspi->p_rx_buff += sizeof(uint16_t);
        hspi->rx_xfer_count--;
        initial_rx_xfer_count = hspi->rx_xfer_count;
      }
      else
      {
        /* Nothing to do */
      }

      /* Timeout management */
      if ((((HAL_GetTick() - tickstart) >=  timeout_ms) && (timeout_ms != HAL_MAX_DELAY)) || (timeout_ms == 0U))
      {
        /* Call standard close procedure with error check */
        (void)SPI_CloseTransfer(hspi);
        return HAL_TIMEOUT;
      }
    }
  }
  /* Transmit and Receive data in 8 Bit mode */
  else
  {
    while ((initial_tx_xfer_count > 0UL) || (initial_rx_xfer_count > 0UL))
    {
      /* Check the TXP flag */
      if ((LL_SPI_IsActiveFlag_TXP((SPI_TypeDef *)((uint32_t)hspi->instance)) != 0UL) && (initial_tx_xfer_count > 0UL))
      {
        LL_SPI_TransmitData8(((SPI_TypeDef *)((uint32_t)hspi->instance)), *hspi->p_tx_buff);
        hspi->p_tx_buff += sizeof(uint8_t);
        hspi->tx_xfer_count--;
        initial_tx_xfer_count = hspi->tx_xfer_count;
      }

      /* Check the RXP flag */
      if ((LL_SPI_IsActiveFlag_RXP((SPI_TypeDef *)((uint32_t)hspi->instance)) != 0UL) && (initial_rx_xfer_count > 0UL))
      {
        *((uint8_t *)hspi->p_rx_buff) = LL_SPI_ReceiveData8((SPI_TypeDef *)((uint32_t)hspi->instance));
        hspi->p_rx_buff += sizeof(uint8_t);
        hspi->rx_xfer_count--;
        initial_rx_xfer_count = hspi->rx_xfer_count;
      }
      /* At the end of transfer, remove last packets from RX FIFO */
      else if ((hspi->rx_xfer_count > 0UL)
               && (LL_SPI_GetRxFIFOPackingLevel((SPI_TypeDef *)((uint32_t)hspi->instance)) != LL_SPI_RX_FIFO_0PACKET))
      {
        *((uint8_t *)hspi->p_rx_buff) = LL_SPI_ReceiveData8((SPI_TypeDef *)((uint32_t)hspi->instance));
        hspi->p_rx_buff += sizeof(uint8_t);
        hspi->rx_xfer_count--;
        initial_rx_xfer_count = hspi->rx_xfer_count;
      }
      else
      {
        /* Nothing to do */
      }

