MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_spi.c
      /* Timeout management */
      if ((((HAL_GetTick() - tickstart) >=  timeout_ms) && (timeout_ms != HAL_MAX_DELAY)) || (timeout_ms == 0U))
      {
        /* Call standard close procedure with error check */
        (void)SPI_CloseTransfer(hspi);
        return HAL_TIMEOUT;
      }
    }
  }

  /* Wait for Tx/Rx (and CRC) data to be sent/received */
  if (SPI_WaitEndOfTransfer(hspi, timeout_ms, tickstart) != HAL_OK)
  {
    status = HAL_TIMEOUT;
    return status;
  }

  /* Call standard close procedure with error check */
  status = SPI_CloseTransfer(hspi);
  return status;
}

/**
  * @brief Transmit an amount of data in non-blocking mode with Interrupt.
  * @param hspi Pointer to a \ref hal_spi_handle_t structure which contains
  *             the SPI instance.
  * @param p_data Pointer to data buffer.
  * @param count_packet Amount of data to be sent.
  * @retval HAL_OK      Operation started successfully.
  * @retval HAL_BUSY    Concurrent process ongoing.
  */
hal_status_t HAL_SPI_Transmit_IT(hal_spi_handle_t *hspi, const void *p_data, uint32_t count_packet)
{
  hal_status_t status;
  uint32_t data_width;
  uint32_t mode;

  ASSERT_DBG_PARAM(hspi != NULL);
  ASSERT_DBG_PARAM(p_data != NULL);
#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if ((p_data == NULL) || (count_packet == 0U))
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */
  /* Check the transfer size */
  ASSERT_DBG_PARAM(IS_SPI_TRANSFER_SIZE(count_packet));

  ASSERT_DBG_PARAM(IS_SPI_DIRECTION_TX_AVAILABLE(hspi->direction));

  ASSERT_DBG_STATE(hspi->global_state, HAL_SPI_STATE_IDLE);

  /* Critical section */
  HAL_CHECK_UPDATE_STATE(hspi, global_state, HAL_SPI_STATE_IDLE, HAL_SPI_STATE_TX_ACTIVE);

  status      = HAL_OK;
  data_width  = LL_SPI_GetDataWidth((SPI_TypeDef *)((uint32_t)hspi->instance));
  mode        = LL_SPI_GetMode((SPI_TypeDef *)((uint32_t)hspi->instance));

  /* Set the transaction information */
  hspi->p_tx_buff         = (const uint8_t *)p_data;
  hspi->tx_xfer_size      = (uint16_t)count_packet;
  hspi->tx_xfer_count     = (uint16_t)count_packet;
#if defined(USE_HAL_SPI_GET_LAST_ERRORS) && (USE_HAL_SPI_GET_LAST_ERRORS == 1)
  hspi->last_error_codes  = HAL_SPI_ERROR_NONE;
#endif /* USE_HAL_SPI_GET_LAST_ERRORS */

  /* Init field not used in handle to zero */
  hspi->p_rx_buff         = NULL;
  hspi->p_rx_isr          = NULL;
  hspi->rx_xfer_size      = (uint16_t)0UL;
  hspi->rx_xfer_count     = (uint16_t)0UL;

  /* Configure communication direction : 1Line */
  if (LL_SPI_IsHalfDuplexDirection((SPI_TypeDef *)((uint32_t)hspi->instance)) != 0UL)
  {
    LL_SPI_SetHalfDuplexDirection((SPI_TypeDef *)((uint32_t)hspi->instance), LL_SPI_HALF_DUPLEX_TX);
  }
  else
  {
    LL_SPI_SetTransferDirection((SPI_TypeDef *)((uint32_t)hspi->instance), LL_SPI_SIMPLEX_TX);
  }

  /* Set the function for IT treatment */
  if (data_width > LL_SPI_DATA_WIDTH_16_BIT)
  {
    hspi->p_tx_isr = SPI_TxISR_32BIT;
  }
  else if (data_width > LL_SPI_DATA_WIDTH_8_BIT)
  {
    hspi->p_tx_isr = SPI_TxISR_16BIT;
  }
  else
  {
    hspi->p_tx_isr = SPI_TxISR_8BIT;
  }

  /* Set the number of data at current transfer */
  LL_SPI_SetTransferSize((SPI_TypeDef *)((uint32_t)hspi->instance), count_packet);

  LL_SPI_Enable((SPI_TypeDef *)((uint32_t)hspi->instance));

  /* Enable EOT, TXP, FRE, MODF and UDR interrupts */
  LL_SPI_EnableIT((SPI_TypeDef *)((uint32_t)hspi->instance),
                  LL_SPI_IT_EOT | LL_SPI_IT_TXP | LL_SPI_IT_UDR | LL_SPI_IT_TIFRE | LL_SPI_IT_MODF);

  if (mode == LL_SPI_MODE_MASTER)
  {
    LL_SPI_StartMasterTransfer((SPI_TypeDef *)((uint32_t)hspi->instance));
  }

  return status;
}

/**
  * @brief Receive an amount of data in non-blocking mode with Interrupt.
  * @param hspi Pointer to a \ref hal_spi_handle_t structure which contains
  *             the SPI instance.
  * @param p_data Pointer to data buffer.
  * @param count_packet Amount of data to be sent.
  * @retval HAL_OK      Operation started successfully.
  * @retval HAL_BUSY    Concurrent process ongoing.
  */
hal_status_t HAL_SPI_Receive_IT(hal_spi_handle_t *hspi, void *p_data, uint32_t count_packet)
{
  hal_status_t status;
  uint32_t data_width;
  uint32_t mode;

  ASSERT_DBG_PARAM(hspi != NULL);
  ASSERT_DBG_PARAM(p_data != NULL);
#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if ((p_data == NULL) || (count_packet == 0U))
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */
  ASSERT_DBG_PARAM(IS_SPI_TRANSFER_SIZE(count_packet));

  ASSERT_DBG_PARAM(IS_SPI_DIRECTION_RX_AVAILABLE(hspi->direction));

  ASSERT_DBG_STATE(hspi->global_state, HAL_SPI_STATE_IDLE);

  /* Critical section */
  HAL_CHECK_UPDATE_STATE(hspi, global_state, HAL_SPI_STATE_IDLE, HAL_SPI_STATE_RX_ACTIVE);

  status      = HAL_OK;
  data_width  = LL_SPI_GetDataWidth((SPI_TypeDef *)((uint32_t)hspi->instance));
  mode        = LL_SPI_GetMode((SPI_TypeDef *)((uint32_t)hspi->instance));

  /* Set the transaction information */
  hspi->p_rx_buff         = (uint8_t *)p_data;
  hspi->rx_xfer_size      = (uint16_t)count_packet;
  hspi->rx_xfer_count     = (uint16_t)count_packet;
#if defined(USE_HAL_SPI_GET_LAST_ERRORS) && (USE_HAL_SPI_GET_LAST_ERRORS == 1)
  hspi->last_error_codes  = HAL_SPI_ERROR_NONE;
#endif /* USE_HAL_SPI_GET_LAST_ERRORS */

  /* Init field not used in handle to zero */
  hspi->p_tx_buff         = NULL;
  hspi->p_tx_isr          = NULL;
  hspi->tx_xfer_size      = (uint16_t)0UL;
  hspi->tx_xfer_count     = (uint16_t)0UL;

  /* Configure communication direction : 1Line */
  if (LL_SPI_IsHalfDuplexDirection((SPI_TypeDef *)((uint32_t)hspi->instance)) != 0UL)
  {
    LL_SPI_SetHalfDuplexDirection((SPI_TypeDef *)((uint32_t)hspi->instance), LL_SPI_HALF_DUPLEX_RX);
  }
  else
  {
    LL_SPI_SetTransferDirection((SPI_TypeDef *)((uint32_t)hspi->instance), LL_SPI_SIMPLEX_RX);
  }

  /* Set the function for IT treatment */
  if (data_width > LL_SPI_DATA_WIDTH_16_BIT)
  {
    hspi->p_rx_isr = SPI_RxISR_32BIT;
  }
  else if (data_width > LL_SPI_DATA_WIDTH_8_BIT)
  {
    hspi->p_rx_isr = SPI_RxISR_16BIT;
  }
  else
  {
    hspi->p_rx_isr = SPI_RxISR_8BIT;
  }

  /* Set the number of data at current transfer */
  LL_SPI_SetTransferSize((SPI_TypeDef *)((uint32_t)hspi->instance), count_packet);

  LL_SPI_Enable((SPI_TypeDef *)((uint32_t)hspi->instance));

  /* Enable EOT, RXP, FRE, MODF and OVR interrupts */
  LL_SPI_EnableIT((SPI_TypeDef *)((uint32_t)hspi->instance),
                  LL_SPI_IT_EOT | LL_SPI_IT_RXP | LL_SPI_IT_OVR | LL_SPI_IT_TIFRE | LL_SPI_IT_MODF);

  if (mode == LL_SPI_MODE_MASTER)
  {
    LL_SPI_StartMasterTransfer((SPI_TypeDef *)((uint32_t)hspi->instance));
  }

