MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_spi.c
  return status;
}

/**
  * @brief Transmit and Receive an amount of data in non-blocking mode with Interrupt.
  * @param hspi Pointer to a \ref hal_spi_handle_t structure which contains
  *             the SPI instance.
  * @param p_tx_data Pointer to transmission data buffer.
  * @param p_rx_data Pointer to reception data buffer.
  * @param count_packet Amount of data to be exchanged in full-duplex. The process
  *                      manages the same number of data for rx and tx transfer.
  * @retval HAL_OK    Operation started successfully.
  * @retval HAL_BUSY  Concurrent process ongoing.
  */
hal_status_t HAL_SPI_TransmitReceive_IT(hal_spi_handle_t *hspi, const void *p_tx_data, void *p_rx_data,
                                        uint32_t count_packet)
{
  hal_status_t status;
  uint32_t data_width;
  uint32_t mode;
  uint32_t tmp_tx_xfer_count;

  ASSERT_DBG_PARAM(hspi != NULL);
  ASSERT_DBG_PARAM(p_tx_data != NULL);
  ASSERT_DBG_PARAM(p_rx_data != NULL);
#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if ((p_tx_data == NULL) || (p_rx_data == NULL) || (count_packet == 0U))
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */
  ASSERT_DBG_PARAM(IS_SPI_TRANSFER_SIZE(count_packet));

  ASSERT_DBG_PARAM(IS_SPI_DIRECTION_FULL_DUPLEX(hspi->direction));

  ASSERT_DBG_STATE(hspi->global_state, HAL_SPI_STATE_IDLE);

  /* Critical section */
  HAL_CHECK_UPDATE_STATE(hspi, global_state, HAL_SPI_STATE_IDLE, HAL_SPI_STATE_TX_RX_ACTIVE);

  status  = HAL_OK;
  data_width     = LL_SPI_GetDataWidth((SPI_TypeDef *)((uint32_t)hspi->instance));
  mode           = LL_SPI_GetMode((SPI_TypeDef *)((uint32_t)hspi->instance));

  /* Set the transaction information */
  hspi->p_tx_buff         = (const uint8_t *)p_tx_data;
  hspi->tx_xfer_size      = (uint16_t)count_packet;
  hspi->tx_xfer_count     = (uint16_t)count_packet;
  hspi->p_rx_buff         = (uint8_t *)p_rx_data;
  hspi->rx_xfer_size      = (uint16_t)count_packet;
  hspi->rx_xfer_count     = (uint16_t)count_packet;
  tmp_tx_xfer_count       = hspi->tx_xfer_count;
#if defined(USE_HAL_SPI_GET_LAST_ERRORS) && (USE_HAL_SPI_GET_LAST_ERRORS == 1)
  hspi->last_error_codes  = HAL_SPI_ERROR_NONE;
#endif /* USE_HAL_SPI_GET_LAST_ERRORS */

  /* Set the function for IT treatment */
  if (data_width > LL_SPI_DATA_WIDTH_16_BIT)
  {
    hspi->p_tx_isr        = SPI_TxISR_32BIT;
    hspi->p_rx_isr        = SPI_RxISR_32BIT;
  }
  else if (data_width > LL_SPI_DATA_WIDTH_8_BIT)
  {
    hspi->p_rx_isr        = SPI_RxISR_16BIT;
    hspi->p_tx_isr        = SPI_TxISR_16BIT;
  }
  else
  {
    hspi->p_rx_isr        = SPI_RxISR_8BIT;
    hspi->p_tx_isr        = SPI_TxISR_8BIT;
  }

  LL_SPI_SetTransferDirection((SPI_TypeDef *)((uint32_t)hspi->instance), LL_SPI_FULL_DUPLEX);

  /* Set the number of data at current transfer */
  LL_SPI_SetTransferSize((SPI_TypeDef *)((uint32_t)hspi->instance), count_packet);

  LL_SPI_Enable((SPI_TypeDef *)((uint32_t)hspi->instance));

  /* Fill in the TxFIFO */
  while ((LL_SPI_IsActiveFlag_TXP((SPI_TypeDef *)((uint32_t)hspi->instance)) != 0UL) && (tmp_tx_xfer_count != 0UL))
  {
    /* Transmit data in 32 Bit mode */
    if (data_width > LL_SPI_DATA_WIDTH_16_BIT)
    {
      LL_SPI_TransmitData32(((SPI_TypeDef *)((uint32_t)hspi->instance)), *((const uint32_t *)hspi->p_tx_buff));
      hspi->p_tx_buff += sizeof(uint32_t);
      hspi->tx_xfer_count--;
      tmp_tx_xfer_count = hspi->tx_xfer_count;
    }
    /* Transmit data in 16 Bit mode */
    else if (data_width > LL_SPI_DATA_WIDTH_8_BIT)
    {
      LL_SPI_TransmitData16(((SPI_TypeDef *)((uint32_t)hspi->instance)), *((const uint16_t *)hspi->p_tx_buff));
      hspi->p_tx_buff += sizeof(uint16_t);
      hspi->tx_xfer_count--;
      tmp_tx_xfer_count = hspi->tx_xfer_count;
    }
    /* Transmit data in 8 Bit mode */
    else
    {
      LL_SPI_TransmitData8(((SPI_TypeDef *)((uint32_t)hspi->instance)), *hspi->p_tx_buff);
      hspi->p_tx_buff += sizeof(uint8_t);
      hspi->tx_xfer_count--;
      tmp_tx_xfer_count = hspi->tx_xfer_count;
    }
  }

  /* Enable EOT, DXP, UDR, OVR, FRE and MODF interrupts */
  LL_SPI_EnableIT((SPI_TypeDef *)((uint32_t)hspi->instance),
                  LL_SPI_IT_EOT | LL_SPI_IT_DXP | LL_SPI_IT_OVR | LL_SPI_IT_UDR | LL_SPI_IT_TIFRE | LL_SPI_IT_MODF);

  if (mode == LL_SPI_MODE_MASTER)
  {
    LL_SPI_StartMasterTransfer((SPI_TypeDef *)((uint32_t)hspi->instance));
  }

  return status;
}

#if defined(USE_HAL_SPI_DMA) && (USE_HAL_SPI_DMA == 1)
/**
  * @brief Transmit an amount of data in non-blocking mode with DMA.
  * @param hspi Pointer to a \ref hal_spi_handle_t structure which contains
  *             the SPI instance.
  * @param p_data Pointer to data buffer.
  * @param count_packet Amount of data to be sent.
  * @retval HAL_OK      Operation started successfully.
  * @retval HAL_BUSY    Concurrent process ongoing.
  * @retval HAL_ERROR   Operation completed with error.
  */
hal_status_t HAL_SPI_Transmit_DMA(hal_spi_handle_t *hspi, const void *p_data, uint32_t count_packet)
{
  hal_status_t status;
  uint32_t data_width;
  uint32_t mode;
  hal_dma_direct_xfer_config_t p_dma_tx_config;
#if defined (USE_HAL_DMA_LINKEDLIST) && (USE_HAL_DMA_LINKEDLIST == 1)
  hal_dma_node_config_t p_dma_tx_node_config;
  hal_dma_node_type_t  p_node_type;
#endif /* USE_HAL_DMA_LINKEDLIST */

  ASSERT_DBG_PARAM(hspi != NULL);
  ASSERT_DBG_PARAM(p_data != NULL);
#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if ((p_data == NULL) || (count_packet == 0U))
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */
  /* Check the transfer size */
  ASSERT_DBG_PARAM(IS_SPI_TRANSFER_SIZE(count_packet));

  /* Check Direction parameter */
  ASSERT_DBG_PARAM(IS_SPI_DIRECTION_TX_AVAILABLE(hspi->direction));

  ASSERT_DBG_STATE(hspi->global_state, HAL_SPI_STATE_IDLE);

  /* Critical section */
  HAL_CHECK_UPDATE_STATE(hspi, global_state, HAL_SPI_STATE_IDLE, HAL_SPI_STATE_TX_ACTIVE);

  status      = HAL_OK;
  data_width  = LL_SPI_GetDataWidth((SPI_TypeDef *)((uint32_t)hspi->instance));
  mode        = LL_SPI_GetMode((SPI_TypeDef *)((uint32_t)hspi->instance));
#if defined (USE_HAL_DMA_LINKEDLIST) && (USE_HAL_DMA_LINKEDLIST == 1)
  p_node_type = HAL_DMA_NODE_LINEAR_ADDRESSING;
#endif /* USE_HAL_DMA_LINKEDLIST */

