MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_spi.c
  /* Critical section */
  HAL_CHECK_UPDATE_STATE(hspi, global_state, HAL_SPI_STATE_IDLE, HAL_SPI_STATE_RX_ACTIVE);

  status  = HAL_OK;
  data_width     = LL_SPI_GetDataWidth((SPI_TypeDef *)((uint32_t)hspi->instance));
  mode           = LL_SPI_GetMode((SPI_TypeDef *)((uint32_t)hspi->instance));
#if defined (USE_HAL_DMA_LINKEDLIST) && (USE_HAL_DMA_LINKEDLIST == 1)
  p_node_type = HAL_DMA_NODE_LINEAR_ADDRESSING;
#endif /* USE_HAL_DMA_LINKEDLIST */

  /* Set the transaction information */
  hspi->p_rx_buff         = (uint8_t *)p_data;
  hspi->rx_xfer_size      = (uint16_t)count_packet;
  hspi->rx_xfer_count     = (uint16_t)count_packet;
#if defined(USE_HAL_SPI_GET_LAST_ERRORS) && (USE_HAL_SPI_GET_LAST_ERRORS == 1)
  hspi->last_error_codes  = HAL_SPI_ERROR_NONE;
#endif /* USE_HAL_SPI_GET_LAST_ERRORS */

  /* Init field not used in handle to zero */
  hspi->p_tx_buff         = NULL;
  hspi->p_rx_isr          = NULL;
  hspi->p_tx_isr          = NULL;
  hspi->tx_xfer_size      = (uint16_t)0UL;
  hspi->tx_xfer_count     = (uint16_t)0UL;

  /* Configure communication direction : 1Line */
  if (LL_SPI_IsHalfDuplexDirection((SPI_TypeDef *)((uint32_t)hspi->instance)) != 0UL)
  {
    LL_SPI_SetHalfDuplexDirection((SPI_TypeDef *)((uint32_t)hspi->instance), LL_SPI_HALF_DUPLEX_RX);
  }
  else
  {
    LL_SPI_SetTransferDirection((SPI_TypeDef *)((uint32_t)hspi->instance), LL_SPI_SIMPLEX_RX);
  }

  /* Get DMA channel basic transfer configuration */
#if defined (USE_HAL_DMA_LINKEDLIST) && (USE_HAL_DMA_LINKEDLIST == 1)
  if (hspi->hdma_rx->xfer_mode == HAL_DMA_XFER_MODE_LINKEDLIST_CIRCULAR)
  {
    /* Get DMA channel circular transfer configuration */
    HAL_DMA_GetNodeConfig(hspi->hdma_rx->p_head_node, &p_dma_rx_node_config, &p_node_type);
    p_dma_rx_config.dest_data_width = p_dma_rx_node_config.xfer.dest_data_width;
  }
  else
  {
    /* Get DMA channel direct transfer configuration */
    HAL_DMA_GetConfigDirectXfer(hspi->hdma_rx, &p_dma_rx_config);
  }
#else /* USE_HAL_DMA_LINKEDLIST */
  HAL_DMA_GetConfigDirectXfer(hspi->hdma_rx, &p_dma_rx_config);
#endif /* USE_HAL_DMA_LINKEDLIST */

  /* Packing mode management is enabled by the DMA settings */
  if (((data_width > LL_SPI_DATA_WIDTH_16_BIT) && (p_dma_rx_config.dest_data_width != HAL_DMA_DEST_DATA_WIDTH_WORD))
      || ((data_width > LL_SPI_DATA_WIDTH_8_BIT)  && (p_dma_rx_config.dest_data_width == HAL_DMA_DEST_DATA_WIDTH_BYTE)))
  {
    /* Restriction the DMA data received is not allowed in this mode */
#if defined(USE_HAL_SPI_GET_LAST_ERRORS) && (USE_HAL_SPI_GET_LAST_ERRORS == 1)
    hspi->last_error_codes = HAL_SPI_ERROR_DMA;
#endif /* USE_HAL_SPI_GET_LAST_ERRORS */
    hspi->global_state = HAL_SPI_STATE_IDLE;
    return HAL_ERROR;
  }

  /* Adjust XferCount according to DMA alignment / Data size */
  if (data_width <= LL_SPI_DATA_WIDTH_8_BIT)
  {
    if (p_dma_rx_config.dest_data_width == HAL_DMA_DEST_DATA_WIDTH_HALFWORD)
    {
      hspi->rx_xfer_count = (hspi->rx_xfer_count + (uint16_t) 1UL) >> 1UL;
    }
    if (p_dma_rx_config.dest_data_width == HAL_DMA_DEST_DATA_WIDTH_WORD)
    {
      hspi->rx_xfer_count = (hspi->rx_xfer_count + (uint16_t) 3UL) >> 2UL;
    }
  }
  else if (data_width <= LL_SPI_DATA_WIDTH_16_BIT)
  {
    if (p_dma_rx_config.dest_data_width == HAL_DMA_DEST_DATA_WIDTH_WORD)
    {
      hspi->rx_xfer_count = (hspi->rx_xfer_count + (uint16_t) 1UL) >> 1UL;
    }
  }
  else
  {
    /* Adjustment done */
  }

  hspi->hdma_rx->p_xfer_halfcplt_cb = SPI_DMAHalfReceiveCplt;
  hspi->hdma_rx->p_xfer_cplt_cb = SPI_DMAReceiveCplt;
  hspi->hdma_rx->p_xfer_error_cb = SPI_DMAError;

  /* Clear RXDMAEN bit */
  LL_SPI_DisableDMAReq_RX((SPI_TypeDef *)((uint32_t)hspi->instance));

  if (data_width <= LL_SPI_DATA_WIDTH_8_BIT)
  {
    hspi->rx_xfer_count = (uint16_t)count_packet;
  }
  else if (data_width <= LL_SPI_DATA_WIDTH_16_BIT)
  {
    hspi->rx_xfer_count = (uint16_t)(count_packet * 2U);
  }
  else
  {
    hspi->rx_xfer_count = (uint16_t)(count_packet * 4U);
  }

  /* Enable the Rx DMA Stream/Channel */
  if (HAL_OK != HAL_DMA_StartPeriphXfer_IT_Opt(hspi->hdma_rx,
                                               (uint32_t) &((SPI_TypeDef *)((uint32_t)hspi->instance))->RXDR,
                                               (uint32_t)hspi->p_rx_buff,
                                               hspi->rx_xfer_count, HAL_DMA_OPT_IT_DEFAULT))
  {
#if defined(USE_HAL_SPI_GET_LAST_ERRORS) && (USE_HAL_SPI_GET_LAST_ERRORS == 1)
    hspi->last_error_codes = HAL_SPI_ERROR_DMA;
#endif /* USE_HAL_SPI_GET_LAST_ERRORS */
    hspi->global_state = HAL_SPI_STATE_IDLE;
    return HAL_ERROR;
  }

  /* Set the number of data at current transfer */
#if defined (USE_HAL_DMA_LINKEDLIST) && (USE_HAL_DMA_LINKEDLIST == 1)
  if (hspi->hdma_rx->xfer_mode == HAL_DMA_XFER_MODE_LINKEDLIST_CIRCULAR)
  {
    LL_SPI_SetTransferSize((SPI_TypeDef *)((uint32_t)hspi->instance), 0UL);
  }
  else
  {
    LL_SPI_SetTransferSize((SPI_TypeDef *)((uint32_t)hspi->instance), count_packet);
  }
#else
  LL_SPI_SetTransferSize((SPI_TypeDef *)((uint32_t)hspi->instance), count_packet);
#endif /* USE_HAL_DMA_LINKEDLIST */

  LL_SPI_EnableDMAReq_RX((SPI_TypeDef *)((uint32_t)hspi->instance));

  LL_SPI_EnableIT((SPI_TypeDef *)((uint32_t)hspi->instance), LL_SPI_IT_OVR | LL_SPI_IT_TIFRE | LL_SPI_IT_MODF);

  LL_SPI_Enable((SPI_TypeDef *)((uint32_t)hspi->instance));

  if (mode == LL_SPI_MODE_MASTER)
  {
    LL_SPI_StartMasterTransfer((SPI_TypeDef *)((uint32_t)hspi->instance));
  }

  return status;
}

/**
  * @brief Transmit and Receive an amount of data in non-blocking mode with DMA.
  * @param hspi Pointer to a \ref hal_spi_handle_t structure which contains
  *             the SPI instance.
  * @param p_tx_data Pointer to transmission data buffer.
  * @param p_rx_data Pointer to reception data buffer.
  * @param count_packet Amount of data to be exchanged in full-duplex. The process
  *                      manages the same number of data for rx and tx transfer.
  * @retval HAL_OK Operation completed successfully.
  * @retval HAL_BUSY Concurrent process ongoing.
  * @retval HAL_ERROR Operation completed with error.
  */
hal_status_t HAL_SPI_TransmitReceive_DMA(hal_spi_handle_t *hspi, const void *p_tx_data, void *p_rx_data,
                                         uint32_t count_packet)
{
  hal_status_t status;
  uint32_t data_width;
  uint32_t mode;
  hal_dma_direct_xfer_config_t p_dma_tx_config;
  hal_dma_direct_xfer_config_t p_dma_rx_config;
#if defined (USE_HAL_DMA_LINKEDLIST) && (USE_HAL_DMA_LINKEDLIST == 1)
  hal_dma_node_config_t p_dma_tx_node_config;
  hal_dma_node_config_t p_dma_rx_node_config;
  hal_dma_node_type_t  p_node_type;
#endif /* USE_HAL_DMA_LINKEDLIST */

  ASSERT_DBG_PARAM(hspi != NULL);
  ASSERT_DBG_PARAM(p_tx_data != NULL);
  ASSERT_DBG_PARAM(p_rx_data != NULL);
#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if ((p_tx_data == NULL) || (p_rx_data == NULL) || (count_packet == 0U))
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */
  ASSERT_DBG_PARAM(IS_SPI_TRANSFER_SIZE(count_packet));
  ASSERT_DBG_PARAM(IS_SPI_DIRECTION_FULL_DUPLEX(hspi->direction));

  ASSERT_DBG_STATE(hspi->global_state, HAL_SPI_STATE_IDLE);

