MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_spi.c
  /* Critical section */
  HAL_CHECK_UPDATE_STATE(hspi, global_state, HAL_SPI_STATE_IDLE, HAL_SPI_STATE_TX_RX_ACTIVE);

  status     = HAL_OK;
  data_width = LL_SPI_GetDataWidth((SPI_TypeDef *)((uint32_t)hspi->instance));
  mode       = LL_SPI_GetMode((SPI_TypeDef *)((uint32_t)hspi->instance));
#if defined (USE_HAL_DMA_LINKEDLIST) && (USE_HAL_DMA_LINKEDLIST == 1)
  p_node_type = HAL_DMA_NODE_LINEAR_ADDRESSING;
#endif /* USE_HAL_DMA_LINKEDLIST */

  /* Set the transaction information */
  hspi->p_tx_buff         = (const uint8_t *)p_tx_data;
  hspi->tx_xfer_size      = (uint16_t)count_packet;
  hspi->tx_xfer_count     = (uint16_t)count_packet;
  hspi->p_rx_buff         = (uint8_t *)p_rx_data;
  hspi->rx_xfer_size      = (uint16_t)count_packet;
  hspi->rx_xfer_count     = (uint16_t)count_packet;
#if defined(USE_HAL_SPI_GET_LAST_ERRORS) && (USE_HAL_SPI_GET_LAST_ERRORS == 1)
  hspi->last_error_codes  = HAL_SPI_ERROR_NONE;
#endif /* USE_HAL_SPI_GET_LAST_ERRORS */

  /* Init field not used in handle to zero */
  hspi->p_rx_isr          = NULL;
  hspi->p_tx_isr          = NULL;

  LL_SPI_SetTransferDirection((SPI_TypeDef *)((uint32_t)hspi->instance), LL_SPI_FULL_DUPLEX);

  /* Get DMA channel basic transfer configuration */
#if defined (USE_HAL_DMA_LINKEDLIST) && (USE_HAL_DMA_LINKEDLIST == 1)
  if (hspi->hdma_tx->xfer_mode == HAL_DMA_XFER_MODE_LINKEDLIST_CIRCULAR)
  {
    /* Get DMA channel circular transfer configuration */
    HAL_DMA_GetNodeConfig(hspi->hdma_tx->p_head_node, &p_dma_tx_node_config, &p_node_type);
    p_dma_tx_config.src_data_width = p_dma_tx_node_config.xfer.src_data_width;
  }
  else
  {
    /* Get DMA channel direct transfer configuration */
    HAL_DMA_GetConfigDirectXfer(hspi->hdma_tx, &p_dma_tx_config);
  }
#else /* USE_HAL_DMA_LINKEDLIST */
  HAL_DMA_GetConfigDirectXfer(hspi->hdma_tx, &p_dma_tx_config);
#endif /* USE_HAL_DMA_LINKEDLIST */
#if defined (USE_HAL_DMA_LINKEDLIST) && (USE_HAL_DMA_LINKEDLIST == 1)
  if (hspi->hdma_rx->xfer_mode == HAL_DMA_XFER_MODE_LINKEDLIST_CIRCULAR)
  {
    /* Get DMA channel circular transfer configuration */
    HAL_DMA_GetNodeConfig(hspi->hdma_rx->p_head_node, &p_dma_rx_node_config, &p_node_type);
    p_dma_rx_config.dest_data_width = p_dma_rx_node_config.xfer.dest_data_width;
  }
  else
  {
    /* Get DMA channel direct transfer configuration */
    HAL_DMA_GetConfigDirectXfer(hspi->hdma_rx, &p_dma_rx_config);
  }
#else /* USE_HAL_DMA_LINKEDLIST */
  HAL_DMA_GetConfigDirectXfer(hspi->hdma_rx, &p_dma_rx_config);
#endif /* USE_HAL_DMA_LINKEDLIST */

  /* Reset the Tx/Rx DMA bits */
  LL_SPI_DisableDMAReq_TX((SPI_TypeDef *)((uint32_t)hspi->instance));
  LL_SPI_DisableDMAReq_RX((SPI_TypeDef *)((uint32_t)hspi->instance));

  /* Packing mode management is enabled by the DMA settings */
  if (((data_width > LL_SPI_DATA_WIDTH_16_BIT)
       && ((p_dma_rx_config.dest_data_width != HAL_DMA_DEST_DATA_WIDTH_WORD)
           || (p_dma_tx_config.src_data_width != HAL_DMA_SRC_DATA_WIDTH_WORD)))
      || ((data_width > LL_SPI_DATA_WIDTH_8_BIT)
          && ((p_dma_rx_config.dest_data_width == HAL_DMA_DEST_DATA_WIDTH_BYTE)
              || (p_dma_tx_config.src_data_width == HAL_DMA_SRC_DATA_WIDTH_BYTE))))
  {
    /* Restriction the DMA data received is not allowed in this mode */
#if defined(USE_HAL_SPI_GET_LAST_ERRORS) && (USE_HAL_SPI_GET_LAST_ERRORS == 1)
    hspi->last_error_codes = HAL_SPI_ERROR_DMA;
#endif /* USE_HAL_SPI_GET_LAST_ERRORS */
    hspi->global_state = HAL_SPI_STATE_IDLE;
    return status;
  }

  /* Adjust XferCount according to DMA alignment / Data size */
  if (data_width <= LL_SPI_DATA_WIDTH_8_BIT)
  {
    if (p_dma_tx_config.src_data_width == HAL_DMA_SRC_DATA_WIDTH_HALFWORD)
    {
      hspi->tx_xfer_count = (hspi->tx_xfer_count + (uint16_t) 1UL) >> 1UL;
    }
    else if (p_dma_tx_config.src_data_width == HAL_DMA_SRC_DATA_WIDTH_WORD)
    {
      hspi->tx_xfer_count = (hspi->tx_xfer_count + (uint16_t) 3UL) >> 2UL;
    }
    else
    {
      /* Nothing to do */
    }
    if (p_dma_rx_config.dest_data_width == HAL_DMA_DEST_DATA_WIDTH_HALFWORD)
    {
      hspi->rx_xfer_count = (hspi->rx_xfer_count + (uint16_t) 1UL) >> 1UL;
    }
    else if (p_dma_rx_config.dest_data_width == HAL_DMA_DEST_DATA_WIDTH_WORD)
    {
      hspi->rx_xfer_count = (hspi->rx_xfer_count + (uint16_t) 3UL) >> 2UL;
    }
    else
    {
      /* Nothing to do */
    }
  }
  else if (data_width <= LL_SPI_DATA_WIDTH_16_BIT)
  {
    if (p_dma_tx_config.src_data_width == HAL_DMA_SRC_DATA_WIDTH_WORD)
    {
      hspi->tx_xfer_count = (hspi->tx_xfer_count + (uint16_t) 1UL) >> 1UL;
    }
    if (p_dma_rx_config.dest_data_width == HAL_DMA_DEST_DATA_WIDTH_WORD)
    {
      hspi->rx_xfer_count = (hspi->rx_xfer_count + (uint16_t) 1UL) >> 1UL;
    }
  }
  else
  {
    /* Adjustment done */
  }

  hspi->hdma_rx->p_xfer_cplt_cb     = SPI_DMATransmitReceiveCplt;
  hspi->hdma_rx->p_xfer_halfcplt_cb = SPI_DMAHalfTransmitReceiveCplt;
  hspi->hdma_rx->p_xfer_error_cb    = SPI_DMAError;

  if (data_width <= LL_SPI_DATA_WIDTH_8_BIT)
  {
    hspi->rx_xfer_count = (uint16_t)count_packet;
  }
  else if (data_width <= LL_SPI_DATA_WIDTH_16_BIT)
  {
    hspi->rx_xfer_count = (uint16_t)(count_packet * 2U);
  }
  else
  {
    hspi->rx_xfer_count = (uint16_t)(count_packet * 4U);
  }
  /* Enable the Rx DMA Stream/Channel  */
  if (HAL_OK != HAL_DMA_StartPeriphXfer_IT_Opt(hspi->hdma_rx,
                                               (uint32_t) &((SPI_TypeDef *)((uint32_t)hspi->instance))->RXDR,
                                               (uint32_t)hspi->p_rx_buff,
                                               hspi->rx_xfer_count, HAL_DMA_OPT_IT_DEFAULT))
  {
#if defined(USE_HAL_SPI_GET_LAST_ERRORS) && (USE_HAL_SPI_GET_LAST_ERRORS == 1)
    hspi->last_error_codes = HAL_SPI_ERROR_DMA;
#endif /* USE_HAL_SPI_GET_LAST_ERRORS */
    hspi->global_state = HAL_SPI_STATE_IDLE;
    return HAL_ERROR;
  }

  /* Set the SPI Tx DMA transfer complete callback because the communication closing
  is performed in DMA reception complete callback  */
  hspi->hdma_tx->p_xfer_cplt_cb     = SPI_DMAEmptyCallback;
  hspi->hdma_tx->p_xfer_halfcplt_cb = SPI_DMAEmptyCallback;
  hspi->hdma_tx->p_xfer_error_cb    = SPI_DMAError;

  if (data_width <= LL_SPI_DATA_WIDTH_8_BIT)
  {
    hspi->tx_xfer_count = (uint16_t)count_packet;
  }
  else if (data_width <= LL_SPI_DATA_WIDTH_16_BIT)
  {
    hspi->tx_xfer_count = (uint16_t)(count_packet * 2U);
  }
  else
  {
    hspi->tx_xfer_count = (uint16_t)(count_packet * 4U);
  }

  /* Enable the Tx DMA Stream/Channel  */
  if (HAL_OK != HAL_DMA_StartPeriphXfer_IT_Opt(hspi->hdma_tx,
                                               (uint32_t)hspi->p_tx_buff,
                                               (uint32_t) &((SPI_TypeDef *)((uint32_t)hspi->instance))->TXDR,
                                               hspi->tx_xfer_count, HAL_DMA_OPT_IT_DEFAULT))
  {
#if defined(USE_HAL_SPI_GET_LAST_ERRORS) && (USE_HAL_SPI_GET_LAST_ERRORS == 1)
    hspi->last_error_codes = HAL_SPI_ERROR_DMA;
#endif /* USE_HAL_SPI_GET_LAST_ERRORS */
    hspi->global_state = HAL_SPI_STATE_IDLE;
    return HAL_ERROR;
  }

  /* Set the number of data at current transfer */
#if defined (USE_HAL_DMA_LINKEDLIST) && (USE_HAL_DMA_LINKEDLIST == 1)
  if (hspi->hdma_tx->xfer_mode == HAL_DMA_XFER_MODE_LINKEDLIST_CIRCULAR)
  {
    LL_SPI_SetTransferSize((SPI_TypeDef *)((uint32_t)hspi->instance), 0UL);
  }
  else
  {
    LL_SPI_SetTransferSize((SPI_TypeDef *)((uint32_t)hspi->instance), count_packet);
  }
#else
  LL_SPI_SetTransferSize((SPI_TypeDef *)((uint32_t)hspi->instance), count_packet);
#endif /* USE_HAL_DMA_LINKEDLIST */

  LL_SPI_EnableDMAReq_RX((SPI_TypeDef *)((uint32_t)hspi->instance));

