MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_spi.c
  LL_SPI_EnableDMAReq_TX((SPI_TypeDef *)((uint32_t)hspi->instance));

  LL_SPI_EnableIT((SPI_TypeDef *)((uint32_t)hspi->instance),
                  LL_SPI_IT_OVR | LL_SPI_IT_UDR | LL_SPI_IT_TIFRE | LL_SPI_IT_MODF);

  LL_SPI_Enable((SPI_TypeDef *)((uint32_t)hspi->instance));

  if (mode == LL_SPI_MODE_MASTER)
  {
    LL_SPI_StartMasterTransfer((SPI_TypeDef *)((uint32_t)hspi->instance));
  }

  return status;
}

#endif /* USE_HAL_SPI_DMA */

/**
  * @brief Abort ongoing transfer (blocking mode).
  * @param hspi SPI handle.
  * @note  This procedure could be used for aborting any ongoing transfer (Tx and Rx),
  *        started in Interrupt or DMA mode.
  * @note  This procedure performs following operations :
  *         + Disable SPI Interrupts (depending of transfer direction).
  *         + Disable the DMA transfer in the peripheral register (if enabled).
  *         + Abort DMA transfer by calling HAL_DMA_Abort (in case of transfer in DMA mode).
  *         + Set handle State to READY.
  * @note   This procedure is executed in blocking mode : when exiting function, Abort is considered as completed.
  * @note   After the abort, other process (Tx, Rx or TxRx) can be started.
  * @retval HAL_OK Operation completed successfully.
  * @retval HAL_ERROR Operation completed with error.
  */
hal_status_t HAL_SPI_Abort(hal_spi_handle_t *hspi)
{
  hal_status_t status;

  volatile uint32_t count;

  ASSERT_DBG_PARAM(hspi != NULL);

  ASSERT_DBG_STATE(hspi->global_state, HAL_SPI_STATE_TX_ACTIVE | HAL_SPI_STATE_RX_ACTIVE | HAL_SPI_STATE_TX_RX_ACTIVE);

  /* Set hspi->state to aborting to avoid any interaction */
  hspi->global_state = HAL_SPI_STATE_ABORT;

  status = HAL_OK;
  count = SPI_DEFAULT_TIMEOUT * (SystemCoreClock / 24UL / 1000UL);

  /* If master communication on going, make sure current frame is done before closing the connection */
  if (LL_SPI_IsActiveMasterTransfer((SPI_TypeDef *)((uint32_t)hspi->instance)) != 0U)
  {
    LL_SPI_DisableIT_EOT((SPI_TypeDef *)((uint32_t)hspi->instance));
    do
    {
      count--;
      if (count == 0UL)
      {
#if defined (USE_HAL_SPI_GET_LAST_ERRORS) && (USE_HAL_SPI_GET_LAST_ERRORS == 1)
        hspi->last_error_codes  = HAL_SPI_ERROR_ABORT;
#endif /* USE_HAL_SPI_GET_LAST_ERRORS */
        status = HAL_ERROR;
        break;
      }
    } while (LL_SPI_IsEnabledIT_EOT((SPI_TypeDef *)((uint32_t)hspi->instance)) != 0U);

    LL_SPI_SuspendMasterTransfer((SPI_TypeDef *)((uint32_t)hspi->instance));

    count = SPI_DEFAULT_TIMEOUT * (SystemCoreClock / 24UL / 1000UL);
    do
    {
      count--;
      if (count == 0UL)
      {
#if defined (USE_HAL_SPI_GET_LAST_ERRORS) && (USE_HAL_SPI_GET_LAST_ERRORS == 1)
        hspi->last_error_codes  = HAL_SPI_ERROR_ABORT;
#endif /* USE_HAL_SPI_GET_LAST_ERRORS */
        status = HAL_ERROR;
        break;
      }
    } while (LL_SPI_IsActiveMasterTransfer((SPI_TypeDef *)((uint32_t)hspi->instance)) != 0U);

    LL_SPI_ClearFlag_SUSP((SPI_TypeDef *)((uint32_t)hspi->instance));
    count = SPI_DEFAULT_TIMEOUT * (SystemCoreClock / 24UL / 1000UL);
    do
    {
      count--;
      if (count == 0UL)
      {
#if defined (USE_HAL_SPI_GET_LAST_ERRORS) && (USE_HAL_SPI_GET_LAST_ERRORS == 1)
        hspi->last_error_codes  = HAL_SPI_ERROR_ABORT;
#endif /* USE_HAL_SPI_GET_LAST_ERRORS */
        status = HAL_ERROR;
        break;
      }
    } while (LL_SPI_IsActiveFlag_SUSP((SPI_TypeDef *)((uint32_t)hspi->instance)) != 0UL);
  }

#if defined (USE_HAL_SPI_DMA) && (USE_HAL_SPI_DMA == 1)
  /* Disable the SPI DMA Tx request if enabled */
  if (LL_SPI_IsEnabledDMAReq_TX((SPI_TypeDef *)((uint32_t)hspi->instance)) != 0U)
  {
    if (hspi->hdma_tx != NULL)
    {
      /* Abort DMA Tx Handle linked to SPI peripheral */
      if (HAL_DMA_Abort(hspi->hdma_tx) != HAL_OK)
      {
#if defined (USE_HAL_SPI_GET_LAST_ERRORS) && (USE_HAL_SPI_GET_LAST_ERRORS == 1)
        hspi->last_error_codes  = HAL_SPI_ERROR_ABORT;
#endif /* USE_HAL_SPI_GET_LAST_ERRORS */
        status = HAL_ERROR;
      }
    }
  }

  /* Disable the SPI DMA Rx request if enabled */
  if (LL_SPI_IsEnabledDMAReq_RX((SPI_TypeDef *)((uint32_t)hspi->instance)) != 0U)
  {
    if (hspi->hdma_rx != NULL)
    {
      /* Abort DMA Rx Handle linked to SPI peripheral */
      if (HAL_DMA_Abort(hspi->hdma_rx) != HAL_OK)
      {
#if defined (USE_HAL_SPI_GET_LAST_ERRORS) && (USE_HAL_SPI_GET_LAST_ERRORS == 1)
        hspi->last_error_codes  = HAL_SPI_ERROR_ABORT;
#endif /* USE_HAL_SPI_GET_LAST_ERRORS */
        status = HAL_ERROR;
      }
    }
  }
#endif /* USE_HAL_SPI_DMA */

  SPI_AbortTransfer(hspi);

  hspi->global_state = HAL_SPI_STATE_IDLE;

  return status;
}

/**
  * @brief Abort ongoing transfer (Interrupt mode).
  * @param hspi SPI handle.
  * @note  This procedure could be used for aborting any ongoing transfer (Tx and Rx),
  *        started in Interrupt or DMA mode.
  * @note  This procedure performs following operations :
  *         + Disable SPI Interrupts (depending of transfer direction).
  *         + Disable the DMA transfer in the peripheral register (if enabled).
  *         + Abort DMA transfer by calling HAL_DMA_Abort_IT (in case of transfer in DMA mode).
  *         + Set handle State to READY.
  *         + At abort completion, call user abort complete callback.
  * @note  This procedure is executed in Interrupt mode, meaning that abort procedure could be
  *        considered as completed only when user abort complete callback is executed (not when exiting function).
  * @retval HAL_OK Operation completed successfully.
  * @retval HAL_ERROR Operation completed with error.
  */
hal_status_t HAL_SPI_Abort_IT(hal_spi_handle_t *hspi)
{
  hal_status_t status;
  volatile uint32_t count;
#if defined (USE_HAL_SPI_DMA) && (USE_HAL_SPI_DMA == 1)
  uint8_t dma_used;
#endif /* USE_HAL_SPI_DMA */

  ASSERT_DBG_PARAM(hspi != NULL);

  ASSERT_DBG_STATE(hspi->global_state, HAL_SPI_STATE_TX_ACTIVE | HAL_SPI_STATE_RX_ACTIVE | HAL_SPI_STATE_TX_RX_ACTIVE);

  /* Set hspi->state to aborting to avoid any interaction */
  hspi->global_state = HAL_SPI_STATE_ABORT;

  status = HAL_OK;
  count = SPI_DEFAULT_TIMEOUT * (SystemCoreClock / 24UL / 1000UL);
#if defined (USE_HAL_SPI_DMA) && (USE_HAL_SPI_DMA == 1)
  dma_used = 0U;
#endif /* USE_HAL_SPI_DMA */

  /* If master communication on going, make sure current frame is done before closing the connection */
  if (LL_SPI_IsActiveMasterTransfer((SPI_TypeDef *)((uint32_t)hspi->instance)) != 0U)
  {
    LL_SPI_DisableIT_EOT((SPI_TypeDef *)((uint32_t)hspi->instance));
    do
    {
      count--;
      if (count == 0UL)
      {
#if defined (USE_HAL_SPI_GET_LAST_ERRORS) && (USE_HAL_SPI_GET_LAST_ERRORS == 1)
        hspi->last_error_codes =  HAL_SPI_ERROR_ABORT;
#endif /* USE_HAL_SPI_GET_LAST_ERRORS */
        status = HAL_ERROR;
        break;
      }
    } while (LL_SPI_IsEnabledIT_EOT((SPI_TypeDef *)((uint32_t)hspi->instance)) != 0U);

    LL_SPI_SuspendMasterTransfer((SPI_TypeDef *)((uint32_t)hspi->instance));

    count = SPI_DEFAULT_TIMEOUT * (SystemCoreClock / 24UL / 1000UL);
    do
    {
      count--;
      if (count == 0UL)
      {
#if defined (USE_HAL_SPI_GET_LAST_ERRORS) && (USE_HAL_SPI_GET_LAST_ERRORS == 1)
        hspi->last_error_codes =  HAL_SPI_ERROR_ABORT;
#endif /* USE_HAL_SPI_GET_LAST_ERRORS */
        status = HAL_ERROR;
        break;
      }
    } while (LL_SPI_IsActiveMasterTransfer((SPI_TypeDef *)((uint32_t)hspi->instance)) != 0U);

    LL_SPI_ClearFlag_SUSP((SPI_TypeDef *)((uint32_t)hspi->instance));

    count = SPI_DEFAULT_TIMEOUT * (SystemCoreClock / 24UL / 1000UL);
    do
    {
      count--;
      if (count == 0UL)
      {
#if defined (USE_HAL_SPI_GET_LAST_ERRORS) && (USE_HAL_SPI_GET_LAST_ERRORS == 1)
        hspi->last_error_codes =  HAL_SPI_ERROR_ABORT;
#endif /* USE_HAL_SPI_GET_LAST_ERRORS */
        status = HAL_ERROR;
        break;
      }
    } while (LL_SPI_IsActiveFlag_SUSP((SPI_TypeDef *)((uint32_t)hspi->instance)) != 0UL);
  }

#if defined (USE_HAL_SPI_DMA) && (USE_HAL_SPI_DMA == 1)
  /* If DMA Tx and/or DMA Rx Handles are associated to SPI Handle, DMA Abort complete callbacks must be initialized
     before any call to DMA Abort functions */

  if (hspi->hdma_rx != NULL)
  {
    if (LL_SPI_IsEnabledDMAReq_RX((SPI_TypeDef *)((uint32_t)hspi->instance)) != 0U)
    {
      /* Set DMA Abort Complete callback if SPI DMA Rx request if enabled */
      hspi->hdma_rx->p_xfer_abort_cb = SPI_DMARxAbortCallback;
    }
    else
    {
      hspi->hdma_rx->p_xfer_abort_cb = NULL;
    }
  }

  if (hspi->hdma_tx != NULL)
  {
    if (LL_SPI_IsEnabledDMAReq_TX((SPI_TypeDef *)((uint32_t)hspi->instance)) != 0U)
    {
      /* Set DMA Abort Complete callback if SPI DMA Tx request if enabled */
      hspi->hdma_tx->p_xfer_abort_cb = SPI_DMATxAbortCallback;

      /* Set dma_used to 1 to make sure abort complete callback is called through DMA */
      dma_used = 1U;

      /* Abort DMA Tx Handle linked to SPI peripheral */
      if (HAL_DMA_Abort_IT(hspi->hdma_tx) != HAL_OK)
      {
#if defined (USE_HAL_SPI_GET_LAST_ERRORS) && (USE_HAL_SPI_GET_LAST_ERRORS == 1)
        hspi->last_error_codes =  HAL_SPI_ERROR_ABORT;
#endif /* USE_HAL_SPI_GET_LAST_ERRORS */
        status = HAL_ERROR;
      }
    }
    else
    {
      hspi->hdma_tx->p_xfer_abort_cb = NULL;
    }
  }

  if (hspi->hdma_rx != NULL)
  {
    if (LL_SPI_IsEnabledDMAReq_RX((SPI_TypeDef *)((uint32_t)hspi->instance)) != 0U)
    {
      /* Set dma_used to 1 to make sure abort complete callback is called through DMA */
      dma_used = 1U;

      /* Abort DMA Rx Handle linked to SPI peripheral */
      if (HAL_DMA_Abort_IT(hspi->hdma_rx) != HAL_OK)
      {
#if defined (USE_HAL_SPI_GET_LAST_ERRORS) && (USE_HAL_SPI_GET_LAST_ERRORS == 1)
        hspi->last_error_codes =  HAL_SPI_ERROR_ABORT;
#endif /* USE_HAL_SPI_GET_LAST_ERRORS */
        status = HAL_ERROR;
      }
    }
  }

  if ((hspi->global_state != HAL_SPI_STATE_IDLE) && (dma_used == 0U))
  {
    SPI_AbortTransfer(hspi);

    hspi->global_state = HAL_SPI_STATE_IDLE;

#if defined(USE_HAL_SPI_REGISTER_CALLBACKS) && (USE_HAL_SPI_REGISTER_CALLBACKS == 1)
    hspi->p_abort_cplt_cb(hspi);
#else
    HAL_SPI_AbortCpltCallback(hspi);
#endif /* USE_HAL_SPI_REGISTER_CALLBACKS */
  }
#else /* USE_HAL_SPI_DMA */
  /* Proceed with abort procedure */
  SPI_AbortTransfer(hspi);

  hspi->global_state = HAL_SPI_STATE_IDLE;

#if defined(USE_HAL_SPI_REGISTER_CALLBACKS) && (USE_HAL_SPI_REGISTER_CALLBACKS == 1)
  hspi->p_abort_cplt_cb(hspi);
#else
  HAL_SPI_AbortCpltCallback(hspi);
#endif /* USE_HAL_SPI_REGISTER_CALLBACKS */
#endif /* USE_HAL_SPI_DMA */

