MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_spi.c
  return status;
}

/**
  * @}
  */

/** @addtogroup SPI_Exported_Functions_Group7 IRQ Handler/Callbacks/Register Callbacks functions
  * @{
  This subsection provides a set of functions allowing to register the SPI process and error callbacks:

    - The function HAL_SPI_IRQHandler() to handle all SPI interrupts

  There are two ways to use callbacks:
  Override weak callbacks functions:
    - Call the function HAL_SPI_TxCpltCallback() to indicate Tx Transfer is completed.
    - Call the function HAL_SPI_RxCpltCallback() to indicate Rx Transfer is completed.
    - Call the function HAL_SPI_TxRxCpltCallback() to indicate Tx/Rx Transfer is completed.
    - Call the function HAL_SPI_TxHalfCpltCallback() to indicate Tx Half Transfer is completed.
    - Call the function HAL_SPI_RxHalfCpltCallback() to indicate Rx Half Transfer is completed.
    - Call the function HAL_SPI_TxRxHalfCpltCallback() to indicate Tx/Rx Half Transfer is completed.
    - Call the function HAL_SPI_ErrorCallback() to indicate invalidate operation is completed.
    - Call the function HAL_SPI_AbortCpltCallback() to indicate Abort operation is completed.
    - Call the function HAL_SPI_SuspendCallback() to indicate when an operation is suspended.

  Or register callbacks user:
    - Call the function HAL_SPI_RegisterTxCpltCallback() to register the Tx transfer complete Callback.
    - Call the function HAL_SPI_RegisterRxCpltCallback() to register the Rx transfer complete Callback.
    - Call the function HAL_SPI_RegisterTxRxCpltCallback() to register the Tx/Rx transfer complete Callback.
    - Call the function HAL_SPI_RegisterTxHalfCpltCallback() to register the Tx Half transfer complete Callback.
    - Call the function HAL_SPI_RegisterRxHalfCpltCallback() to register the Rx Half transfer complete Callback.
    - Call the function HAL_SPI_RegisterTxRxHalfCpltCallback() to register the Tx/Rx Half transfer complete Callback.
    - Call the function HAL_SPI_RegisterErrorCallback() to register the Error Callback.
    - Call the function HAL_SPI_RegisterAbortCpltCallback() to register the Abort operation Callback.
    - Call the function HAL_SPI_RegisterSuspendCallback() to register the SPI Suspend Callback.

  HAL_SPI_IRQHandler() is designed to process the different interruptions :
    - Error interruptions during transfer (OVR, UDR, MODF, TIFRE)
    - Transfer interruptions (DXP, RXP, TXP, EOT)

  Depending on the process function one's use, different callback might be triggered:

| Process API \n \ \n Callbacks | HAL_SPI_Transmit_IT  | HAL_SPI_Receive_IT | HAL_SPI_TransmitReceive_IT |
|-------------------------------|:--------------------:|:------------------:|:--------------------------:|
| HAL_SPI_TxCpltCallback        |           x          |                    |                            |
| HAL_SPI_RxCpltCallback        |                      |          x         |                            |
| HAL_SPI_TxRxCpltCallback      |                      |                    |              x             |
| HAL_SPI_SuspendCallback       |           x          |          x         |              x             |
| HAL_SPI_ErrorCallback         |           x          |          x         |              x             |

| Process API \n \ \n Callbacks  | HAL_SPI_Transmit_DMA  | HAL_SPI_Receive_DMA  | HAL_SPI_TransmitReceive_DMA |
|--------------------------------|:---------------------:|:--------------------:|:---------------------------:|
| HAL_SPI_TxHalfCpltCallback*    |           x           |                      |                             |
| HAL_SPI_TxCpltCallback         |           x           |                      |                             |
| HAL_SPI_RxHalfCpltCallback*    |                       |           x          |                             |
| HAL_SPI_RxCpltCallback         |                       |           x          |                             |
| HAL_SPI_TxRxHalfCpltCallback*  |                       |                      |              x              |
| HAL_SPI_TxRxCpltCallback       |                       |                      |              x              |
| HAL_SPI_ErrorCallback**        |           x           |           x          |              x              |
@note * these callbacks might be called following DMA IRQ management, not SPIx IRQ management.
@note ** these callbacks might be called following DMA IRQ management, or SPIx IRQ management.

| Process API \n \ \n Callbacks      | HAL_SPI_Abort_IT  |
|------------------------------------|:-----------------:|
| HAL_SPI_AbortCpltCallback          |         x         |
| HAL_SPI_ErrorCallback              |         x         |

  */

/**
  * @brief Handle SPI interrupt request.
  * @param hspi Pointer to a \ref hal_spi_handle_t structure which contains
  *             the SPI instance.
  */
void HAL_SPI_IRQHandler(hal_spi_handle_t *hspi)
{
  uint32_t it_source = LL_SPI_READ_REG(((SPI_TypeDef *)((uint32_t)hspi->instance)), IER);
  uint32_t it_flag   = LL_SPI_READ_REG(((SPI_TypeDef *)((uint32_t)hspi->instance)), SR);
  uint32_t trigger  = it_source & it_flag;
#if defined(USE_HAL_SPI_DMA) && (USE_HAL_SPI_DMA == 1)
  uint32_t cfg1_reg_value = LL_SPI_READ_REG(((SPI_TypeDef *)((uint32_t)hspi->instance)), CFG1);
#endif /* USE_HAL_SPI_DMA */
  uint32_t handled  = 0UL;

  hal_spi_state_t tmp_global_state = hspi->global_state;

  /* SPI in SUSPEND mode  ----------------------------------------------------*/
  if (STM32_IS_BIT_SET(it_flag, SPI_SR_SUSP) && STM32_IS_BIT_SET(it_source, SPI_SR_EOT))
  {
    /* Clear the Suspend flag */
    LL_SPI_ClearFlag_SUSP((SPI_TypeDef *)((uint32_t)hspi->instance));

#if defined(USE_HAL_SPI_REGISTER_CALLBACKS) && (USE_HAL_SPI_REGISTER_CALLBACKS == 1)
    hspi->p_suspend_cb(hspi);
#else
    HAL_SPI_SuspendCallback(hspi);
#endif /* USE_HAL_SPI_REGISTER_CALLBACKS */
    return;
  }

  /* SPI in mode Transmitter and Receiver ------------------------------------*/
  if ((STM32_IS_BIT_CLR(trigger, SPI_SR_OVR) && STM32_IS_BIT_CLR(trigger, SPI_SR_UDR))
      && (STM32_IS_BIT_SET(trigger, SPI_SR_DXP)))
  {
    hspi->p_tx_isr(hspi);
    hspi->p_rx_isr(hspi);
    handled = 1UL;
  }

  /* SPI in mode Receiver ----------------------------------------------------*/
  if ((STM32_IS_BIT_CLR(trigger, SPI_SR_OVR) && STM32_IS_BIT_SET(trigger, SPI_SR_RXP))
      && (STM32_IS_BIT_CLR(trigger, SPI_SR_DXP)))
  {
    hspi->p_rx_isr(hspi);
    handled = 1UL;
  }

  /* SPI in mode Transmitter -------------------------------------------------*/
  if ((STM32_IS_BIT_CLR(trigger, SPI_SR_UDR) && STM32_IS_BIT_SET(trigger, SPI_SR_TXP))
      && (STM32_IS_BIT_CLR(trigger, SPI_SR_DXP)))
  {
    hspi->p_tx_isr(hspi);
    handled = 1UL;
  }


