MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_spi.c
  if (handled != 0UL)
  {
    return;
  }

  /* SPI End Of Transfer: DMA or IT based transfer */
  if (STM32_IS_BIT_SET(trigger, SPI_SR_EOT))
  {
    /* Clear EOT/TXTF/SUSP flag */
    LL_SPI_ClearFlag((SPI_TypeDef *)((uint32_t)hspi->instance), LL_SPI_FLAG_EOT | LL_SPI_FLAG_TXTF | LL_SPI_FLAG_SUSP);

    LL_SPI_DisableIT_EOT((SPI_TypeDef *)((uint32_t)hspi->instance));

    /* For the IT based receive extra polling maybe required for last packet */
    if (STM32_IS_BIT_CLR(((SPI_TypeDef *)((uint32_t)hspi->instance))->CFG1, SPI_CFG1_TXDMAEN | SPI_CFG1_RXDMAEN))
    {
      /* Polling remaining data */
      while (hspi->rx_xfer_count != 0UL)
      {
        /* Receive data in 32 Bit mode */
        if (LL_SPI_GetDataWidth((SPI_TypeDef *)((uint32_t)hspi->instance)) > LL_SPI_DATA_WIDTH_16_BIT)
        {
          *((uint32_t *)hspi->p_rx_buff) = LL_SPI_ReceiveData32((SPI_TypeDef *)((uint32_t)hspi->instance));
          hspi->p_rx_buff += sizeof(uint32_t);
        }
        /* Receive data in 16 Bit mode */
        else if (LL_SPI_GetDataWidth((SPI_TypeDef *)((uint32_t)hspi->instance)) > LL_SPI_DATA_WIDTH_8_BIT)
        {
          *((uint16_t *)hspi->p_rx_buff) = LL_SPI_ReceiveData16((SPI_TypeDef *)((uint32_t)hspi->instance));
          hspi->p_rx_buff += sizeof(uint16_t);
        }
        /* Receive data in 8 Bit mode */
        else
        {
          *((uint8_t *)hspi->p_rx_buff) = LL_SPI_ReceiveData8((SPI_TypeDef *)((uint32_t)hspi->instance));
          hspi->p_rx_buff += sizeof(uint8_t);
        }

        hspi->rx_xfer_count--;
      }
    }

    if (SPI_CloseTransfer(hspi) != HAL_OK)
    {
#if defined(USE_HAL_SPI_REGISTER_CALLBACKS) && (USE_HAL_SPI_REGISTER_CALLBACKS == 1)
      hspi->p_error_cb(hspi);
#else
      HAL_SPI_ErrorCallback(hspi);
#endif /* USE_HAL_SPI_REGISTER_CALLBACKS */
    }

#if defined(USE_HAL_SPI_REGISTER_CALLBACKS) && (USE_HAL_SPI_REGISTER_CALLBACKS == 1)
    /* Call appropriate user callback */
    if (tmp_global_state == HAL_SPI_STATE_TX_RX_ACTIVE)
    {
      hspi->p_tx_rx_cplt_cb(hspi);
    }
    else if (tmp_global_state == HAL_SPI_STATE_RX_ACTIVE)
    {
      hspi->p_rx_cplt_cb(hspi);
    }
    else if (tmp_global_state == HAL_SPI_STATE_TX_ACTIVE)
    {
      hspi->p_tx_cplt_cb(hspi);
    }
#else
    /* Call appropriate user callback */
    if (tmp_global_state == HAL_SPI_STATE_TX_RX_ACTIVE)
    {
      HAL_SPI_TxRxCpltCallback(hspi);
    }
    else if (tmp_global_state == HAL_SPI_STATE_RX_ACTIVE)
    {
      HAL_SPI_RxCpltCallback(hspi);
    }
    else if (tmp_global_state == HAL_SPI_STATE_TX_ACTIVE)
    {
      HAL_SPI_TxCpltCallback(hspi);
    }
#endif /* USE_HAL_SPI_REGISTER_CALLBACKS */
    else
    {
      /* End of the appropriate call */
    }

    return;
  }

  /* SPI in Error Treatment --------------------------------------------------*/
  if ((trigger & (SPI_SR_MODF | SPI_SR_OVR | SPI_SR_TIFRE | SPI_SR_UDR)) != 0UL)
  {
    /* SPI Overrun error interrupt occurred ----------------------------------*/
    if ((trigger & SPI_SR_OVR) != 0UL)
    {
#if defined (USE_HAL_SPI_GET_LAST_ERRORS) && (USE_HAL_SPI_GET_LAST_ERRORS == 1)
      STM32_SET_BIT(hspi->last_error_codes, HAL_SPI_ERROR_OVR);
#endif /* USE_HAL_SPI_GET_LAST_ERRORS */
      LL_SPI_ClearFlag_OVR((SPI_TypeDef *)((uint32_t)hspi->instance));
    }

    /* SPI Mode Fault error interrupt occurred -------------------------------*/
    if ((trigger & SPI_SR_MODF) != 0UL)
    {
#if defined (USE_HAL_SPI_GET_LAST_ERRORS) && (USE_HAL_SPI_GET_LAST_ERRORS == 1)
      STM32_SET_BIT(hspi->last_error_codes, HAL_SPI_ERROR_MODF);
#endif /* USE_HAL_SPI_GET_LAST_ERRORS */
      LL_SPI_ClearFlag_MODF((SPI_TypeDef *)((uint32_t)hspi->instance));

      /* Enter in mode fault state */
      hspi->global_state = HAL_SPI_STATE_FAULT;
    }

    /* SPI Frame error interrupt occurred ------------------------------------*/
    if ((trigger & SPI_SR_TIFRE) != 0UL)
    {
#if defined (USE_HAL_SPI_GET_LAST_ERRORS) && (USE_HAL_SPI_GET_LAST_ERRORS == 1)
      STM32_SET_BIT(hspi->last_error_codes, HAL_SPI_ERROR_FRE);
#endif /* USE_HAL_SPI_GET_LAST_ERRORS */
      LL_SPI_ClearFlag_FRE((SPI_TypeDef *)((uint32_t)hspi->instance));
    }

    /* SPI Underrun error interrupt occurred ------------------------------------*/
    if ((trigger & SPI_SR_UDR) != 0UL)
    {
#if defined (USE_HAL_SPI_GET_LAST_ERRORS) && (USE_HAL_SPI_GET_LAST_ERRORS == 1)
      STM32_SET_BIT(hspi->last_error_codes, HAL_SPI_ERROR_UDR);
#endif /* USE_HAL_SPI_GET_LAST_ERRORS */
      LL_SPI_ClearFlag_UDR((SPI_TypeDef *)((uint32_t)hspi->instance));
    }

    /* Disable SPI peripheral */
    LL_SPI_Disable((SPI_TypeDef *)((uint32_t)hspi->instance));

    /* Disable all interrupts */
    LL_SPI_DisableIT((SPI_TypeDef *)((uint32_t)hspi->instance),
                     LL_SPI_IT_EOT | LL_SPI_IT_TXP | LL_SPI_IT_RXP | LL_SPI_IT_DXP |
                     LL_SPI_IT_UDR | LL_SPI_IT_OVR | LL_SPI_IT_TIFRE | LL_SPI_IT_MODF);

#if defined(USE_HAL_SPI_DMA) && (USE_HAL_SPI_DMA == 1)
    /* Disable the SPI DMA requests if enabled */
    if ((STM32_IS_BIT_SET(cfg1_reg_value, SPI_CFG1_RXDMAEN)) || (STM32_IS_BIT_SET(cfg1_reg_value, SPI_CFG1_TXDMAEN)))
    {
      if (STM32_IS_BIT_SET(cfg1_reg_value, SPI_CFG1_RXDMAEN))
      {
        /* Disable the SPI DMA requests */
        LL_SPI_DisableDMAReq_RX((SPI_TypeDef *)((uint32_t)hspi->instance));

        /* Abort the SPI DMA Rx channel */
        if (hspi->hdma_rx != NULL)
        {
          /* Set the SPI DMA Abort callback :
          will lead to call HAL_SPI_ErrorCallback() at end of DMA abort procedure */
          hspi->hdma_rx->p_xfer_abort_cb = SPI_DMAAbortOnError;
          if (HAL_OK != HAL_DMA_Abort_IT(hspi->hdma_rx))
          {
#if defined (USE_HAL_SPI_GET_LAST_ERRORS) && (USE_HAL_SPI_GET_LAST_ERRORS == 1)
            STM32_SET_BIT(hspi->last_error_codes, HAL_SPI_ERROR_ABORT);
#endif /* USE_HAL_SPI_GET_LAST_ERRORS */
          }
        }
      }
      if (STM32_IS_BIT_SET(cfg1_reg_value, SPI_CFG1_TXDMAEN))
      {
        /* Disable the SPI DMA requests */
        LL_SPI_DisableDMAReq_TX((SPI_TypeDef *)((uint32_t)hspi->instance));

        /* Abort the SPI DMA Tx channel */
        if (hspi->hdma_tx != NULL)
        {
          /* Set the SPI DMA Abort callback :
          will lead to call HAL_SPI_ErrorCallback() at end of DMA abort procedure */
          hspi->hdma_tx->p_xfer_abort_cb = SPI_DMAAbortOnError;
          if (HAL_OK != HAL_DMA_Abort_IT(hspi->hdma_tx))
          {
#if defined (USE_HAL_SPI_GET_LAST_ERRORS) && (USE_HAL_SPI_GET_LAST_ERRORS == 1)
            STM32_SET_BIT(hspi->last_error_codes, HAL_SPI_ERROR_ABORT);
#endif /* USE_HAL_SPI_GET_LAST_ERRORS */
          }
        }
      }
    }
    else
    {
#endif /* USE_HAL_SPI_DMA */
      if (hspi->global_state != HAL_SPI_STATE_FAULT)
      {
        hspi->global_state = HAL_SPI_STATE_IDLE;
      }

#if defined(USE_HAL_SPI_REGISTER_CALLBACKS) && (USE_HAL_SPI_REGISTER_CALLBACKS == 1)
      hspi->p_error_cb(hspi);
#else
      HAL_SPI_ErrorCallback(hspi);
#endif /* USE_HAL_SPI_REGISTER_CALLBACKS */
#if defined(USE_HAL_SPI_DMA) && (USE_HAL_SPI_DMA == 1)
    }
#endif /* USE_HAL_SPI_DMA */
  }
}

/**
  * @brief Tx Transfer completed callback.
  * @param hspi Pointer to a \ref hal_spi_handle_t structure which contains
  *             the SPI instance.
  * @warning This weak function must not be modified. When the callback
  *          is needed, it is overridden in the user file.
  */
__WEAK void HAL_SPI_TxCpltCallback(hal_spi_handle_t *hspi)
{
  /* Prevent unused argument(s) compilation warning */
  STM32_UNUSED(hspi);
}

/**
  * @brief Rx Transfer completed callback.
  * @param hspi Pointer to a \ref hal_spi_handle_t structure which contains
  *             the SPI instance.
  * @warning This weak function must not be modified. When the callback
  *          is needed, it is overridden in the user file.
  */
__WEAK void HAL_SPI_RxCpltCallback(hal_spi_handle_t *hspi)
{
  /* Prevent unused argument(s) compilation warning */
  STM32_UNUSED(hspi);
}

/**
  * @brief Tx and Rx Transfer completed callback.
  * @param hspi Pointer to a \ref hal_spi_handle_t structure which contains
  *             the SPI instance.
  * @warning This weak function must not be modified. When the callback
  *          is needed, it is overridden in the user file.
  */
__WEAK void HAL_SPI_TxRxCpltCallback(hal_spi_handle_t *hspi)
{
  /* Prevent unused argument(s) compilation warning */
  STM32_UNUSED(hspi);
}

/**
  * @brief Tx Half Transfer completed callback.
  * @param hspi Pointer to a \ref hal_spi_handle_t structure which contains
  *             the SPI instance.
  * @warning This weak function must not be modified. When the callback
  *          is needed, it is overridden in the user file.
  */
__WEAK void HAL_SPI_TxHalfCpltCallback(hal_spi_handle_t *hspi)
{
  /* Prevent unused argument(s) compilation warning */
  STM32_UNUSED(hspi);
}

/**
  * @brief Rx Half Transfer completed callback.
  * @param hspi Pointer to a \ref hal_spi_handle_t structure which contains
  *             the SPI instance.
  * @warning This weak function must not be modified. When the callback
  *          is needed, it is overridden in the user file.
  */
__WEAK void HAL_SPI_RxHalfCpltCallback(hal_spi_handle_t *hspi)
{
  /* Prevent unused argument(s) compilation warning */
  STM32_UNUSED(hspi);
}

/**
  * @brief Tx and Rx Half Transfer callback.
  * @param hspi Pointer to a \ref hal_spi_handle_t structure which contains
  *             the SPI instance.
  * @warning This weak function must not be modified. When the callback
  *          is needed, it is overridden in the user file.
  */
__WEAK void HAL_SPI_TxRxHalfCpltCallback(hal_spi_handle_t *hspi)
{
  /* Prevent unused argument(s) compilation warning */
  STM32_UNUSED(hspi);
}

/**
  * @brief SPI error callback.
  * @param hspi Pointer to a \ref hal_spi_handle_t structure which contains
  *             the SPI instance.
  * @warning This weak function must not be modified. When the callback
  *          is needed, it is overridden in the user file.
  */
__WEAK void HAL_SPI_ErrorCallback(hal_spi_handle_t *hspi)
{
  /* Prevent unused argument(s) compilation warning */
  STM32_UNUSED(hspi);
}

/**
  * @brief SPI Abort Complete callback.
  * @param hspi Pointer to a \ref hal_spi_handle_t structure which contains
  *             the SPI instance.
  * @warning This weak function must not be modified. When the callback
  *          is needed, it is overridden in the user file.
  */
__WEAK void HAL_SPI_AbortCpltCallback(hal_spi_handle_t *hspi)
{
  /* Prevent unused argument(s) compilation warning */
  STM32_UNUSED(hspi);
}

/**
  * @brief SPI Suspend callback.
  * @param hspi Pointer to a \ref hal_spi_handle_t structure which contains
  *             the SPI instance.
  * @warning This weak function must not be modified. When the callback
  *          is needed, it is overridden in the user file.
  */
__WEAK void HAL_SPI_SuspendCallback(hal_spi_handle_t *hspi)
{
  /* Prevent unused argument(s) compilation warning */
  STM32_UNUSED(hspi);
}

#if defined(USE_HAL_SPI_REGISTER_CALLBACKS) && (USE_HAL_SPI_REGISTER_CALLBACKS == 1)

/**
  * @brief Register the SPI Tx Cplt Callback.
  * @param hspi Pointer to a \ref hal_spi_handle_t structure which contains
  *             the SPI instance.
  * @param p_callback Pointer to the Tx Cplt Callback function.
  * @retval HAL_INVALID_PARAM invalid Callback pointer.
  * @retval HAL_OK Register completed successfully.
  */
hal_status_t HAL_SPI_RegisterTxCpltCallback(hal_spi_handle_t *hspi, hal_spi_cb_t p_callback)
{
  ASSERT_DBG_PARAM((hspi != NULL));
  ASSERT_DBG_PARAM((p_callback != NULL));

