MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_spi.c
  ASSERT_DBG_STATE(hspi->global_state, (uint32_t)HAL_SPI_STATE_INIT | (uint32_t)HAL_SPI_STATE_IDLE);

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if (p_callback == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  hspi->p_tx_cplt_cb = p_callback;

  return HAL_OK;
}

/**
  * @brief Register the SPI Rx Cplt Callback.
  * @param hspi Pointer to a \ref hal_spi_handle_t structure which contains
  *             the SPI instance.
  * @param p_callback Pointer to the Rx Cplt Callback function.
  * @retval HAL_INVALID_PARAM invalid Callback pointer.
  * @retval HAL_OK Register completed successfully.
  */
hal_status_t HAL_SPI_RegisterRxCpltCallback(hal_spi_handle_t *hspi, hal_spi_cb_t p_callback)
{
  ASSERT_DBG_PARAM((hspi != NULL));
  ASSERT_DBG_PARAM((p_callback != NULL));

  ASSERT_DBG_STATE(hspi->global_state, (uint32_t)HAL_SPI_STATE_INIT | (uint32_t)HAL_SPI_STATE_IDLE);

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if (p_callback == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  hspi->p_rx_cplt_cb = p_callback;

  return HAL_OK;
}

/**
  * @brief Register the SPI Tx/Rx Cplt Callback.
  * @param hspi Pointer to a \ref hal_spi_handle_t structure which contains
  *             the SPI instance.
  * @param p_callback Pointer to the Tx/Rx Cplt Callback function.
  * @retval HAL_INVALID_PARAM invalid Callback pointer.
  * @retval HAL_OK Register completed successfully.
  */
hal_status_t HAL_SPI_RegisterTxRxCpltCallback(hal_spi_handle_t *hspi, hal_spi_cb_t p_callback)
{
  ASSERT_DBG_PARAM((hspi != NULL));
  ASSERT_DBG_PARAM((p_callback != NULL));

  ASSERT_DBG_STATE(hspi->global_state, (uint32_t)HAL_SPI_STATE_INIT | (uint32_t)HAL_SPI_STATE_IDLE);

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if (p_callback == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  hspi->p_tx_rx_cplt_cb = p_callback;

  return HAL_OK;
}

/**
  * @brief Register the SPI Tx half Cplt Callback.
  * @param hspi Pointer to a \ref hal_spi_handle_t structure which contains
  *             the SPI instance.
  * @param p_callback Pointer to the Tx half Cplt Callback function.
  * @retval HAL_INVALID_PARAM invalid Callback pointer.
  * @retval HAL_OK Register completed successfully.
  */
hal_status_t HAL_SPI_RegisterTxHalfCpltCallback(hal_spi_handle_t *hspi, hal_spi_cb_t p_callback)
{
  ASSERT_DBG_PARAM((hspi != NULL));
  ASSERT_DBG_PARAM((p_callback != NULL));

  ASSERT_DBG_STATE(hspi->global_state, (uint32_t)HAL_SPI_STATE_INIT | (uint32_t)HAL_SPI_STATE_IDLE);

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if (p_callback == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  hspi->p_tx_half_cplt_cb = p_callback;

  return HAL_OK;
}

/**
  * @brief Register the SPI Rx half Cplt Callback.
  * @param hspi Pointer to a \ref hal_spi_handle_t structure which contains
  *             the SPI instance.
  * @param p_callback Pointer to the Rx half Cplt Callback function.
  * @retval HAL_INVALID_PARAM invalid Callback pointer.
  * @retval HAL_OK Register completed successfully.
  */
hal_status_t HAL_SPI_RegisterRxHalfCpltCallback(hal_spi_handle_t *hspi, hal_spi_cb_t p_callback)
{
  ASSERT_DBG_PARAM((hspi != NULL));
  ASSERT_DBG_PARAM((p_callback != NULL));

  ASSERT_DBG_STATE(hspi->global_state, (uint32_t)HAL_SPI_STATE_INIT | (uint32_t)HAL_SPI_STATE_IDLE);

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if (p_callback == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  hspi->p_rx_half_cplt_cb = p_callback;

  return HAL_OK;
}

/**
  * @brief Register the SPI TxRx half Cplt Callback.
  * @param hspi Pointer to a \ref hal_spi_handle_t structure which contains
  *             the SPI instance.
  * @param p_callback Pointer to the Rx half Cplt Callback function.
  * @retval HAL_INVALID_PARAM invalid Callback pointer.
  * @retval HAL_OK Register completed successfully.
  */
hal_status_t HAL_SPI_RegisterTxRxHalfCpltCallback(hal_spi_handle_t *hspi, hal_spi_cb_t p_callback)
{
  ASSERT_DBG_PARAM((hspi != NULL));
  ASSERT_DBG_PARAM((p_callback != NULL));

  ASSERT_DBG_STATE(hspi->global_state, (uint32_t)HAL_SPI_STATE_INIT | (uint32_t)HAL_SPI_STATE_IDLE);

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if (p_callback == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  hspi->p_tx_rx_half_cplt_cb = p_callback;

  return HAL_OK;
}

/**
  * @brief Register the SPI Error Callback.
  * @param hspi Pointer to a \ref hal_spi_handle_t structure which contains
  *             the SPI instance.
  * @param p_callback Pointer to the Error Callback function.
  * @retval HAL_INVALID_PARAM invalid Callback pointer.
  * @retval HAL_OK Register completed successfully.
  */
hal_status_t HAL_SPI_RegisterErrorCallback(hal_spi_handle_t *hspi, hal_spi_cb_t p_callback)
{
  ASSERT_DBG_PARAM((hspi != NULL));
  ASSERT_DBG_PARAM((p_callback != NULL));

  ASSERT_DBG_STATE(hspi->global_state, (uint32_t)HAL_SPI_STATE_INIT | (uint32_t)HAL_SPI_STATE_IDLE);

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if (p_callback == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  hspi->p_error_cb = p_callback;

  return HAL_OK;
}

/**
  * @brief Register the SPI Abort Cplt Callback.
  * @param hspi Pointer to a \ref hal_spi_handle_t structure which contains
  *             the SPI instance.
  * @param p_callback Pointer to the Abort Cplt Callback function.
  * @retval HAL_INVALID_PARAM invalid Callback pointer.
  * @retval HAL_OK Register completed successfully.
  */
hal_status_t HAL_SPI_RegisterAbortCpltCallback(hal_spi_handle_t *hspi, hal_spi_cb_t p_callback)
{
  ASSERT_DBG_PARAM((hspi != NULL));
  ASSERT_DBG_PARAM((p_callback != NULL));

  ASSERT_DBG_STATE(hspi->global_state, (uint32_t)HAL_SPI_STATE_INIT | (uint32_t)HAL_SPI_STATE_IDLE);

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if (p_callback == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  hspi->p_abort_cplt_cb = p_callback;

  return HAL_OK;
}

/**
  * @brief Register the SPI Suspend Callback.
  * @param hspi Pointer to a \ref hal_spi_handle_t structure which contains
  *             the SPI instance.
  * @param p_callback Pointer to the Error Callback function.
  * @retval HAL_INVALID_PARAM invalid Callback pointer.
  * @retval HAL_OK Register completed successfully.
  */
hal_status_t HAL_SPI_RegisterSuspendCallback(hal_spi_handle_t *hspi, hal_spi_cb_t p_callback)
{
  ASSERT_DBG_PARAM((hspi != NULL));
  ASSERT_DBG_PARAM((p_callback != NULL));

