MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_spi.c
  ASSERT_DBG_STATE(hspi->global_state, (uint32_t)HAL_SPI_STATE_INIT | (uint32_t)HAL_SPI_STATE_IDLE);

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if (p_callback == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  hspi->p_suspend_cb = p_callback;

  return HAL_OK;
}
#endif /* USE_HAL_SPI_REGISTER_CALLBACKS */

/**
  * @}
  */

/** @addtogroup SPI_Exported_Functions_Group8 Peripheral current frequency, state and errors functions
  * @{
  * This subsection provides 3 functions allowing to read peripheral current frequency, state and last occurred errors.
  *  - HAL_SPI_GetClockFreq() API to retrieve the current clock frequency of the SPI peripheral.
  *  - HAL_SPI_GetState() API can be helpful to check in run-time the state of the SPI peripheral.
  *  - HAL_SPI_GetLastErrorCodes() API to retrieve the error codes in case of HAL_ERROR return
  *    available under the compilation switch USE_HAL_SPI_GET_LAST_ERRORS.
  */

/** @brief Return the peripheral clock frequency for SPI.
  * @param hspi Pointer to a \ref hal_spi_handle_t structure which contains
  *             the SPI instance.
  * @retval uint32_t Frequency in Hz.
  * @retval 0 source clock of the hspi not configured or not ready.
  */
uint32_t HAL_SPI_GetClockFreq(const hal_spi_handle_t *hspi)
{
  ASSERT_DBG_PARAM((hspi != NULL));

  ASSERT_DBG_STATE(hspi->global_state, HAL_SPI_STATE_IDLE | HAL_SPI_STATE_TX_ACTIVE | HAL_SPI_STATE_RX_ACTIVE
                   | HAL_SPI_STATE_TX_RX_ACTIVE | HAL_SPI_STATE_ABORT);

  return HAL_RCC_SPI_GetKernelClkFreq((SPI_TypeDef *)((uint32_t)hspi->instance));
}

/**
  * @brief Retrieve the SPI handle state.
  * @param hspi Pointer to a \ref hal_spi_handle_t structure which contains
  *             the SPI instance.
  * @retval hal_spi_state_t SPI state.
  */
hal_spi_state_t HAL_SPI_GetState(const hal_spi_handle_t *hspi)
{
  ASSERT_DBG_PARAM((hspi != NULL));

  return hspi->global_state;
}

#if defined(USE_HAL_SPI_GET_LAST_ERRORS) && (USE_HAL_SPI_GET_LAST_ERRORS == 1)
/**
  * @brief Retrieve the SPI errors codes.
  * @param hspi Pointer to a \ref hal_spi_handle_t structure which contains
  *             the SPI instance.
  * @retval uint32_t Returned value can be a combination of the following values:
  *         @arg HAL_SPI_ERROR_NONE
  *         @arg HAL_SPI_ERROR_MODF
  *         @arg HAL_SPI_ERROR_CRC
  *         @arg HAL_SPI_ERROR_OVR
  *         @arg HAL_SPI_ERROR_FRE
  *         @arg HAL_SPI_ERROR_DMA
  *         @arg HAL_SPI_ERROR_ABORT
  *         @arg HAL_SPI_ERROR_UDR

  */
uint32_t HAL_SPI_GetLastErrorCodes(const hal_spi_handle_t *hspi)
{
  ASSERT_DBG_PARAM(hspi != (void *)NULL);

  ASSERT_DBG_STATE(hspi->global_state, HAL_SPI_STATE_IDLE | HAL_SPI_STATE_TX_ACTIVE | HAL_SPI_STATE_RX_ACTIVE
                   | HAL_SPI_STATE_TX_RX_ACTIVE | HAL_SPI_STATE_FAULT | HAL_SPI_STATE_ABORT
                   | HAL_SPI_STATE_INIT);

  return hspi->last_error_codes;
}
#endif /* USE_HAL_SPI_GET_LAST_ERRORS */

/**
  * @}
  */

#if defined(USE_HAL_MUTEX) && (USE_HAL_MUTEX == 1)

/** @addtogroup SPI_Exported_Functions_Group9 Acquire/release Bus functions
  * @{
  * This subsection provides a set of functions allowing to Acquire/Release the bus based on the HAL OS
  * abstraction layer (stm32_hal_os.c/.h osal):

  * - The HAL_SPI_AcquireBus() must be called from thread mode only (not from handler mode i.e from ISR).
  * - The HAL_SPI_ReleaseBus() can be called from thread mode or from handler mode i.e from ISR.
 */

/**
  * @brief Acquire the SPI bus thanks to the HAL OS abstraction layer (stm32_hal_os.c/.h osal).
  * @param hspi Pointer to a \ref hal_spi_handle_t structure which contains
  *             the SPI instance.
  * @param timeout_ms Time to wait before the bus is occupied by the handle.
  * @note The HAL_SPI_AcquireBus function must be called from thread mode only
  *       (not from handler mode i.e from ISR).
  * @retval HAL_OK    Operation started successfully.
  * @retval HAL_ERROR Operation completed with error.
  */
hal_status_t HAL_SPI_AcquireBus(hal_spi_handle_t *hspi, uint32_t timeout_ms)
{
  hal_status_t status = HAL_ERROR;

  ASSERT_DBG_PARAM((hspi != NULL));

  if (HAL_OS_SemaphoreTake(&hspi->semaphore, timeout_ms) == HAL_OS_OK)
  {
    status = HAL_OK;
  }

  return status;
}

/**
  * @brief Release the SPI bus thanks to the HAL OS abstraction layer (stm32_hal_os.c/.h osal).
  * @param hspi Pointer to a \ref hal_spi_handle_t structure which contains
  *             the SPI instance.
  * @note The HAL_SPI_ReleaseBus function can be called from thread mode or from handler mode i.e from ISR
  * @retval HAL_OK      Operation started successfully.
  * @retval HAL_ERROR Operation completed with error.
  */
hal_status_t HAL_SPI_ReleaseBus(hal_spi_handle_t *hspi)
{
  hal_status_t status = HAL_ERROR;

  ASSERT_DBG_PARAM((hspi != NULL));

  if (HAL_OS_SemaphoreRelease(&hspi->semaphore) == HAL_OS_OK)
  {
    status = HAL_OK;
  }

  return status;
}

/**
  * @}
  */

#endif /* USE_HAL_MUTEX  */

/**
  * @}
  */

/** @addtogroup SPI_Private_Functions SPI Private Functions
  * @{
  */

#if defined(USE_HAL_SPI_DMA) && (USE_HAL_SPI_DMA == 1)
/**
  * @brief DMA SPI transmit process complete callback.
  * @param hdma Pointer to a hal_dma_handle_t structure that contains
  *               the configuration information for the specified DMA module.
  */
static void SPI_DMATransmitCplt(hal_dma_handle_t *hdma)
{
  hal_spi_handle_t *hspi = (hal_spi_handle_t *)((hal_dma_handle_t *)hdma)->p_parent;

  if (hspi->global_state != HAL_SPI_STATE_ABORT)
  {
#if defined (USE_HAL_DMA_LINKEDLIST) && (USE_HAL_DMA_LINKEDLIST == 1)
    if (hspi->hdma_tx->xfer_mode == HAL_DMA_XFER_MODE_LINKEDLIST_CIRCULAR)
    {
#if defined(USE_HAL_SPI_REGISTER_CALLBACKS) && (USE_HAL_SPI_REGISTER_CALLBACKS == 1)
      hspi->p_tx_cplt_cb(hspi);
#else
      HAL_SPI_TxCpltCallback(hspi);
#endif /* USE_HAL_SPI_REGISTER_CALLBACKS */
    }
    else
    {
      LL_SPI_EnableIT_EOT((SPI_TypeDef *)((uint32_t)hspi->instance));
    }
#else
    LL_SPI_EnableIT_EOT((SPI_TypeDef *)((uint32_t)hspi->instance));
#endif /* USE_HAL_DMA_LINKEDLIST */
  }
}

/**
  * @brief DMA SPI receive process complete callback.
  * @param hdma Pointer to a hal_dma_handle_t structure that contains
  *               the configuration information for the specified DMA module.
  */
static void SPI_DMAReceiveCplt(hal_dma_handle_t *hdma)
{
  hal_spi_handle_t *hspi = (hal_spi_handle_t *)((hal_dma_handle_t *)hdma)->p_parent;

  if (hspi->global_state != HAL_SPI_STATE_ABORT)
  {
#if defined (USE_HAL_DMA_LINKEDLIST) && (USE_HAL_DMA_LINKEDLIST == 1)
    if (hspi->hdma_rx->xfer_mode == HAL_DMA_XFER_MODE_LINKEDLIST_CIRCULAR)
    {
#if defined(USE_HAL_SPI_REGISTER_CALLBACKS) && (USE_HAL_SPI_REGISTER_CALLBACKS == 1)
      hspi->p_rx_cplt_cb(hspi);
#else
      HAL_SPI_RxCpltCallback(hspi);
#endif /* USE_HAL_SPI_REGISTER_CALLBACKS */
    }
    else
    {
      LL_SPI_EnableIT_EOT((SPI_TypeDef *)((uint32_t)hspi->instance));
    }
#else
    LL_SPI_EnableIT_EOT((SPI_TypeDef *)((uint32_t)hspi->instance));
#endif /* USE_HAL_DMA_LINKEDLIST */
  }
}

/**
  * @brief DMA SPI transmit receive process complete callback.
  * @param hdma Pointer to a hal_dma_handle_t structure that contains
  *               the configuration information for the specified DMA module.
  */
static void SPI_DMATransmitReceiveCplt(hal_dma_handle_t *hdma)
{
  hal_spi_handle_t *hspi = (hal_spi_handle_t *)((hal_dma_handle_t *)hdma)->p_parent;
#if defined (USE_HAL_DMA_LINKEDLIST) && (USE_HAL_DMA_LINKEDLIST == 1)
  hal_dma_xfer_mode_t hdma_tx_xfer_mode = hspi->hdma_tx->xfer_mode;
  hal_dma_xfer_mode_t hdma_rx_xfer_mode = hspi->hdma_rx->xfer_mode;
#endif /* USE_HAL_DMA_LINKEDLIST */

  if (hspi->global_state != HAL_SPI_STATE_ABORT)
  {
#if defined (USE_HAL_DMA_LINKEDLIST) && (USE_HAL_DMA_LINKEDLIST == 1)
    if ((hdma_tx_xfer_mode == HAL_DMA_XFER_MODE_LINKEDLIST_CIRCULAR)
        && (hdma_rx_xfer_mode == HAL_DMA_XFER_MODE_LINKEDLIST_CIRCULAR))
    {
#if defined(USE_HAL_SPI_REGISTER_CALLBACKS) && (USE_HAL_SPI_REGISTER_CALLBACKS == 1)
      hspi->p_tx_rx_cplt_cb(hspi);
#else
      HAL_SPI_TxRxCpltCallback(hspi);
#endif /* USE_HAL_SPI_REGISTER_CALLBACKS */
    }
    else
    {
      LL_SPI_EnableIT_EOT((SPI_TypeDef *)((uint32_t)hspi->instance));
    }
#else
    LL_SPI_EnableIT_EOT((SPI_TypeDef *)((uint32_t)hspi->instance));
#endif /* USE_HAL_DMA_LINKEDLIST */
  }
}

/**
  * @brief DMA SPI half transmit process complete callback.
  * @param hdma Pointer to a hal_dma_handle_t structure that contains
  *               the configuration information for the specified DMA module.
  */
static void SPI_DMAHalfTransmitCplt(hal_dma_handle_t *hdma)
{
  hal_spi_handle_t *hspi = (hal_spi_handle_t *)((hal_dma_handle_t *)hdma)->p_parent;

#if defined(USE_HAL_SPI_REGISTER_CALLBACKS) && (USE_HAL_SPI_REGISTER_CALLBACKS == 1)
  hspi->p_tx_half_cplt_cb(hspi);
#else
  HAL_SPI_TxHalfCpltCallback(hspi);
#endif /* USE_HAL_SPI_REGISTER_CALLBACKS */
}

/**
  * @brief DMA SPI half receive process complete callback.
  * @param hdma Pointer to a hal_dma_handle_t structure that contains
  *               the configuration information for the specified DMA module.
  */
static void SPI_DMAHalfReceiveCplt(hal_dma_handle_t *hdma)
{
  hal_spi_handle_t *hspi = (hal_spi_handle_t *)((hal_dma_handle_t *)hdma)->p_parent;

#if defined(USE_HAL_SPI_REGISTER_CALLBACKS) && (USE_HAL_SPI_REGISTER_CALLBACKS == 1)
  hspi->p_rx_half_cplt_cb(hspi);
#else
  HAL_SPI_RxHalfCpltCallback(hspi);
#endif /* USE_HAL_SPI_REGISTER_CALLBACKS */
}

/**
  * @brief DMA SPI half transmit receive process complete callback.
  * @param hdma Pointer to a hal_dma_handle_t structure that contains
  *               the configuration information for the specified DMA module.
  */
static void SPI_DMAHalfTransmitReceiveCplt(hal_dma_handle_t *hdma)
{
  hal_spi_handle_t *hspi = (hal_spi_handle_t *)((hal_dma_handle_t *)hdma)->p_parent;

#if defined(USE_HAL_SPI_REGISTER_CALLBACKS) && (USE_HAL_SPI_REGISTER_CALLBACKS == 1)
  hspi->p_tx_rx_half_cplt_cb(hspi);
#else
  HAL_SPI_TxRxHalfCpltCallback(hspi);
#endif /* USE_HAL_SPI_REGISTER_CALLBACKS */
}

/**
  * @brief DMA SPI communication error callback.
  * @param hdma Pointer to a hal_dma_handle_t structure that contains
  *               the configuration information for the specified DMA module.
  */
static void SPI_DMAError(hal_dma_handle_t *hdma)
{
  hal_spi_handle_t *hspi = (hal_spi_handle_t *)((hal_dma_handle_t *)hdma)->p_parent;

