MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_spi.c
  /* if DMA error is FIFO error ignore it */
#if defined(USE_HAL_SPI_GET_LAST_ERRORS) && (USE_HAL_SPI_GET_LAST_ERRORS == 1)
  hspi->last_error_codes  = HAL_SPI_ERROR_DMA;
#endif /* USE_HAL_SPI_GET_LAST_ERRORS */

  (void)SPI_CloseTransfer(hspi);

#if defined(USE_HAL_SPI_REGISTER_CALLBACKS) && (USE_HAL_SPI_REGISTER_CALLBACKS == 1)
  hspi->p_error_cb(hspi);
#else
  HAL_SPI_ErrorCallback(hspi);
#endif /* USE_HAL_SPI_REGISTER_CALLBACKS */
}

/**
  * @brief DMA SPI communication abort callback, when initiated by HAL services on Error.
  *         (To be called at end of DMA Abort procedure following error occurrence).
  * @param hdma DMA handle.
  */
static void SPI_DMAAbortOnError(hal_dma_handle_t *hdma)
{
  hal_spi_handle_t *hspi = (hal_spi_handle_t *)((hal_dma_handle_t *)hdma)->p_parent;

  (void)SPI_CloseTransfer(hspi);

  /* Reset p_xfer_abort_cb */
  hdma->p_xfer_abort_cb = NULL;

#if defined(USE_HAL_SPI_REGISTER_CALLBACKS) && (USE_HAL_SPI_REGISTER_CALLBACKS == 1)
  hspi->p_error_cb(hspi);
#else
  HAL_SPI_ErrorCallback(hspi);
#endif /* USE_HAL_SPI_REGISTER_CALLBACKS */
}

/**
  * @brief DMA SPI Tx communication abort callback, when initiated by user.
  *         (To be called at end of DMA Tx Abort procedure following user abort request).
  * @param hdma DMA handle.
  * @warning When this callback is executed, User Abort complete callback is called only if no
  *         Abort still ongoing for Rx DMA Handle.
  */
static void SPI_DMATxAbortCallback(hal_dma_handle_t *hdma)
{
  hal_spi_handle_t *hspi = (hal_spi_handle_t *)((hal_dma_handle_t *)hdma)->p_parent;

  hspi->hdma_tx->p_xfer_abort_cb = NULL;

  /* Check if an Abort process is still ongoing */
  if (hspi->hdma_rx != NULL)
  {
    if (hspi->hdma_rx->p_xfer_abort_cb != NULL)
    {
      return;
    }
  }

  /* Call the Abort procedure */
  SPI_AbortTransfer(hspi);

  hspi->global_state = HAL_SPI_STATE_IDLE;

#if defined(USE_HAL_SPI_REGISTER_CALLBACKS) && (USE_HAL_SPI_REGISTER_CALLBACKS == 1)
  hspi->p_abort_cplt_cb(hspi);
#else
  HAL_SPI_AbortCpltCallback(hspi);
#endif /* USE_HAL_SPI_REGISTER_CALLBACKS */
}

/**
  * @brief DMA SPI Rx communication abort callback, when initiated by user.
  *         (To be called at end of DMA Rx Abort procedure following user abort request).
  * @param hdma DMA handle.
  * @warning When this callback is executed, User Abort complete callback is called only if no
  *         Abort still ongoing for Tx DMA Handle.
  */
static void SPI_DMARxAbortCallback(hal_dma_handle_t *hdma)
{
  hal_spi_handle_t *hspi = (hal_spi_handle_t *)((hal_dma_handle_t *)hdma)->p_parent;

  hspi->hdma_rx->p_xfer_abort_cb = NULL;

  /* Check if an Abort process is still ongoing */
  if (hspi->hdma_tx != NULL)
  {
    if (hspi->hdma_tx->p_xfer_abort_cb != NULL)
    {
      return;
    }
  }

  /* Call the Abort procedure */
  SPI_AbortTransfer(hspi);

  hspi->global_state = HAL_SPI_STATE_IDLE;

#if defined(USE_HAL_SPI_REGISTER_CALLBACKS) && (USE_HAL_SPI_REGISTER_CALLBACKS == 1)
  hspi->p_abort_cplt_cb(hspi);
#else
  HAL_SPI_AbortCpltCallback(hspi);
#endif /* USE_HAL_SPI_REGISTER_CALLBACKS */
}

/**
  * @brief DMA SPI empty callback.
  * @param hdma Pointer to a hal_dma_handle_t structure that contains
  *               the configuration information for the specified DMA module.
  */
static void SPI_DMAEmptyCallback(hal_dma_handle_t *hdma)
{
  /* Prevent unused argument(s) compilation warning */
  STM32_UNUSED(hdma);

  /* NOTE : As TC callback is mandatory inside DMA handle, the SPI_DMAEmptyCallback
   *        is used to be called on TC DMA event.
   *        Use when SPI is in Full-Duplex as only one DMA channel is used global TC.
   */
}
#endif /* USE_HAL_SPI_DMA */

/**
  * @brief Manage the receive 8-bit in Interrupt context.
  * @param hspi Pointer to a \ref hal_spi_handle_t structure which contains
  *             the SPI instance.
  */
static void SPI_RxISR_8BIT(hal_spi_handle_t *hspi)
{
  /* Receive data in 8 Bit mode */
  *((uint8_t *)hspi->p_rx_buff) = LL_SPI_ReceiveData8((SPI_TypeDef *)((uint32_t)hspi->instance));
  hspi->p_rx_buff += sizeof(uint8_t);
  hspi->rx_xfer_count--;

  /* Disable IT if no more data expected */
  if (hspi->rx_xfer_count == 0UL)
  {
    LL_SPI_DisableIT_RXP((SPI_TypeDef *)((uint32_t)hspi->instance));
  }
}


/**
  * @brief Manage the 16-bit receive in Interrupt context.
  * @param hspi Pointer to a \ref hal_spi_handle_t structure which contains
  *             the SPI instance.
  */
static void SPI_RxISR_16BIT(hal_spi_handle_t *hspi)
{
  /* Receive data in 16 Bit mode */
  *((uint16_t *)hspi->p_rx_buff) = LL_SPI_ReceiveData16((SPI_TypeDef *)((uint32_t)hspi->instance));
  hspi->p_rx_buff += sizeof(uint16_t);
  hspi->rx_xfer_count--;

  /* Disable IT if no more data expected */
  if (hspi->rx_xfer_count == 0UL)
  {
    LL_SPI_DisableIT_RXP((SPI_TypeDef *)((uint32_t)hspi->instance));
  }
}


/**
  * @brief Manage the 32-bit receive in Interrupt context.
  * @param hspi Pointer to a \ref hal_spi_handle_t structure which contains
  *             the SPI instance.
  */
static void SPI_RxISR_32BIT(hal_spi_handle_t *hspi)
{
  /* Receive data in 32 Bit mode */
  *((uint32_t *)hspi->p_rx_buff) = LL_SPI_ReceiveData32((SPI_TypeDef *)((uint32_t)hspi->instance));
  hspi->p_rx_buff += sizeof(uint32_t);
  hspi->rx_xfer_count--;

  /* Disable IT if no more data expected */
  if (hspi->rx_xfer_count == 0UL)
  {
    LL_SPI_DisableIT_RXP((SPI_TypeDef *)((uint32_t)hspi->instance));
  }
}


/**
  * @brief Handle the data 8-bit transmit in Interrupt mode.
  * @param hspi Pointer to a \ref hal_spi_handle_t structure which contains
  *             the SPI instance.
  */
static void SPI_TxISR_8BIT(hal_spi_handle_t *hspi)
{
  if (hspi->tx_xfer_count != 0UL)
  {
    LL_SPI_TransmitData8(((SPI_TypeDef *)((uint32_t)hspi->instance)), *hspi->p_tx_buff);
    hspi->p_tx_buff += sizeof(uint8_t);
    hspi->tx_xfer_count--;
  }
  else
  {
    /* Disable IT if no more data expected */
    LL_SPI_DisableIT_TXP((SPI_TypeDef *)((uint32_t)hspi->instance));
  }
}

/**
  * @brief Handle the data 16-bit transmit in Interrupt mode.
  * @param hspi Pointer to a \ref hal_spi_handle_t structure which contains
  *             the SPI instance.
  */
static void SPI_TxISR_16BIT(hal_spi_handle_t *hspi)
{
  if (hspi->tx_xfer_count != 0UL)
  {
    LL_SPI_TransmitData16(((SPI_TypeDef *)((uint32_t)hspi->instance)), *((const uint16_t *)hspi->p_tx_buff));
    hspi->p_tx_buff += sizeof(uint16_t);
    hspi->tx_xfer_count--;
  }
  else
  {
    /* Disable IT if no more data expected */
    LL_SPI_DisableIT_TXP((SPI_TypeDef *)((uint32_t)hspi->instance));
  }
}

/**
  * @brief Handle the data 32-bit transmit in Interrupt mode.
  * @param hspi Pointer to a \ref hal_spi_handle_t structure which contains
  *             the SPI instance.
  */
static void SPI_TxISR_32BIT(hal_spi_handle_t *hspi)
{
  if (hspi->tx_xfer_count != 0UL)
  {
    LL_SPI_TransmitData32(((SPI_TypeDef *)((uint32_t)hspi->instance)), *((const uint32_t *)hspi->p_tx_buff));
    hspi->p_tx_buff += sizeof(uint32_t);
    hspi->tx_xfer_count--;
  }
  else
  {
    /* Disable IT if no more data expected */
    LL_SPI_DisableIT_TXP((SPI_TypeDef *)((uint32_t)hspi->instance));
  }
}

/**
  * @brief Abort Transfer and clear flags.
  * @param hspi Pointer to a \ref hal_spi_handle_t structure which contains
  *             the SPI instance.
  */
static void SPI_AbortTransfer(hal_spi_handle_t *hspi)
{
  LL_SPI_Disable((SPI_TypeDef *)((uint32_t)hspi->instance));

  /* Disable ITs */
  LL_SPI_DisableIT((SPI_TypeDef *)((uint32_t)hspi->instance),
                   LL_SPI_IT_EOT | LL_SPI_IT_DXP | LL_SPI_IT_TXP | LL_SPI_IT_RXP |
                   LL_SPI_IT_OVR | LL_SPI_IT_UDR | LL_SPI_IT_TIFRE | LL_SPI_IT_MODF);

  /* Clear the Status flags in the SR register */
  LL_SPI_ClearFlag_EOT((SPI_TypeDef *)((uint32_t)hspi->instance));
  LL_SPI_ClearFlag_TXTF((SPI_TypeDef *)((uint32_t)hspi->instance));

#if defined(USE_HAL_SPI_DMA) && (USE_HAL_SPI_DMA == 1)
  /* Disable Tx and Rx DMA Request */
  LL_SPI_DisableDMAReq_TX((SPI_TypeDef *)((uint32_t)hspi->instance));
  LL_SPI_DisableDMAReq_RX((SPI_TypeDef *)((uint32_t)hspi->instance));
#endif /* USE_HAL_SPI_DMA */

