MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_spi.c
  /* Clear the Error flags in the SR register */
  LL_SPI_ClearFlag((SPI_TypeDef *)((uint32_t)hspi->instance),
                   LL_SPI_FLAG_OVR | LL_SPI_FLAG_UDR | LL_SPI_FLAG_TIFRE | LL_SPI_FLAG_MODF | LL_SPI_FLAG_SUSP);

#if (USE_HAL_SPI_CRC != 0U)
  LL_SPI_ClearFlag_CRCERR((SPI_TypeDef *)((uint32_t)hspi->instance));
#endif /* USE_HAL_SPI_CRC */

  hspi->tx_xfer_count = (uint16_t)0UL;
  hspi->rx_xfer_count = (uint16_t)0UL;
}

/**
  * @brief Close Transfer and clear flags.
  * @param hspi Pointer to a \ref hal_spi_handle_t structure which contains
  *             the SPI instance.
  * @retval HAL_OK Operation completed successfully.
  * @retval HAL_ERROR Operation completed with error.
  */
static hal_status_t SPI_CloseTransfer(hal_spi_handle_t *hspi)
{
  hal_status_t status = HAL_OK;

  /* Clear the Status flags in the SR register */
  LL_SPI_ClearFlag((SPI_TypeDef *)((uint32_t)hspi->instance), LL_SPI_FLAG_EOT | LL_SPI_FLAG_TXTF);

#if (USE_HAL_SPI_CRC != 0UL)
  /* Check if CRC error occurred */
  if (LL_SPI_IsEnabledCRC((SPI_TypeDef *)((uint32_t)hspi->instance)) != 0UL)
  {
    if (LL_SPI_IsActiveFlag_CRCERR((SPI_TypeDef *)((uint32_t)hspi->instance)) != 0UL)
    {
#if defined(USE_HAL_SPI_GET_LAST_ERRORS) && (USE_HAL_SPI_GET_LAST_ERRORS == 1)
      STM32_SET_BIT(hspi->last_error_codes, HAL_SPI_ERROR_CRC);
#endif /* USE_HAL_SPI_GET_LAST_ERRORS */
      LL_SPI_ClearFlag_CRCERR((SPI_TypeDef *)((uint32_t)hspi->instance));

      status = HAL_ERROR;
    }
  }
#endif /* USE_HAL_SPI_CRC */

  /* Report Underrun error for non RX Only communication */
  if (hspi->global_state != HAL_SPI_STATE_RX_ACTIVE)
  {
    if (LL_SPI_IsActiveFlag_UDR((SPI_TypeDef *)((uint32_t)hspi->instance)) != 0UL)
    {
#if defined(USE_HAL_SPI_GET_LAST_ERRORS) && (USE_HAL_SPI_GET_LAST_ERRORS == 1)
      STM32_SET_BIT(hspi->last_error_codes, HAL_SPI_ERROR_UDR);
#endif /* USE_HAL_SPI_GET_LAST_ERRORS */
      LL_SPI_ClearFlag_UDR((SPI_TypeDef *)((uint32_t)hspi->instance));

      status = HAL_ERROR;
    }
  }

  /* Report Overrun error for non TX Only communication */
  if (hspi->global_state != HAL_SPI_STATE_TX_ACTIVE)
  {
    if (LL_SPI_IsActiveFlag_OVR((SPI_TypeDef *)((uint32_t)hspi->instance)) != 0UL)
    {
#if defined(USE_HAL_SPI_GET_LAST_ERRORS) && (USE_HAL_SPI_GET_LAST_ERRORS == 1)
      STM32_SET_BIT(hspi->last_error_codes, HAL_SPI_ERROR_OVR);
#endif /* USE_HAL_SPI_GET_LAST_ERRORS */
      LL_SPI_ClearFlag_OVR((SPI_TypeDef *)((uint32_t)hspi->instance));

      status = HAL_ERROR;
    }
  }

  /* SPI Mode Fault error interrupt occurred -------------------------------*/
  if (LL_SPI_IsActiveFlag_MODF((SPI_TypeDef *)((uint32_t)hspi->instance)) != 0UL)
  {
#if defined(USE_HAL_SPI_GET_LAST_ERRORS) && (USE_HAL_SPI_GET_LAST_ERRORS == 1)
    STM32_SET_BIT(hspi->last_error_codes, HAL_SPI_ERROR_MODF);
#endif /* USE_HAL_SPI_GET_LAST_ERRORS */
    LL_SPI_ClearFlag_MODF((SPI_TypeDef *)((uint32_t)hspi->instance));

    /* Enter in mode fault state */
    hspi->global_state = HAL_SPI_STATE_FAULT;

    status = HAL_ERROR;
  }

  /* SPI Frame error interrupt occurred ------------------------------------*/
  if (LL_SPI_IsActiveFlag_FRE((SPI_TypeDef *)((uint32_t)hspi->instance)) != 0UL)
  {
#if defined(USE_HAL_SPI_GET_LAST_ERRORS) && (USE_HAL_SPI_GET_LAST_ERRORS == 1)
    STM32_SET_BIT(hspi->last_error_codes, HAL_SPI_ERROR_FRE);
#endif /* USE_HAL_SPI_GET_LAST_ERRORS */
    LL_SPI_ClearFlag_FRE((SPI_TypeDef *)((uint32_t)hspi->instance));

    status = HAL_ERROR;
  }

  LL_SPI_Disable((SPI_TypeDef *)((uint32_t)hspi->instance));

  /* Disable ITs */
  LL_SPI_DisableIT((SPI_TypeDef *)((uint32_t)hspi->instance),
                   LL_SPI_IT_EOT | LL_SPI_IT_TXP | LL_SPI_IT_RXP | LL_SPI_IT_DXP |
                   LL_SPI_IT_UDR | LL_SPI_IT_OVR | LL_SPI_IT_TIFRE | LL_SPI_IT_MODF);

#if defined(USE_HAL_SPI_DMA) && (USE_HAL_SPI_DMA == 1)
  LL_SPI_DisableDMAReq_TX((SPI_TypeDef *)((uint32_t)hspi->instance));
  LL_SPI_DisableDMAReq_RX((SPI_TypeDef *)((uint32_t)hspi->instance));
#endif /* USE_HAL_SPI_DMA */

  hspi->tx_xfer_count = (uint16_t)0UL;
  hspi->rx_xfer_count = (uint16_t)0UL;

  if (hspi->global_state != HAL_SPI_STATE_FAULT)
  {
    hspi->global_state = HAL_SPI_STATE_IDLE;
  }
  return status;
}

/**
  * @brief Handle SPI Communication Timeout.
  * @param hspi Pointer to a \ref hal_spi_handle_t structure which contains
  *             the SPI instance.
  * @param timeout_ms Timeout duration.
  * @param tick_start Tick start value.
  * @retval HAL_OK Operation completed successfully.
  * @retval HAL_TIMEOUT Operation exceeds user timeout.
  */
static hal_status_t SPI_WaitEndOfTransfer(hal_spi_handle_t *hspi,
                                          uint32_t timeout_ms, uint32_t tick_start)
{
  while ((LL_SPI_IsActiveFlag((SPI_TypeDef *)((uint32_t)hspi->instance), SPI_SR_EOT) == 0UL))
  {
    if (timeout_ms != HAL_MAX_DELAY)
    {
      if (((HAL_GetTick() - tick_start) > timeout_ms) || (timeout_ms == 0U))
      {
        if ((LL_SPI_IsActiveFlag((SPI_TypeDef *)((uint32_t)hspi->instance), SPI_SR_EOT) == 0UL))
        {
          hspi->global_state = HAL_SPI_STATE_IDLE;
          return HAL_TIMEOUT;
        }
      }
    }
  }
  return HAL_OK;
}

/**
  * @}
  */

#endif /* USE_HAL_SPI_MODULE */
#endif /* SPI1 || SPI2 || SPI3 */

/**
  * @}
  */

/**
  * @}
  */
